python.org
#+TITLE: Python
#+SETUPFILE:css/emacs-org.setup
[  [[./index.html][Home]] ]  $&ensp;$  | $&ensp;$ $&ensp;$ [text] $&ensp;$  $&ensp;$ | $&ensp;$ $&ensp;$ [link] $&ensp;$ $&ensp;$ | $&ensp;$ $&ensp;$ [title] $&ensp;$ $&ensp;$ | $&ensp;$ $&ensp;$ [icon] $&ensp;$ $&ensp;$ | $&ensp;$ $&ensp;$ [target]  $&ensp;$ $&ensp;$ | $&ensp;$ $&ensp;$ [expanded]  $&ensp;$ $&ensp;$
-----
 

* Python Introudctio
** History:
Created by Guido Rossum in 1980 is very easy to learn
Python is 
interpreted logic ,
object-oriented, 
high-level programming language 
** Who uses python
youtubbe,dropbox,raspberry netfilx,nsa,nasa,bittorrent
** Features :
- Simple and Easy to learn
- High Level Language
- Portable: windows,linux,ios
- Support differetn Programming Paradigm (procedure-oriented / object-oriented)
- Extensible
* TODO Installation
** TODO Install in Window and Linux

** TODO Python Library Package Manager <pip> and <conda>
