python.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2025-08-02 Sat 10:01 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="author" content="Karthik D" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="css/readtheorg.css"/>
<link rel="stylesheet" type="text/css" href="css/jupyter2org.css" />
<link rel="stylesheet" type="text/css" href="css/readtheorg-htmlize.css"/>

</head>
<body>
<div id="content" class="content">
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org48d12d8">Python Introudctio</a>
<ul>
<li><a href="#org81767ce">History:</a></li>
<li><a href="#org7cb2a8b">Who uses python</a></li>
<li><a href="#org5334a9d">Features :</a></li>
</ul>
</li>
<li><a href="#org221d70c"><span class="todo TODO">TODO</span> Installation</a>
<ul>
<li><a href="#orgdfda937"><span class="todo TODO">TODO</span> Install in Window and Linux</a></li>
<li><a href="#org3ad569f"><span class="todo TODO">TODO</span> Python Library Package Manager &lt;pip&gt; and &lt;conda&gt;</a>
<ul>
<li><a href="#org3c6e878">Install/Upgrade/Uninstall  package using pip</a></li>
</ul>
</li>
<li><a href="#org2ab5b8b">Conda</a></li>
<li><a href="#org3f779e0"><span class="todo TODO">TODO</span> Virtural Environment</a></li>
<li><a href="#orgc2b08e8"><span class="todo TODO">TODO</span> Requirement file</a></li>
<li><a href="#org1513709">Conda virtual env</a></li>
<li><a href="#orgbb59662">conda environment.yml</a></li>
</ul>
</li>
<li><a href="#org9a1d6a2">Python Editors</a>
<ul>
<li><a href="#orgae291d2">Jupyter</a></li>
</ul>
</li>
<li><a href="#org989b702">Variables</a>
<ul>
<li><a href="#org1e0a8e4">Definition</a></li>
<li><a href="#orgc315c07">Python Variable Naming Convention</a></li>
<li><a href="#org133c185">Examples</a></li>
<li><a href="#org727f728">CamelCase</a></li>
</ul>
</li>
<li><a href="#org99f6511">Data types</a>
<ul>
<li><a href="#org7532565">Intro</a>
<ul>
<li><a href="#orge454b9d">immutable vs mutable</a></li>
</ul>
</li>
<li><a href="#org38169be">Number</a>
<ul>
<li><a href="#org43f43c2">Integers eg 1,4,5,</a></li>
<li><a href="#org10fd5f0">Float    eg 3.5,3.1246,</a></li>
<li><a href="#org3b331f1">Complex  eg 3+2j, 4+5j</a></li>
<li><a href="#org2d3fe60">Operators in python:</a></li>
</ul>
</li>
<li><a href="#org70dd26e">String</a>
<ul>
<li><a href="#org6a9f93a">defination</a></li>
<li><a href="#org83929b6">Quotes</a></li>
<li><a href="#org02bbb19">Operations</a></li>
<li><a href="#org8c46389">Method</a></li>
<li><a href="#org1172b9e">String Encoding Function:</a></li>
<li><a href="#org0862462">String Formating</a></li>
<li><a href="#orgd51c2c2">Print</a></li>
<li><a href="#orgfdf0588">EVAL : evaluate the string</a></li>
</ul>
</li>
<li><a href="#org8b92653">Tubles</a>
<ul>
<li><a href="#orgfdbbc5a">defination</a></li>
<li><a href="#orge92e81f">Operations</a></li>
</ul>
</li>
<li><a href="#org1835204">List</a>
<ul>
<li><a href="#org3bddb6b">Syntax</a></li>
<li><a href="#org6bf597b">Operations</a></li>
<li><a href="#orgf1c25f4">Slicing</a></li>
<li><a href="#org378b5dd">Sorted vs list.sorted</a></li>
<li><a href="#org4ac9861">Operations</a></li>
</ul>
</li>
<li><a href="#orgee85bed">Tubles</a>
<ul>
<li><a href="#orgb93ae45">Defination</a></li>
<li><a href="#org25591be">Operations</a></li>
</ul>
</li>
<li><a href="#org8e0d759">Dictionary</a>
<ul>
<li><a href="#orgef810a8">Defination</a></li>
<li><a href="#orgbaaf868">Adding New entity</a></li>
<li><a href="#orga81bb4d">Deleting a key , Dic</a></li>
<li><a href="#org5f65f07">Dict is UnOrder</a></li>
<li><a href="#org93e724e">Ordered</a></li>
<li><a href="#org46d9e59">Operations</a></li>
<li><a href="#orga929d5b">Methods</a></li>
<li><a href="#org6b043fd">Loop in dictionary</a></li>
</ul>
</li>
<li><a href="#org27d905a">Set</a>
<ul>
<li><a href="#org5cc24cd">defination</a></li>
<li><a href="#org863c843">Syntax</a></li>
<li><a href="#orge68c25c">Adding elements</a></li>
<li><a href="#org834c4e8">Union,Intersection,difference,symmetric differ</a></li>
<li><a href="#orgc6b01aa">Sort</a></li>
<li><a href="#orgef75da5">remove or discard elements</a></li>
<li><a href="#orgc288909">subset/superset</a></li>
<li><a href="#orga17e5e5">Methods</a></li>
</ul>
</li>
<li><a href="#org1a2e8af">Type Conversions</a>
<ul>
<li><a href="#org1e19867">tub2list</a></li>
<li><a href="#orgaeb3fb4">list2Str</a></li>
<li><a href="#org73e7b83">tubles2set</a></li>
<li><a href="#org5810eb9">Conversion tubles2dic</a></li>
<li><a href="#org669b82d">String2int</a></li>
<li><a href="#orgffd58a8">str2float</a></li>
<li><a href="#orgbd1ae19">str2list,set,tuple</a></li>
</ul>
</li>
<li><a href="#orgde5fc04">Sort</a></li>
</ul>
</li>
<li><a href="#org4f5ee80">Data Binding</a></li>
<li><a href="#org4ba79ca">Flow Control</a>
<ul>
<li>
<ul>
<li><a href="#org48b9fe7">if elif else</a></li>
<li><a href="#orgafd70cd">Loop</a></li>
<li><a href="#org04a8695">Flow control :</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orga2120e6">Loop</a></li>
<li><a href="#org7e979c0">Comprehension</a>
<ul>
<li><a href="#org24a3c0e">If-else Comprehension</a></li>
<li><a href="#orge4e1225">List Comprehension</a></li>
<li><a href="#orgd23e91c">List Comprehension for dynamical create List of  integer</a></li>
<li><a href="#org6a185b4">Dictitionary Comprehension</a></li>
<li><a href="#orgbb4aa10">Set Comprehension</a></li>
<li><a href="#org6e6899c">Generator Expression</a></li>
</ul>
</li>
<li><a href="#org6a9d9c5">Keyboard Input:</a></li>
<li><a href="#orgec76e44">Function</a>
<ul>
<li>
<ul>
<li><a href="#org1c97ead">Syntax</a></li>
<li><a href="#orgc814a69">Pass by Reference</a></li>
<li><a href="#org767275d">Pass by Value</a></li>
<li><a href="#org1edf15b">argument</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orgeda8a1a">Namespace &amp; Scope</a>
<ul>
<li>
<ul>
<li><a href="#org1cb6f15">Scope</a></li>
<li><a href="#org7a21f24">Namespace</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org630faf5">Modules (librays)</a></li>
<li><a href="#orgae1060b"><span class="todo TODO">TODO</span> Python Module</a></li>
<li><a href="#orge065c76">Import</a>
<ul>
<li>
<ul>
<li><a href="#org2292345">Introduction</a></li>
<li><a href="#orgd3653eb">Import your own obj and functions</a></li>
<li><a href="#org7fb31be">from Import</a></li>
<li><a href="#org492e6f8">Executing module as script</a></li>
<li><a href="#orgcbf0aa0">Loading Module</a></li>
<li><a href="#orgd5a0baf">Reload() a module</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org4adfac7">Package</a>
<ul>
<li><a href="#org5aaccaa">Create a package</a></li>
<li><a href="#org9cf7da8">Import package from parent directory</a>
<ul>
<li><a href="#orgd585a3d">using sys.path.append method</a></li>
<li><a href="#org5412e98">os.path.abspath method</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orga8be175">Exceptions Handling</a>
<ul>
<li>
<ul>
<li><a href="#org3a5dfb4">What is Exception</a></li>
<li><a href="#org8a4818e">How to handle Exception ?</a></li>
<li><a href="#org504b6d6">Try -except with multiple expressions</a></li>
<li><a href="#org5a27f0b">Finally</a></li>
<li><a href="#org3146445">Example for Using Finial inside Exception</a></li>
<li><a href="#org4e3b899">Argument of Exception</a></li>
<li><a href="#org467c4be">Raising an Exception</a></li>
<li><a href="#orgec853a4">Standard Exception</a></li>
<li><a href="#orgafa81d1">User Defined Exception</a></li>
<li><a href="#orgea5969c">Assertion Error</a></li>
<li><a href="#org46f9213">Print Exception</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org6ee8e29">DuckTyping</a>
<ul>
<li><a href="#org3d07a5d">Example2</a></li>
<li><a href="#org3b13b53">Why we use EAFP</a></li>
</ul>
</li>
<li><a href="#org572ca28">Nametuple</a></li>
<li><a href="#org7222158"><span class="todo TODO">TODO</span> Map, Filter &amp; Reduce</a></li>
<li><a href="#orgb6e83c1">OOP [Objective Oriented Programming]</a>
<ul>
<li>
<ul>
<li><a href="#org2bab79f">Introductions</a></li>
<li><a href="#org70b1133">Creating Class</a></li>
<li><a href="#org27a2156">Creating Object</a></li>
<li><a href="#orgc0fa4ad">Example:</a></li>
<li><a href="#org371e209">Accessing Attributes</a></li>
<li><a href="#org4e143ef">Build-in-Function for operating of class memb(attribute)</a></li>
<li><a href="#org5ec72da">Build-in-Class Attributes:(attri for class as whole than indivudual obj)</a></li>
<li><a href="#orge8fb9f7">Example:</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org70173f0"><span class="todo TODO">TODO</span> Dunder Methods</a></li>
<li><a href="#orgfe44e1e">Inheritance</a>
<ul>
<li><a href="#orgc886290">Example</a></li>
</ul>
</li>
<li><a href="#orgc9f63ae">Overloading Vs Overriding</a>
<ul>
<li>
<ul>
<li><a href="#org1f0c2bd">Base Overiding methods</a></li>
</ul>
</li>
<li><a href="#orga602cef">Operator Overloding</a>
<ul>
<li><a href="#org0eea90d">Example</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orge57385b">Data Hiding (Data Encapulatoin)</a>
<ul>
<li><a href="#org91c84dd">Example:</a></li>
</ul>
</li>
<li><a href="#org59b5f16"><span class="todo TODO">TODO</span> Decorateors [034,035_Decorators: Dynamics]</a>
<ul>
<li><a href="#org5c64492">1st class Functions</a></li>
<li><a href="#org9b9f8d3">Decoreators</a></li>
</ul>
</li>
<li><a href="#orga3eec31">In Class Property Decorator</a></li>
<li><a href="#org59a243a">Logging</a>
<ul>
<li><a href="#org6dab778"><span class="todo TODO">TODO</span> Advance Logging</a></li>
</ul>
</li>
<li><a href="#org289a2a7"><span class="todo TODO">TODO</span> iterators and Generators [033_Generator: Coreymschafer]</a></li>
<li><a href="#org6b18dce">Garbage Collector</a></li>
<li><a href="#org85ea46d">Python API Development - Comprehensive Course for Beginners</a></li>
<li><a href="#orgd769531">--------&#x2013;&#x2014; other sources----------</a></li>
<li><a href="#orgf66d81e">Developer</a></li>
<li><a href="#orgdc375d3">Python interviews</a>
<ul>
<li><a href="#orgb7233a1">begininners</a></li>
<li><a href="#org789f926"><span class="todo TODO">TODO</span> yield</a></li>
</ul>
</li>
<li><a href="#org2d12cc6">GENERAL interview</a></li>
<li><a href="#orgfd87c27">Online Learning Resoures:</a></li>
<li><a href="#orge5042ed">Question</a>
<ul>
<li><a href="#orged2471f">assigment in python</a></li>
<li><a href="#org660a0e2">assignment in list(immutable)</a></li>
</ul>
</li>
</ul>
</div>
</div>
<p>
g#+TITLE: Python
</p>
<p>
[  <a href="./index.html">Home</a> ]  \(&ensp;\)  | \(&ensp;\) \(&ensp;\) [text] \(&ensp;\)  \(&ensp;\) | \(&ensp;\) \(&ensp;\) [link] \(&ensp;\) \(&ensp;\) | \(&ensp;\) \(&ensp;\) [title] \(&ensp;\) \(&ensp;\) | \(&ensp;\) \(&ensp;\) [icon] \(&ensp;\) \(&ensp;\) | \(&ensp;\) \(&ensp;\) [target]  \(&ensp;\) \(&ensp;\) | \(&ensp;\) \(&ensp;\) [expanded]  \(&ensp;\) \(&ensp;\)
</p>
<hr />
<div id="outline-container-org48d12d8" class="outline-2">
<h2 id="org48d12d8">Python Introudctio</h2>
<div class="outline-text-2" id="text-org48d12d8">
</div>
<div id="outline-container-org81767ce" class="outline-3">
<h3 id="org81767ce">History:</h3>
<div class="outline-text-3" id="text-org81767ce">
<p>
Created by Guido Rossum in 1980 is very easy to learn
Python is 
interpreted logic ,
object-oriented, 
high-level programming language 
</p>
</div>
</div>
<div id="outline-container-org7cb2a8b" class="outline-3">
<h3 id="org7cb2a8b">Who uses python</h3>
<div class="outline-text-3" id="text-org7cb2a8b">
<p>
youtubbe,dropbox,raspberry netfilx,nsa,nasa,bittorrent
</p>
</div>
</div>
<div id="outline-container-org5334a9d" class="outline-3">
<h3 id="org5334a9d">Features :</h3>
<div class="outline-text-3" id="text-org5334a9d">
<ul class="org-ul">
<li>Simple and Easy to learn</li>
<li>High Level Language</li>
<li>Portable: windows,linux,ios</li>
<li>Support differetn Programming Paradigm (procedure-oriented / object-oriented)</li>
<li>Extensible</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org221d70c" class="outline-2">
<h2 id="org221d70c"><span class="todo TODO">TODO</span> Installation</h2>
<div class="outline-text-2" id="text-org221d70c">
</div>
<div id="outline-container-orgdfda937" class="outline-3">
<h3 id="orgdfda937"><span class="todo TODO">TODO</span> Install in Window and Linux</h3>
</div>

<div id="outline-container-org3ad569f" class="outline-3">
<h3 id="org3ad569f"><span class="todo TODO">TODO</span> Python Library Package Manager &lt;pip&gt; and &lt;conda&gt;</h3>
<div class="outline-text-3" id="text-org3ad569f">
</div>
