python.org
*** Install/Upgrade/Uninstall  package using pip
#+begin_src sh
# pip package manger for py 
# pip2 is use for py2
# pip3 is use for py3
#+end_src


#+BEGIN_SRC sh
pip install package_name    # install package by pip
python -m pip install novas # install package using python
pip list                    # list of package installed
pip uninstall <package_name>  # remove package by pip
pip install –upgrade pip    # Update Pip
pip install <package_name> –upgrade  # Upgade old package to latest version

pip install -r requirements.txt –upgrade  # Upgrade more than one package with a requirement file

pip freeze > requirements.txt  # save the local environment in text file <requirement.txt>
pip show <package_name>      # Show info about installed package

pip freeze > requirements.txt && pip uninstall -e requirements.txt -y # Remove All Packages Installed By Pip
pip check                   #  Verify That Installed Packages Have Compatible Dependencies

# Create ENV
python -m venv <venv-name>   # this will create dir <venv-name>
# To activate environment
source activate my_project_env/bin/activate      # To activate
deactive                                         # To deactivate 
#+END_SRC


** Conda
conda cmd : https://conda.io/projects/conda/en/latest/commands/index.html
#+BEGIN_SRC python
conda clean   # Remove unused packages and caches. https://docs.conda.io/projects/conda/en/4.6.0/commands/clean.html
conda install <package-name>  # install package
conda install --channel conda-forge boltons   # install package `boltons` from `conda-forge` channel
conda install pip
pip install boltons                           # install pip and with pip install packages
conda list                    # list of package in        
conda remove <package-name>  # uninstall or remove package

# ENV 
conda env list   # list of virtual `environment`  
conda create --name <venv_name> <py modules>  # create env with <venv_name> and install package py modules
# Note: when create env with out specifiying python version then it will randomly select a python version which will cause issuse
        # It is good practice to specify the python version each time you use
conda create -n myenv python=3.12

conda activate <venv_name>

conda env export > environment.yml # save and export env

# Import env from yaml file  https://stackoverflow.com/questions/42352841/how-to-update-an-existing-conda-environment-with-a-yml-file
conda activate myenv
conda env update --file local.yml --prune
conda env update --name myenv --file local.yml --prune
conda remove --name opencv-env --all
conda env create -f enironment.yaml
#+END_SRC

** TODO Virtural Environment
Consider math with is global module install in python 

If install new package math3.0 then it will mess up old project using math 2.0

What Virtural Environment does it will make a
It will allow us to install all our dependencies in local folder(own hub) not effect gobal module (os)

#+BEGIN_SRC sh
# installing virtualen
sudo pip install virtualev

# creating a virtual environment
virtualev projectName

# activate the virtual environement
cd projectName
source /source/bin/activate

# which python  we are running (where is the source file of python)
which pip

# installing package beautifuls
pip list 
pip install beautifulsoup pytz
pip install numpy panda

# unactivate 
deactivate  

#pip to install all of the packages in this file using the -r flag:
pip install -r requirements.txt

# virtual env for  with python version 2.6
virtualenv  -p /usr/bin/python2.6 py26_env
source/bin/activate
which python


#+END_SRC


Consider you are using math 2.0  module in one project and 
later on  new features are added in math 3.0 which need in new projects
** TODO Requirement file
#+begin_src sh
# cat requirement.txt  
blinker==1.7.0
click==8.1.7
Flask==3.0.0
importlib-metadata==6.8.0
itsdangerous==2.1.2
Jinja2==3.1.2
MarkupSafe==2.1.3
Werkzeug==3.0.1
zipp==3.17.0
gunicorn==20.0.4
#+end_src

