python.html
<div id="outline-container-org3c6e878" class="outline-4">
<h4 id="org3c6e878">Install/Upgrade/Uninstall  package using pip</h4>
<div class="outline-text-4" id="text-org3c6e878">
<div class="org-src-container">
<pre class="src src-sh"><span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">pip package manger for py </span>
<span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">pip2 is use for py2</span>
<span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">pip3 is use for py3</span>
</pre>
</div>


<div class="org-src-container">
<pre class="src src-sh">pip install package_name    <span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">install package by pip</span>
python -m pip install novas <span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">install package using python</span>
pip list                    <span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">list of package installed</span>
pip uninstall &lt;package_name&gt;  <span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">remove package by pip</span>
pip install &#8211;upgrade pip    <span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">Update Pip</span>
pip install &lt;package_name&gt; &#8211;upgrade  <span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">Upgade old package to latest version</span>

pip install -r requirements.txt &#8211;upgrade  <span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">Upgrade more than one package with a requirement file</span>

pip freeze &gt; requirements.txt  <span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">save the local environment in text file &lt;requirement.txt&gt;</span>
pip show &lt;package_name&gt;      <span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">Show info about installed package</span>

pip freeze &gt; requirements.txt &amp;&amp; pip uninstall -e requirements.txt -y <span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">Remove All Packages Installed By Pip</span>
pip check                   <span style="color: #2aa1ae; background-color: #ecf3ec;">#  </span><span style="color: #2aa1ae; background-color: #ecf3ec;">Verify That Installed Packages Have Compatible Dependencies</span>

<span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">Create ENV</span>
python -m venv &lt;venv-name&gt;   <span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">this will create dir &lt;venv-name&gt;</span>
<span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">To activate environment</span>
<span style="color: #3a81c3;">source</span> activate my_project_env/bin/activate      <span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">To activate</span>
deactive                                         <span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">To deactivate </span>
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-org2ab5b8b" class="outline-3">
<h3 id="org2ab5b8b">Conda</h3>
<div class="outline-text-3" id="text-org2ab5b8b">
<p>
conda cmd : <a href="https://conda.io/projects/conda/en/latest/commands/index.html">https://conda.io/projects/conda/en/latest/commands/index.html</a>
</p>
<div class="org-src-container">
<pre class="src src-python">conda clean   <span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">Remove unused packages and caches. https://docs.conda.io/projects/conda/en/4.6.0/commands/clean.html</span>
conda install &lt;package-name&gt;  <span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">install package</span>
conda install --channel conda-forge boltons   <span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">install package `boltons` from `conda-forge` channel</span>
conda install pip
pip install boltons                           <span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">install pip and with pip install packages</span>
conda <span style="color: #3a81c3;">list</span>                    <span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">list of package in        </span>
conda remove &lt;package-name&gt;  <span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">uninstall or remove package</span>

<span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">ENV </span>
conda env <span style="color: #3a81c3;">list</span>   <span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">list of virtual `environment`  </span>
conda create --name &lt;venv_name&gt; &lt;py modules&gt;  <span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">create env with &lt;venv_name&gt; and install package py modules</span>
<span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">Note: when create env with out specifiying python version then it will randomly select a python version which will cause issuse</span>
        <span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">It is good practice to specify the python version each time you use</span>
conda create -n myenv <span style="color: #715ab1;">python</span>=3.12

conda activate &lt;venv_name&gt;

conda env export &gt; environment.yml <span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">save and export env</span>

<span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">Import env from yaml file  https://stackoverflow.com/questions/42352841/how-to-update-an-existing-conda-environment-with-a-yml-file</span>
conda activate myenv
conda env update --<span style="color: #3a81c3;">file</span> local.yml --prune
conda env update --name myenv --<span style="color: #3a81c3;">file</span> local.yml --prune
conda remove --name opencv-env --<span style="color: #3a81c3;">all</span>
conda env create -f enironment.yaml
</pre>
</div>
</div>
</div>
<div id="outline-container-org3f779e0" class="outline-3">
<h3 id="org3f779e0"><span class="todo TODO">TODO</span> Virtural Environment</h3>
<div class="outline-text-3" id="text-org3f779e0">
<p>
Consider math with is global module install in python 
</p>

<p>
If install new package math3.0 then it will mess up old project using math 2.0
</p>

<p>
What Virtural Environment does it will make a
It will allow us to install all our dependencies in local folder(own hub) not effect gobal module (os)
</p>

<div class="org-src-container">
<pre class="src src-sh"><span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">installing virtualen</span>
sudo pip install virtualev

<span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">creating a virtual environment</span>
virtualev projectName

<span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">activate the virtual environement</span>
<span style="color: #3a81c3;">cd</span> projectName
<span style="color: #3a81c3;">source</span> /source/bin/activate

<span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">which python  we are running (where is the source file of python)</span>
which pip

<span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">installing package beautifuls</span>
pip list 
pip install beautifulsoup pytz
pip install numpy panda

<span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">unactivate </span>
deactivate  

<span style="color: #2aa1ae; background-color: #ecf3ec;">#</span><span style="color: #2aa1ae; background-color: #ecf3ec;">pip to install all of the packages in this file using the -r flag:</span>
pip install -r requirements.txt

<span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">virtual env for  with python version 2.6</span>
virtualenv  -p /usr/bin/python2.6 py26_env
source/bin/activate
which python


</pre>
</div>


<p>
Consider you are using math 2.0  module in one project and 
later on  new features are added in math 3.0 which need in new projects
</p>
</div>
</div>
<div id="outline-container-orgc2b08e8" class="outline-3">
<h3 id="orgc2b08e8"><span class="todo TODO">TODO</span> Requirement file</h3>
<div class="outline-text-3" id="text-orgc2b08e8">
<div class="org-src-container">
<pre class="src src-sh"><span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">cat requirement.txt  </span>
<span style="color: #715ab1;">blinker</span>==1.7.0
<span style="color: #715ab1;">click</span>==8.1.7
<span style="color: #715ab1;">Flask</span>==3.0.0
importlib-metadata==6.8.0
<span style="color: #715ab1;">itsdangerous</span>==2.1.2
<span style="color: #715ab1;">Jinja2</span>==3.1.2
<span style="color: #715ab1;">MarkupSafe</span>==2.1.3
<span style="color: #715ab1;">Werkzeug</span>==3.0.1
<span style="color: #715ab1;">zipp</span>==3.17.0
<span style="color: #715ab1;">gunicorn</span>==20.0.4
</pre>
</div>
</div>
</div>
