python.org
** Conda virtual env
#+BEGIN_SRC sh
python
conda env list
conda create --name <virtual_env_name> <py modules>
# To activate environment
source activate my_project_env
source deactive my_project_env
conda remove --name opencv-env --all
conda env create -f enironment.yaml

# EX:
conda create --name my_app python 2.7 flask sqlalchemy
activate my_app
pip list
which python
activate   # source activate 
decativate # source deactivate


conda env list

conda remove --name my_app

# CONDA Virtual Enviroment set :  ENVIROMENT VARIBLE for different project


#+END_SRC
** conda environment.yml 
#+begin_src yaml
name: myenv
channels:
  - conda-forge
  - defaults
dependencies:
  - _libgcc_mutex=0.1
  - _openmp_mutex=5.1
  - pip=23.2.1
  - python=3.11.5
  - sqlalchemy=1.4.39
  - sqlite=3.41.2
  - pip:
      - jupyterlab==4.0.6
      - terminado==0.17.1
      - tinycss2==1.2.1
      - tornado==6.3.3
      - traitlets==5.10.0
      - uri-template==1.3.0
prefix: ~/anaconda3/envs/myenv
#+end_src
* Python Editors
- Terminal
- vim, nvim, emcas
- jupyter notebook/lab  
- vscode** (Most Popular)
- pychram*      
** Jupyter
#+begin_src sh
! pip list # to run shell cmd also know as line magics

%lsmagiic   # line magic

%pwd

%ls -la

%matplotlib inline

%%HTML
You can be add youtube videos to your jupyter notebook


%%SVG

%%timeit
time for execute block


#+end_src
* Variables
** Definition
A variable in programming is a named storage location in a computer’s memory that holds a value, which can be modified during the execution of a program.

*Key Points* : 
- *Name:* Every variable has a name (also called an identifier).
- *Type:* It has a data type (like int, string, float, etc.) that determines the kind of value it can store.\\
  Also Know as =DataTypes=
- *Value:* It holds some data (like a number, text, or boolean).
- *Memory:* It occupies space in memory to store the value.
- *Changeable:* The value stored in a variable can be changed during program execution.

*Example*
#+BEGIN_SRC python
# Variable declaration and assignment
name = "Karthik"   # 'name' is a variable storing a string
age = 25           # 'age' is a variable storing an integer
#+END_SRC

*Important Terms*
| Term            | Description                                        |
|-----------------+----------------------------------------------------|
| Declaration     | Telling the program that a variable exists         |
| Initialization  | Assigning an initial value to the variable         |
| Scope           | The part of the program where the variable is accessible |
| Lifetime        | How long the variable exists in memory             |

** Python Variable Naming Convention

1. Syntax Rules (Must Follow)   
   - Variable names must start with a *letter (a–z, A–Z)* or an *underscore (_)*.\\
     NOTE:  Variable names *cannot start with a number*.
   - The remaining characters can be *letters, numbers,* or *underscores*.
   - Python is *case-sensitive*: `age`, `Age`, and `AGE` are different variables.
   - Reserved words (like `if`, `while`, `class`, `def`) *cannot* be used as variable names.
2. PEP 8 Naming Conventions (Should Follow)
   - Use *lowercase letters* with *underscores* to separate words (=snake_case=).
     - Example: `user_name`, `total_amount`
     - Avoid using single-character names except for counters or temporary variables (like `i`, `j`).
   - Use *descriptive names* that reflect the variable's purpose.
     - ✅ Good: `student_score`
     - ❌ Bad: `x`, `temp`, `val` (unless context is clear)
3. Special Conventions
   - `_variable`: Suggests "internal use" or "private" variable by convention.
   - `__variable`: Name mangling for class-private variables (used in classes).
   - `__init__`: Double underscores at both ends are reserved for *special methods* (called "dunder methods").
   - `VARIABLE_NAME`: All-uppercase names are used for *constants*.

   *Note*: both `_variable` and `__variable` are explained in Encapulation  

** Examples
#+BEGIN_SRC python
user_name = "Karthik"
age = 25
_total = 100        # Valid, but meant for internal use
__id = 42           # Class-private (name mangling)
MAX_RETRIES = 5     # Constant
# 2user = "invalid"  # ❌ Invalid: cannot start with a number
# class = "Math"     # ❌ Invalid: 'class' is a reserved keyword
#+END_SRC
** CamelCase
Camel case (or camelCase) is a naming convention used in programming where words in a multi-word identifier are joined without spaces, and each word after the first begins with a capital letter. The first word typically starts with a lowercase letter.
#+begin_src python
myVariableName = 'India'
calculateTotalAmount = 1000.00
#+end_src
* Data types
