python.html
<div id="outline-container-org1513709" class="outline-3">
<h3 id="org1513709">Conda virtual env</h3>
<div class="outline-text-3" id="text-org1513709">
<div class="org-src-container">
<pre class="src src-sh">python
conda env list
conda create --name &lt;virtual_env_name&gt; &lt;py modules&gt;
<span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">To activate environment</span>
<span style="color: #3a81c3;">source</span> activate my_project_env
<span style="color: #3a81c3;">source</span> deactive my_project_env
conda remove --name opencv-env --all
conda env create -f enironment.yaml

<span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">EX:</span>
conda create --name my_app python 2.7 flask sqlalchemy
activate my_app
pip list
which python
activate   <span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">source activate </span>
decativate <span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">source deactivate</span>


conda env list

conda remove --name my_app

<span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">CONDA Virtual Enviroment set :  ENVIROMENT VARIBLE for different project</span>


</pre>
</div>
</div>
</div>
<div id="outline-container-orgbb59662" class="outline-3">
<h3 id="orgbb59662">conda environment.yml</h3>
<div class="outline-text-3" id="text-orgbb59662">
<div class="org-src-container">
<pre class="src src-yaml">name: myenv
channels:
  - conda-forge
  - defaults
dependencies:
  - _libgcc_mutex=0.1
  - _openmp_mutex=5.1
  - pip=23.2.1
  - python=3.11.5
  - sqlalchemy=1.4.39
  - sqlite=3.41.2
  - pip:
      - jupyterlab==4.0.6
      - terminado==0.17.1
      - tinycss2==1.2.1
      - tornado==6.3.3
      - traitlets==5.10.0
      - uri-template==1.3.0
prefix: ~/anaconda3/envs/myenv
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-org9a1d6a2" class="outline-2">
<h2 id="org9a1d6a2">Python Editors</h2>
<div class="outline-text-2" id="text-org9a1d6a2">
<ul class="org-ul">
<li>Terminal</li>
<li>vim, nvim, emcas</li>
<li>jupyter notebook/lab</li>
<li>vscode** (Most Popular)</li>
<li>pychram*</li>
</ul>
</div>
<div id="outline-container-orgae291d2" class="outline-3">
<h3 id="orgae291d2">Jupyter</h3>
<div class="outline-text-3" id="text-orgae291d2">
<div class="org-src-container">
<pre class="src src-sh"><span style="color: #4e3163;">!</span> pip list <span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">to run shell cmd also know as line magics</span>

%lsmagiic   <span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">line magic</span>

%pwd

%ls -la

%matplotlib inline

%%HTML
You can be add youtube videos to your jupyter notebook


%%SVG

%%timeit
<span style="color: #3a81c3; font-weight: bold;">time for</span> execute block


</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-org989b702" class="outline-2">
<h2 id="org989b702">Variables</h2>
<div class="outline-text-2" id="text-org989b702">
</div>
<div id="outline-container-org1e0a8e4" class="outline-3">
<h3 id="org1e0a8e4">Definition</h3>
<div class="outline-text-3" id="text-org1e0a8e4">
<p>
A variable in programming is a named storage location in a computer’s memory that holds a value, which can be modified during the execution of a program.
</p>

<p>
<b>Key Points</b> : 
</p>
<ul class="org-ul">
<li><b>Name:</b> Every variable has a name (also called an identifier).</li>
<li><b>Type:</b> It has a data type (like int, string, float, etc.) that determines the kind of value it can store.<br />
Also Know as <code>DataTypes</code></li>
<li><b>Value:</b> It holds some data (like a number, text, or boolean).</li>
<li><b>Memory:</b> It occupies space in memory to store the value.</li>
<li><b>Changeable:</b> The value stored in a variable can be changed during program execution.</li>
</ul>

<p>
<b>Example</b>
</p>
<div class="org-src-container">
<pre class="src src-python"><span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">Variable declaration and assignment</span>
<span style="color: #715ab1;">name</span> = <span style="color: #2d9574;">"Karthik"</span>   <span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">'name' is a variable storing a string</span>
<span style="color: #715ab1;">age</span> = 25           <span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">'age' is a variable storing an integer</span>
</pre>
</div>

<p>
<b>Important Terms</b>
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Term</th>
<th scope="col" class="org-left">Description</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">Declaration</td>
<td class="org-left">Telling the program that a variable exists</td>
</tr>

<tr>
<td class="org-left">Initialization</td>
<td class="org-left">Assigning an initial value to the variable</td>
</tr>

<tr>
<td class="org-left">Scope</td>
<td class="org-left">The part of the program where the variable is accessible</td>
</tr>

<tr>
<td class="org-left">Lifetime</td>
<td class="org-left">How long the variable exists in memory</td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-orgc315c07" class="outline-3">
<h3 id="orgc315c07">Python Variable Naming Convention</h3>
<div class="outline-text-3" id="text-orgc315c07">
<ol class="org-ol">
<li>Syntax Rules (Must Follow)   
<ul class="org-ul">
<li>Variable names must start with a <b>letter (a–z, A–Z)</b> or an <b>underscore (_)</b>.<br />
NOTE:  Variable names <b>cannot start with a number</b>.</li>
<li>The remaining characters can be <b>letters, numbers,</b> or <b>underscores</b>.</li>
<li>Python is <b>case-sensitive</b>: `age`, `Age`, and `AGE` are different variables.</li>
<li>Reserved words (like `if`, `while`, `class`, `def`) <b>cannot</b> be used as variable names.</li>
</ul></li>
<li>PEP 8 Naming Conventions (Should Follow)
<ul class="org-ul">
<li>Use <b>lowercase letters</b> with <b>underscores</b> to separate words (<code>snake_case</code>).
<ul class="org-ul">
<li>Example: `user_name`, `total_amount`</li>
<li>Avoid using single-character names except for counters or temporary variables (like `i`, `j`).</li>
</ul></li>
<li>Use <b>descriptive names</b> that reflect the variable's purpose.
<ul class="org-ul">
<li>✅ Good: `student_score`</li>
<li>❌ Bad: `x`, `temp`, `val` (unless context is clear)</li>
</ul></li>
</ul></li>
<li><p>
Special Conventions
</p>
<ul class="org-ul">
<li>`_variable`: Suggests "internal use" or "private" variable by convention.</li>
<li>`__variable`: Name mangling for class-private variables (used in classes).</li>
<li>`__init__`: Double underscores at both ends are reserved for <b>special methods</b> (called "dunder methods").</li>
<li>`VARIABLE_NAME`: All-uppercase names are used for <b>constants</b>.</li>
</ul>

<p>
<b>Note</b>: both `_variable` and `__variable` are explained in Encapulation  
</p></li>
</ol>
</div>
</div>
<div id="outline-container-org133c185" class="outline-3">
<h3 id="org133c185">Examples</h3>
<div class="outline-text-3" id="text-org133c185">
<div class="org-src-container">
<pre class="src src-python"><span style="color: #715ab1;">user_name</span> = <span style="color: #2d9574;">"Karthik"</span>
<span style="color: #715ab1;">age</span> = 25
<span style="color: #715ab1;">_total</span> = 100        <span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">Valid, but meant for internal use</span>
<span style="color: #715ab1;">__id</span> = 42           <span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">Class-private (name mangling)</span>
<span style="color: #715ab1;">MAX_RETRIES</span> = 5     <span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">Constant</span>
<span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">2user = "invalid"  # &#10060; Invalid: cannot start with a number</span>
<span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">class = "Math"     # &#10060; Invalid: 'class' is a reserved keyword</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org727f728" class="outline-3">
<h3 id="org727f728">CamelCase</h3>
<div class="outline-text-3" id="text-org727f728">
<p>
Camel case (or camelCase) is a naming convention used in programming where words in a multi-word identifier are joined without spaces, and each word after the first begins with a capital letter. The first word typically starts with a lowercase letter.
</p>
<div class="org-src-container">
<pre class="src src-python"><span style="color: #715ab1;">myVariableName</span> = <span style="color: #2d9574;">'India'</span>
<span style="color: #715ab1;">calculateTotalAmount</span> = 1000.00
</pre>
</div>
</div>
</div>
</div>
