python.org
** Intro
Data types :
- Immutalbe (Note : Can't changes the value')
  - None Type
  - Boolean Type  
  - Number 
             - Integers eg 1,4,5,
             - Float    eg 3.5,3.1246,
             - Complex  eg 3+2j, 4+5j
  - Strings
  - Tuples   : can't  modify
    #+BEGIN_SRC python
      tuple_1 = ('History', 'Math', 'Physics', 'CompSci')
      tuple_2 = tuple_1

      print(tuble_1)
      print(tuble_2)

      tuple_1[0] = 'Art'                    # Error because tubles are immutable
    #+END_SRC
- Mutalbe
 - List         : []
 - Dictonary    : 
 - Set: values  : UNORDERD and N0-DUBLICATESS
*** immutable vs mutable
#+BEGIN_SRC python
  list_1 = ['History', 'Math', 'Physics', 'CompSci']

  list_2 = list_1

  print(tuple_1)
  print(tuple_2)            #  >>> Both are same 


  list_1[0]= 'Art'

  print(list_1)
  print(list_2)            #  >>> Change and list_1 change in Change in list_2

  # Immutalbe means : both are same mutable obj


#+END_SRC
** Number
Different Number Type
*** Integers eg 1,4,5,
*** Float    eg 3.5,3.1246,
*** Complex  eg 3+2j, 4+5j
*** Operators in python:
**** 1) Arthimetic operator
  | +  | addition                       |
  | -  | substration                    |
  | *  | mulitplication                 |
  | /  | division(floating point value) |
  | // | quoficient (float value)       |
  | %  | remainder                      |
  | ** | power                          |
  |    |                                |

#+BEGIN_SRC python
############################
#   Arthimetic Operator
###########################
a= 12
b=3
a+b   	# >>> 15
+a-b   	# >>> 9
a*b   	# >>> 36
a**b  	# >>> (12)^3 =1728
a/b   	# >>> 4.0 floating point
a//b  	# >>> 4 int
a%b   	# >>> 0
a+b/3-4*12 	#>>> -35.0
# Order of exprssion
3 * 2 +1
3 *(2 +1)

# increment

num =1
num = num +1
# Or
num +=1
num *=10

print(abs(-3))
print(round(3.75))   #  4
print(round(3.75),1) # 3.8

num_1 =3
num_2 =2
print(num_1 <= num_2)

# Convert string to numbert

num_1 =  '100'
num_2 = '200'
print(num_1 + num_2)  # 100200
num_1 = int(num_1)
num_2 = int(num_2)


 
 #+END_SRC
**** 2) Assignment  operator :
  | =  | assignment   |
  | is | data binding |
  | += |              |
  | -= |              |
  | *= |              |
  | /= |              |
  |    |              |
**** 3) Comparison  operator  
  |    |                    |
  |----+--------------------|
  | >  | less               |
  | <  | greater            |
  | >= | greater than equal |
  | <= | less than equal    |
  | == | Equal              |
  | != | Not Equal          |
  |    |                    |
**** 4) Logical  operator
  Logiacl Operator wil give output TRUE OR FALSE

  | and |   |
  | or  |   |
  | not |   |
**** 6) Identity  operator:checks if var is equal 
  | is     |
  | is not |

#+BEGIN_SRC python
x=5
x is 5
x is not 5
 #+END_SRC
