python.html
<div id="outline-container-org99f6511" class="outline-2">
<h2 id="org99f6511">Data types</h2>
<div class="outline-text-2" id="text-org99f6511">
</div>
<div id="outline-container-org7532565" class="outline-3">
<h3 id="org7532565">Intro</h3>
<div class="outline-text-3" id="text-org7532565">
<p>
Data types :
</p>
<ul class="org-ul">
<li>Immutalbe (Note : Can't changes the value')
<ul class="org-ul">
<li>None Type</li>
<li>Boolean Type</li>
<li>Number 
<ul class="org-ul">
<li>Integers eg 1,4,5,</li>
<li>Float    eg 3.5,3.1246,</li>
<li>Complex  eg 3+2j, 4+5j</li>
</ul></li>
<li>Strings</li>
<li><p>
Tuples   : can't  modify
</p>
<div class="org-src-container">
<pre class="src src-python"><span style="color: #715ab1;">tuple_1</span> = <span style="color: #3a81c3;">(</span><span style="color: #2d9574;">'History'</span>, <span style="color: #2d9574;">'Math'</span>, <span style="color: #2d9574;">'Physics'</span>, <span style="color: #2d9574;">'CompSci'</span><span style="color: #3a81c3;">)</span>
<span style="color: #715ab1;">tuple_2</span> = tuple_1

<span style="color: #3a81c3;">print</span><span style="color: #3a81c3;">(</span>tuble_1<span style="color: #3a81c3;">)</span>
<span style="color: #3a81c3;">print</span><span style="color: #3a81c3;">(</span>tuble_2<span style="color: #3a81c3;">)</span>

<span style="color: #715ab1;">tuple_1</span><span style="color: #3a81c3;">[</span>0<span style="color: #3a81c3;">]</span> = <span style="color: #2d9574;">'Art'</span>                    <span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">Error because tubles are immutable</span>
</pre>
</div></li>
</ul></li>
<li>Mutalbe
<ul class="org-ul">
<li>List         : []</li>
<li>Dictonary    :</li>
<li>Set: values  : UNORDERD and N0-DUBLICATESS</li>
</ul></li>
</ul>
</div>
<div id="outline-container-orge454b9d" class="outline-4">
<h4 id="orge454b9d">immutable vs mutable</h4>
<div class="outline-text-4" id="text-orge454b9d">
<div class="org-src-container">
<pre class="src src-python"><span style="color: #715ab1;">list_1</span> = <span style="color: #3a81c3;">[</span><span style="color: #2d9574;">'History'</span>, <span style="color: #2d9574;">'Math'</span>, <span style="color: #2d9574;">'Physics'</span>, <span style="color: #2d9574;">'CompSci'</span><span style="color: #3a81c3;">]</span>

<span style="color: #715ab1;">list_2</span> = list_1

<span style="color: #3a81c3;">print</span><span style="color: #3a81c3;">(</span>tuple_1<span style="color: #3a81c3;">)</span>
<span style="color: #3a81c3;">print</span><span style="color: #3a81c3;">(</span>tuple_2<span style="color: #3a81c3;">)</span>            <span style="color: #2aa1ae; background-color: #ecf3ec;">#  </span><span style="color: #2aa1ae; background-color: #ecf3ec;">&gt;&gt;&gt; Both are same </span>


<span style="color: #715ab1;">list_1</span><span style="color: #3a81c3;">[</span>0<span style="color: #3a81c3;">]</span>= <span style="color: #2d9574;">'Art'</span>

<span style="color: #3a81c3;">print</span><span style="color: #3a81c3;">(</span>list_1<span style="color: #3a81c3;">)</span>
<span style="color: #3a81c3;">print</span><span style="color: #3a81c3;">(</span>list_2<span style="color: #3a81c3;">)</span>            <span style="color: #2aa1ae; background-color: #ecf3ec;">#  </span><span style="color: #2aa1ae; background-color: #ecf3ec;">&gt;&gt;&gt; Change and list_1 change in Change in list_2</span>

<span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">Immutalbe means : both are same mutable obj</span>


</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-org38169be" class="outline-3">
<h3 id="org38169be">Number</h3>
<div class="outline-text-3" id="text-org38169be">
<p>
Different Number Type
</p>
</div>
<div id="outline-container-org43f43c2" class="outline-4">
<h4 id="org43f43c2">Integers eg 1,4,5,</h4>
</div>
<div id="outline-container-org10fd5f0" class="outline-4">
<h4 id="org10fd5f0">Float    eg 3.5,3.1246,</h4>
</div>
<div id="outline-container-org3b331f1" class="outline-4">
<h4 id="org3b331f1">Complex  eg 3+2j, 4+5j</h4>
</div>
<div id="outline-container-org2d3fe60" class="outline-4">
<h4 id="org2d3fe60">Operators in python:</h4>
<div class="outline-text-4" id="text-org2d3fe60">
</div>
<ul class="org-ul">
<li><a id="orgfa217eb"></a>1) Arthimetic operator<br />
<div class="outline-text-5" id="text-orgfa217eb">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">+</td>
<td class="org-left">addition</td>
</tr>

<tr>
<td class="org-left">-</td>
<td class="org-left">substration</td>
</tr>

<tr>
<td class="org-left">*</td>
<td class="org-left">mulitplication</td>
</tr>

<tr>
<td class="org-left">//</td>
<td class="org-left">quoficient (float value)</td>
</tr>

<tr>
<td class="org-left">%</td>
<td class="org-left">remainder</td>
</tr>

<tr>
<td class="org-left">**</td>
<td class="org-left">power</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
</table>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #2aa1ae; background-color: #ecf3ec;">############################</span>
<span style="color: #2aa1ae; background-color: #ecf3ec;">#   </span><span style="color: #2aa1ae; background-color: #ecf3ec;">Arthimetic Operator</span>
<span style="color: #2aa1ae; background-color: #ecf3ec;">###########################</span>
<span style="color: #715ab1;">a</span>= 12
<span style="color: #715ab1;">b</span>=3
a+b     <span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">&gt;&gt;&gt; 15</span>
+a-b    <span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">&gt;&gt;&gt; 9</span>
a*b     <span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">&gt;&gt;&gt; 36</span>
a**b    <span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">&gt;&gt;&gt; (12)^3 =1728</span>
a/b     <span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">&gt;&gt;&gt; 4.0 floating point</span>
a//b    <span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">&gt;&gt;&gt; 4 int</span>
a%b     <span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">&gt;&gt;&gt; 0</span>
a+b/3-4*12      <span style="color: #2aa1ae; background-color: #ecf3ec;">#</span><span style="color: #2aa1ae; background-color: #ecf3ec;">&gt;&gt;&gt; -35.0</span>
<span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">Order of exprssion</span>
3 * 2 +1
3 *<span style="color: #3a81c3;">(</span>2 +1<span style="color: #3a81c3;">)</span>

<span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">increment</span>

<span style="color: #715ab1;">num</span> =1
<span style="color: #715ab1;">num</span> = num +1
<span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">Or</span>
<span style="color: #715ab1;">num</span> +=1
<span style="color: #715ab1;">num</span> *=10

<span style="color: #3a81c3;">print</span><span style="color: #3a81c3;">(</span><span style="color: #3a81c3;">abs</span><span style="color: #6c3163;">(</span>-3<span style="color: #6c3163;">)</span><span style="color: #3a81c3;">)</span>
<span style="color: #3a81c3;">print</span><span style="color: #3a81c3;">(</span><span style="color: #3a81c3;">round</span><span style="color: #6c3163;">(</span>3.75<span style="color: #6c3163;">)</span><span style="color: #3a81c3;">)</span>   <span style="color: #2aa1ae; background-color: #ecf3ec;">#  </span><span style="color: #2aa1ae; background-color: #ecf3ec;">4</span>
<span style="color: #3a81c3;">print</span><span style="color: #3a81c3;">(</span><span style="color: #3a81c3;">round</span><span style="color: #6c3163;">(</span>3.75<span style="color: #6c3163;">)</span>,1<span style="color: #3a81c3;">)</span> <span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">3.8</span>

<span style="color: #715ab1;">num_1</span> =3
<span style="color: #715ab1;">num_2</span> =2
<span style="color: #3a81c3;">print</span><span style="color: #3a81c3;">(</span>num_1 &lt;= num_2<span style="color: #3a81c3;">)</span>

<span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">Convert string to numbert</span>

<span style="color: #715ab1;">num_1</span> =  <span style="color: #2d9574;">'100'</span>
<span style="color: #715ab1;">num_2</span> = <span style="color: #2d9574;">'200'</span>
<span style="color: #3a81c3;">print</span><span style="color: #3a81c3;">(</span>num_1 + num_2<span style="color: #3a81c3;">)</span>  <span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">100200</span>
<span style="color: #715ab1;">num_1</span> = <span style="color: #3a81c3;">int</span><span style="color: #3a81c3;">(</span>num_1<span style="color: #3a81c3;">)</span>
<span style="color: #715ab1;">num_2</span> = <span style="color: #3a81c3;">int</span><span style="color: #3a81c3;">(</span>num_2<span style="color: #3a81c3;">)</span>



</pre>
</div>
</div>
</li>
<li><a id="org90f2729"></a>2) Assignment  operator :<br />
<div class="outline-text-5" id="text-org90f2729">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">=</td>
<td class="org-left">assignment</td>
</tr>

<tr>
<td class="org-left">is</td>
<td class="org-left">data binding</td>
</tr>

<tr>
<td class="org-left">+=</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">-=</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">*=</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">/=</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
</table>
</div>
</li>
<li><a id="org1924286"></a>3) Comparison  operator<br />
<div class="outline-text-5" id="text-org1924286">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">&#xa0;</th>
<th scope="col" class="org-left">&#xa0;</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">&gt;</td>
<td class="org-left">less</td>
</tr>

<tr>
<td class="org-left">&lt;</td>
<td class="org-left">greater</td>
</tr>

<tr>
<td class="org-left">&gt;=</td>
<td class="org-left">greater than equal</td>
</tr>

<tr>
<td class="org-left">&lt;=</td>
<td class="org-left">less than equal</td>
</tr>

<tr>
<td class="org-left">==</td>
<td class="org-left">Equal</td>
</tr>

<tr>
<td class="org-left">!=</td>
<td class="org-left">Not Equal</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
</table>
</div>
</li>
<li><a id="org1438ff5"></a>4) Logical  operator<br />
<div class="outline-text-5" id="text-org1438ff5">
<p>
Logiacl Operator wil give output TRUE OR FALSE
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">and</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">or</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">not</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
</table>
</div>
</li>
<li><a id="org1d92be8"></a>6) Identity  operator:checks if var is equal<br />
<div class="outline-text-5" id="text-org1d92be8">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">is</td>
</tr>

<tr>
<td class="org-left">is not</td>
</tr>
</tbody>
</table>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #715ab1;">x</span>=5
x <span style="color: #3a81c3; font-weight: bold;">is</span> 5
x <span style="color: #3a81c3; font-weight: bold;">is</span> <span style="color: #3a81c3; font-weight: bold;">not</span> 5
</pre>
</div>
</div>
</li>
