python.org
**** 5) Bitwise  operator
  | or         |    |
  | and        | &  |
  | xor        | ^  |
  | RIGHTSHIFT | >> |
  | Leftshift  | << |
  |            |    |
#+BEGIN_SRC python
 3>>2    # 011 rightshift by 2  000  >   0 
 3<<2    # 011 leftshift  by 2  110  > 12
10 & 11
#10
8 &11
# 8
8 |11
#11
8 ^ 11
#3
3& 11
#3

 #+END_SRC
**** 7) Membership  operator : checks if a element belongs to (set, list,tubles,string,dict)
 | in     |
 | not in |
#+BEGIN_SRC python
x= [1,2,3,4,5]
3 in x
#+END_SRC
** String
*** defination
    | define by quote |                |
    |-----------------+----------------|
    |                 | "sdfsdfdff"    |
    |                 | 'asdfsdf'      |
    |                 | """asdfd"""    |
    |                 | '''sdfasdfs''' |
    |                 |                |
*** Quotes 
#+BEGIN_SRC python
####################################################

# Text contain " (double quote) or '(single quote)

####################################################

print ("Using double quote")    # >>> Using double quote
print('Using single quote')     # >>> Using double quote

# To use " & ' in printing text we can use alternatively

print (" It's working ")        # >>> It's working
print ('He says " It is working "') # >>> He says "It is working"


# Using both " and ' in same statement

print('He says " It\'s is working "')       # >>> He says " It's is working"
print("He says \" It's is working \" ")     # >>> He says " It's is working"

# Or we can use triple quote

print("""He says " It's is working" """)     # >>> He says " It's is working"
print('''He says " It's is working" ''')     # >>> He says " It's is working"
#+END_SRC
*** Operations
    |-----------------+-----------------------|
    | Operations      |                       |
    |-----------------+-----------------------|
    | Concatenation   | str1+str2             |
    | Repetition      | str1*3                |
    | Slicing         | str1[2:7]             |
    | Indexing        | str1[-1]              |
