python.html
<li><a id="org6115a1c"></a>5) Bitwise  operator<br />
<div class="outline-text-5" id="text-org6115a1c">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">or</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">and</td>
<td class="org-left">&amp;</td>
</tr>

<tr>
<td class="org-left">xor</td>
<td class="org-left">^</td>
</tr>

<tr>
<td class="org-left">RIGHTSHIFT</td>
<td class="org-left">&gt;&gt;</td>
</tr>

<tr>
<td class="org-left">Leftshift</td>
<td class="org-left">&lt;&lt;</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
</table>
<div class="org-src-container">
<pre class="src src-python"> 3&gt;&gt;2    <span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">011 rightshift by 2  000  &gt;   0 </span>
 3&lt;&lt;2    <span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">011 leftshift  by 2  110  &gt; 12</span>
10 &amp; 11
<span style="color: #2aa1ae; background-color: #ecf3ec;">#</span><span style="color: #2aa1ae; background-color: #ecf3ec;">10</span>
8 &amp;11
<span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">8</span>
8 |11
<span style="color: #2aa1ae; background-color: #ecf3ec;">#</span><span style="color: #2aa1ae; background-color: #ecf3ec;">11</span>
8 ^ 11
<span style="color: #2aa1ae; background-color: #ecf3ec;">#</span><span style="color: #2aa1ae; background-color: #ecf3ec;">3</span>
3&amp; 11
<span style="color: #2aa1ae; background-color: #ecf3ec;">#</span><span style="color: #2aa1ae; background-color: #ecf3ec;">3</span>

</pre>
</div>
</div>
</li>
<li><a id="orga62dbcc"></a>7) Membership  operator : checks if a element belongs to (set, list,tubles,string,dict)<br />
<div class="outline-text-5" id="text-orga62dbcc">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">in</td>
</tr>

<tr>
<td class="org-left">not in</td>
</tr>
</tbody>
</table>
<div class="org-src-container">
<pre class="src src-python"><span style="color: #715ab1;">x</span>= <span style="color: #3a81c3;">[</span>1,2,3,4,5<span style="color: #3a81c3;">]</span>
3 <span style="color: #3a81c3; font-weight: bold;">in</span> x
</pre>
</div>
</div>
</li>
</ul>
</div>
</div>
<div id="outline-container-org70dd26e" class="outline-3">
<h3 id="org70dd26e">String</h3>
<div class="outline-text-3" id="text-org70dd26e">
</div>
<div id="outline-container-org6a9f93a" class="outline-4">
<h4 id="org6a9f93a">defination</h4>
<div class="outline-text-4" id="text-org6a9f93a">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">define by quote</th>
<th scope="col" class="org-left">&#xa0;</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">"sdfsdfdff"</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">'asdfsdf'</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">"""asdfd"""</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">'''sdfasdfs'''</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-org83929b6" class="outline-4">
<h4 id="org83929b6">Quotes</h4>
<div class="outline-text-4" id="text-org83929b6">
<div class="org-src-container">
<pre class="src src-python"><span style="color: #2aa1ae; background-color: #ecf3ec;">####################################################</span>

<span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">Text contain " (double quote) or '(single quote)</span>

<span style="color: #2aa1ae; background-color: #ecf3ec;">####################################################</span>

<span style="color: #3a81c3;">print</span> <span style="color: #3a81c3;">(</span><span style="color: #2d9574;">"Using double quote"</span><span style="color: #3a81c3;">)</span>    <span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">&gt;&gt;&gt; Using double quote</span>
<span style="color: #3a81c3;">print</span><span style="color: #3a81c3;">(</span><span style="color: #2d9574;">'Using single quote'</span><span style="color: #3a81c3;">)</span>     <span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">&gt;&gt;&gt; Using double quote</span>

<span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">To use " &amp; ' in printing text we can use alternatively</span>

<span style="color: #3a81c3;">print</span> <span style="color: #3a81c3;">(</span><span style="color: #2d9574;">" It's working "</span><span style="color: #3a81c3;">)</span>        <span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">&gt;&gt;&gt; It's working</span>
<span style="color: #3a81c3;">print</span> <span style="color: #3a81c3;">(</span><span style="color: #2d9574;">'He says " It is working "'</span><span style="color: #3a81c3;">)</span> <span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">&gt;&gt;&gt; He says "It is working"</span>


<span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">Using both " and ' in same statement</span>

<span style="color: #3a81c3;">print</span><span style="color: #3a81c3;">(</span><span style="color: #2d9574;">'He says " It</span><span style="color: #4e3163;">\'</span><span style="color: #2d9574;">s is working "'</span><span style="color: #3a81c3;">)</span>       <span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">&gt;&gt;&gt; He says " It's is working"</span>
<span style="color: #3a81c3;">print</span><span style="color: #3a81c3;">(</span><span style="color: #2d9574;">"He says \" It's is working \" "</span><span style="color: #3a81c3;">)</span>     <span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">&gt;&gt;&gt; He says " It's is working"</span>

<span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">Or we can use triple quote</span>

<span style="color: #3a81c3;">print</span><span style="color: #3a81c3;">(</span><span style="color: #2d9574;">"""He says " It's is working" """</span><span style="color: #3a81c3;">)</span>     <span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">&gt;&gt;&gt; He says " It's is working"</span>
<span style="color: #3a81c3;">print</span><span style="color: #3a81c3;">(</span><span style="color: #2d9574;">'''He says " It's is working" '''</span><span style="color: #3a81c3;">)</span>     <span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">&gt;&gt;&gt; He says " It's is working"</span>
</pre>
</div>
</div>
</div>
