python.org
*** Method
    |-----------------------+----------------------------------------------------+------------------------------------|
    | Method                | str1 = Edureka                                     | Result                             |
    |-----------------------+----------------------------------------------------+------------------------------------|
    | find                  | str1.find('ureka')                                 | 2                                  |
    | repalce               | str1.repalce("Ed","E")                             | 'Eureka'                           |
    | count                 | str1.count('e',beg=0,end=6)                        | 2                                  |
    |-----------------------+----------------------------------------------------+------------------------------------|
    | upper Case            | str1.upper()                                       | "EDUREKA                           |
    | lower Case            | str1.lower()                                       | "edureka"                          |
    | Capital               | "hELLO woRld".capitalize()                         | Hello world                        |
    | Captialize            | 'hELLO woRld'.title()                              | 'Hello World'                      |
    |-----------------------+----------------------------------------------------+------------------------------------|
    | len                   | str1.len()                                         | 7                                  |
    | max                   | str1.max()                                         | u             (higher alpha order) |
    | min                   | str1.min()                                         | a                                  |
    |-----------------------+----------------------------------------------------+------------------------------------|
    | lstrip                | ' hello users: '.lstrip()                          | 'hello users: '                    |
    | rstrip                | ' hello users: '.rstrip()                          | ' hello users:'                    |
    | strip                 | ' hello users: '.strip()                           | "hello users:"                     |
    |-----------------------+----------------------------------------------------+------------------------------------|
    | center aline(justify) | 'hello user'.center(15,'*')                        | **Hello users**                    |
    | left aline            | 'hello user'.ljust(15,'*')                         | Hello users****                    |
    | right aline(justify)  | 'hello user'.right(15,'*')                         | ****Hello users                    |
    |-----------------------+----------------------------------------------------+------------------------------------|
    | split(str2list)       | l1 =  str1.split('.')                              | l1 = ["E","d","u","r","e","k","a"] |
    | join(list)            | ','.join(l1)                                       | 'E,d,u,r,e,k,a'                    |
    |                       | '-'.join(l1)                                       | 'E-d-u-r-e-k-a'                    |
    |-----------------------+----------------------------------------------------+------------------------------------|
    | isalpha()             | str1.isaplha()                                     | True                               |
    | isalnum()             | if atleast 1char is num and 1char in alpha         | True                               |
    | isalpha()             | if all char are alpha not dig,space,special symbol | True                               |
    | isdigit()             | if all char are dig                                | True                               |
    | islower()             | if char are lower                                  | True                               |
    | isupper()             | if char are upper                                  | True                               |
    | isnumeric()           |                                                    | True                               |
    | isspace()             |                                                    |                                    |
    | istitle()             |                                                    |                                    |
    |                       |                                                    |                                    |
*** String Encoding Function:
There are two functions decode(),encode() functions to include this functions we need to =base64 module= which has all function required for converting raw binary data to str vic versa
**** defination
#+BEGIN_SRC python
decode(encoding='UTF-8',errors='strict')
encode(encoding='UTF-8',errors='strict')
#+END_SRC

**** Eg
#+BEGIN_SRC python
import base64
str = 'This is string example'
str = base64.b64(Str.encode('utf-8'))
print("Ecoded String:",stre)                    # it is a binary formate
str = base64.b64(Str).decode('utf-8')
print("Decode String: ",strd)
#+END_SRC
*** String Formating
**** TODO Place Holder(f string or Replace files)
**** Replacement Field(Place Holders)
***** String
Formating Vs Replacement Field(Paleholders{})
#+BEGIN_SRC python
person = {'name': 'Jenn', 'age':23}

sentence = 'My name is '+person['name'] + 'and I am '+str(person['age'])+ 'year old.'
print(sentence)                               # above is NOT READABLE, EASY WRITABLE

# # Using Placeholder
sentence = 'My name is {} and I am {} year old.'.format(person ['name'], person['age'])
print(sentence)
#+END_SRC
