python.html
<div id="outline-container-org02bbb19" class="outline-4">
<h4 id="org02bbb19">Operations</h4>
<div class="outline-text-4" id="text-org02bbb19">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Operations</th>
<th scope="col" class="org-left">&#xa0;</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">Concatenation</td>
<td class="org-left">str1+str2</td>
</tr>

<tr>
<td class="org-left">Repetition</td>
<td class="org-left">str1*3</td>
</tr>

<tr>
<td class="org-left">Slicing</td>
<td class="org-left">str1[2:7]</td>
</tr>

<tr>
<td class="org-left">Indexing</td>
<td class="org-left">str1[-1]</td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-org8c46389" class="outline-4">
<h4 id="org8c46389">Method</h4>
<div class="outline-text-4" id="text-org8c46389">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Method</th>
<th scope="col" class="org-left">str1 = Edureka</th>
<th scope="col" class="org-left">Result</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">find</td>
<td class="org-left">str1.find('ureka')</td>
<td class="org-left">2</td>
</tr>

<tr>
<td class="org-left">repalce</td>
<td class="org-left">str1.repalce("Ed","E")</td>
<td class="org-left">'Eureka'</td>
</tr>

<tr>
<td class="org-left">count</td>
<td class="org-left">str1.count('e',beg=0,end=6)</td>
<td class="org-left">2</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">upper Case</td>
<td class="org-left">str1.upper()</td>
<td class="org-left">"EDUREKA</td>
</tr>

<tr>
<td class="org-left">lower Case</td>
<td class="org-left">str1.lower()</td>
<td class="org-left">"edureka"</td>
</tr>

<tr>
<td class="org-left">Capital</td>
<td class="org-left">"hELLO woRld".capitalize()</td>
<td class="org-left">Hello world</td>
</tr>

<tr>
<td class="org-left">Captialize</td>
<td class="org-left">'hELLO woRld'.title()</td>
<td class="org-left">'Hello World'</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">len</td>
<td class="org-left">str1.len()</td>
<td class="org-left">7</td>
</tr>

<tr>
<td class="org-left">max</td>
<td class="org-left">str1.max()</td>
<td class="org-left">u             (higher alpha order)</td>
</tr>

<tr>
<td class="org-left">min</td>
<td class="org-left">str1.min()</td>
<td class="org-left">a</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">lstrip</td>
<td class="org-left">' hello users: '.lstrip()</td>
<td class="org-left">'hello users: '</td>
</tr>

<tr>
<td class="org-left">rstrip</td>
<td class="org-left">' hello users: '.rstrip()</td>
<td class="org-left">' hello users:'</td>
</tr>

<tr>
<td class="org-left">strip</td>
<td class="org-left">' hello users: '.strip()</td>
<td class="org-left">"hello users:"</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">center aline(justify)</td>
<td class="org-left">'hello user'.center(15,'*')</td>
<td class="org-left"><b><b>Hello users</b></b></td>
</tr>

<tr>
<td class="org-left">left aline</td>
<td class="org-left">'hello user'.ljust(15,'*')</td>
<td class="org-left">Hello users****</td>
</tr>

<tr>
<td class="org-left">right aline(justify)</td>
<td class="org-left">'hello user'.right(15,'*')</td>
<td class="org-left">****Hello users</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">split(str2list)</td>
<td class="org-left">l1 =  str1.split('.')</td>
<td class="org-left">l1 = ["E","d","u","r","e","k","a"]</td>
</tr>

<tr>
<td class="org-left">join(list)</td>
<td class="org-left">','.join(l1)</td>
<td class="org-left">'E,d,u,r,e,k,a'</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">'-'.join(l1)</td>
<td class="org-left">'E-d-u-r-e-k-a'</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">isalpha()</td>
<td class="org-left">str1.isaplha()</td>
<td class="org-left">True</td>
</tr>

<tr>
<td class="org-left">isalnum()</td>
<td class="org-left">if atleast 1char is num and 1char in alpha</td>
<td class="org-left">True</td>
</tr>

<tr>
<td class="org-left">isalpha()</td>
<td class="org-left">if all char are alpha not dig,space,special symbol</td>
<td class="org-left">True</td>
</tr>

<tr>
<td class="org-left">isdigit()</td>
<td class="org-left">if all char are dig</td>
<td class="org-left">True</td>
</tr>

<tr>
<td class="org-left">islower()</td>
<td class="org-left">if char are lower</td>
<td class="org-left">True</td>
</tr>

<tr>
<td class="org-left">isupper()</td>
<td class="org-left">if char are upper</td>
<td class="org-left">True</td>
</tr>

<tr>
<td class="org-left">isnumeric()</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">True</td>
</tr>

<tr>
<td class="org-left">isspace()</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">istitle()</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-org1172b9e" class="outline-4">
<h4 id="org1172b9e">String Encoding Function:</h4>
<div class="outline-text-4" id="text-org1172b9e">
<p>
There are two functions decode(),encode() functions to include this functions we need to <code>base64 module</code> which has all function required for converting raw binary data to str vic versa
</p>
</div>
<ul class="org-ul">
<li><a id="org498fa9a"></a>defination<br />
<div class="outline-text-5" id="text-org498fa9a">
<div class="org-src-container">
<pre class="src src-python">decode<span style="color: #3a81c3;">(</span>encoding=<span style="color: #2d9574;">'UTF-8'</span>,errors=<span style="color: #2d9574;">'strict'</span><span style="color: #3a81c3;">)</span>
encode<span style="color: #3a81c3;">(</span>encoding=<span style="color: #2d9574;">'UTF-8'</span>,errors=<span style="color: #2d9574;">'strict'</span><span style="color: #3a81c3;">)</span>
</pre>
</div>
</div>
</li>
<li><a id="orgdc52562"></a>Eg<br />
<div class="outline-text-5" id="text-orgdc52562">
<div class="org-src-container">
<pre class="src src-python"><span style="color: #3a81c3; font-weight: bold;">import</span> base64
<span style="color: #3a81c3;">str</span> = <span style="color: #2d9574;">'This is string example'</span>
<span style="color: #3a81c3;">str</span> = base64.b64<span style="color: #3a81c3;">(</span>Str.encode<span style="color: #6c3163;">(</span><span style="color: #2d9574;">'utf-8'</span><span style="color: #6c3163;">)</span><span style="color: #3a81c3;">)</span>
<span style="color: #3a81c3;">print</span><span style="color: #3a81c3;">(</span><span style="color: #2d9574;">"Ecoded String:"</span>,stre<span style="color: #3a81c3;">)</span>                    <span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">it is a binary formate</span>
<span style="color: #3a81c3;">str</span> = base64.b64<span style="color: #3a81c3;">(</span>Str<span style="color: #3a81c3;">)</span>.decode<span style="color: #3a81c3;">(</span><span style="color: #2d9574;">'utf-8'</span><span style="color: #3a81c3;">)</span>
<span style="color: #3a81c3;">print</span><span style="color: #3a81c3;">(</span><span style="color: #2d9574;">"Decode String: "</span>,strd<span style="color: #3a81c3;">)</span>
</pre>
</div>
</div>
</li>
</ul>
</div>
<div id="outline-container-org0862462" class="outline-4">
<h4 id="org0862462">String Formating</h4>
<div class="outline-text-4" id="text-org0862462">
</div>
<ul class="org-ul">
<li><a id="org31472a8"></a><span class="todo TODO">TODO</span> Place Holder(f string or Replace files)<br /></li>
<li><a id="orgdf5004f"></a>Replacement Field(Place Holders)<br />
<ul class="org-ul">
<li><a id="orgaea3a2e"></a>String<br />
<div class="outline-text-6" id="text-orgaea3a2e">
<p>
Formating Vs Replacement Field(Paleholders{})
</p>
<div class="org-src-container">
<pre class="src src-python"><span style="color: #715ab1;">person</span> = <span style="color: #3a81c3;">{</span><span style="color: #2d9574;">'name'</span>: <span style="color: #2d9574;">'Jenn'</span>, <span style="color: #2d9574;">'age'</span>:23<span style="color: #3a81c3;">}</span>

<span style="color: #715ab1;">sentence</span> = <span style="color: #2d9574;">'My name is '</span>+person<span style="color: #3a81c3;">[</span><span style="color: #2d9574;">'name'</span><span style="color: #3a81c3;">]</span> + <span style="color: #2d9574;">'and I am '</span>+<span style="color: #3a81c3;">str</span><span style="color: #3a81c3;">(</span>person<span style="color: #6c3163;">[</span><span style="color: #2d9574;">'age'</span><span style="color: #6c3163;">]</span><span style="color: #3a81c3;">)</span>+ <span style="color: #2d9574;">'year old.'</span>
<span style="color: #3a81c3;">print</span><span style="color: #3a81c3;">(</span>sentence<span style="color: #3a81c3;">)</span>                               <span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">above is NOT READABLE, EASY WRITABLE</span>

<span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;"># Using Placeholder</span>
<span style="color: #715ab1;">sentence</span> = <span style="color: #2d9574;">'My name is {} and I am {} year old.'</span>.<span style="color: #3a81c3;">format</span><span style="color: #3a81c3;">(</span>person <span style="color: #6c3163;">[</span><span style="color: #2d9574;">'name'</span><span style="color: #6c3163;">]</span>, person<span style="color: #6c3163;">[</span><span style="color: #2d9574;">'age'</span><span style="color: #6c3163;">]</span><span style="color: #3a81c3;">)</span>
<span style="color: #3a81c3;">print</span><span style="color: #3a81c3;">(</span>sentence<span style="color: #3a81c3;">)</span>
</pre>
</div>
</div>
</li>
