python.org
***** Passing(assing place holders) inorder, numbers refeance, list, dic members, class attribues
#+BEGIN_SRC python
person = {'name': 'Jenn', 'age':23}

# Dict passing inorder
sentence = 'My name is {} and I am {} year old.'.format(person ['name'], person['age'])
print(sentence)

# Dict  passing by numbers{0},{1}...etc
sentence = 'My name is {0[name]} and I am {1[age]} year old.'.format(person, person)
print(sentence)

# passing by dic only values
person = {'name': 'Jenn', 'age':23}
sentence = 'My name is {0[name]} and I am {1[age]} year old.'.format(person)
print(sentence)


# place holders having keywords (basically used in dic)
sentence = 'My name is {name} and I am {age} year old.'.format(name ='Jack', age = '30')
print(sentence)


# passing in dic key and values
person = {'name': 'Jenn', 'age':23}
sentence = 'My name is {name} and I am {age} year old.'.format(**person)
print(sentence)

#List passing in list members
l1 = ['Jenn',23]
sentence = 'My name is {0[0]} and I am {0[1]} year old.'.format(person)
print(l1)

# passing class attributes

class Person():
  def __init__(self, name, age):
    self.name = name
    self.age = age

p1 = Person('Jack','33')
sentence = 'My name is {0.name} and I am {0.age} year old.'.formate(p1)
print(sentence)
#+END_SRC
***** Numbers (Padding, Decimals(precession), Comma)
#+BEGIN_SRC python
# # Padding

for i in range (1,11):
  sentence = 'This value is {:03}'.format(i)
  print(sentence)              # The value is 001


# # decimals(pression)

pi = 3.1415965

sendence = 'Pi is equal to {:.3f}'.formate(pi)
print(pi)                        # 3.142


# # comma seperator

sentence = '1 MB is equal to {:,.2f} bytes.'fomate(1000**2)
print(sentence)

# 1MB is equal to 1,000,000.00 bytes

#+END_SRC
***** Date String format
#+begin_src python
# # Date fomate link https://docs.python.org/3/library/datetime.html#strftime-and-strptime-behavior
import date time
my_date = datetime.date(2016,9,24,12,45) 


sentence ='{:%B %d, %Y}'.format(my_date)
print(sentence)  # >> September 24, 2016

sentence ='{0:%B %d, %Y} fell on a {0:%A} and was the {0:%j} day of the years.'.fomat(my_date)
print(sentence) # >> September 24, 2016 fell on a Saturday and was the 268 day of the years
#+end_src
***** Example1
#+BEGIN_SRC python
tag = 'h1'
text = 'This is a headerline'
sentence = '<{0}> <{1} </{0}'.format(tag,text)

print(sentence)             # >>> <h1>This is a headerline</h1>
#+END_SRC

