python.html
<li><a id="orgbe8acba"></a>Passing(assing place holders) inorder, numbers refeance, list, dic members, class attribues<br />
<div class="outline-text-6" id="text-orgbe8acba">
<div class="org-src-container">
<pre class="src src-python"><span style="color: #715ab1;">person</span> = <span style="color: #3a81c3;">{</span><span style="color: #2d9574;">'name'</span>: <span style="color: #2d9574;">'Jenn'</span>, <span style="color: #2d9574;">'age'</span>:23<span style="color: #3a81c3;">}</span>

<span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">Dict passing inorder</span>
<span style="color: #715ab1;">sentence</span> = <span style="color: #2d9574;">'My name is {} and I am {} year old.'</span>.<span style="color: #3a81c3;">format</span><span style="color: #3a81c3;">(</span>person <span style="color: #6c3163;">[</span><span style="color: #2d9574;">'name'</span><span style="color: #6c3163;">]</span>, person<span style="color: #6c3163;">[</span><span style="color: #2d9574;">'age'</span><span style="color: #6c3163;">]</span><span style="color: #3a81c3;">)</span>
<span style="color: #3a81c3;">print</span><span style="color: #3a81c3;">(</span>sentence<span style="color: #3a81c3;">)</span>

<span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">Dict  passing by numbers{0},{1}...etc</span>
<span style="color: #715ab1;">sentence</span> = <span style="color: #2d9574;">'My name is {0[name]} and I am {1[age]} year old.'</span>.<span style="color: #3a81c3;">format</span><span style="color: #3a81c3;">(</span>person, person<span style="color: #3a81c3;">)</span>
<span style="color: #3a81c3;">print</span><span style="color: #3a81c3;">(</span>sentence<span style="color: #3a81c3;">)</span>

<span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">passing by dic only values</span>
<span style="color: #715ab1;">person</span> = <span style="color: #3a81c3;">{</span><span style="color: #2d9574;">'name'</span>: <span style="color: #2d9574;">'Jenn'</span>, <span style="color: #2d9574;">'age'</span>:23<span style="color: #3a81c3;">}</span>
<span style="color: #715ab1;">sentence</span> = <span style="color: #2d9574;">'My name is {0[name]} and I am {1[age]} year old.'</span>.<span style="color: #3a81c3;">format</span><span style="color: #3a81c3;">(</span>person<span style="color: #3a81c3;">)</span>
<span style="color: #3a81c3;">print</span><span style="color: #3a81c3;">(</span>sentence<span style="color: #3a81c3;">)</span>


<span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">place holders having keywords (basically used in dic)</span>
<span style="color: #715ab1;">sentence</span> = <span style="color: #2d9574;">'My name is {name} and I am {age} year old.'</span>.<span style="color: #3a81c3;">format</span><span style="color: #3a81c3;">(</span>name =<span style="color: #2d9574;">'Jack'</span>, age = <span style="color: #2d9574;">'30'</span><span style="color: #3a81c3;">)</span>
<span style="color: #3a81c3;">print</span><span style="color: #3a81c3;">(</span>sentence<span style="color: #3a81c3;">)</span>


<span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">passing in dic key and values</span>
<span style="color: #715ab1;">person</span> = <span style="color: #3a81c3;">{</span><span style="color: #2d9574;">'name'</span>: <span style="color: #2d9574;">'Jenn'</span>, <span style="color: #2d9574;">'age'</span>:23<span style="color: #3a81c3;">}</span>
<span style="color: #715ab1;">sentence</span> = <span style="color: #2d9574;">'My name is {name} and I am {age} year old.'</span>.<span style="color: #3a81c3;">format</span><span style="color: #3a81c3;">(</span>**person<span style="color: #3a81c3;">)</span>
<span style="color: #3a81c3;">print</span><span style="color: #3a81c3;">(</span>sentence<span style="color: #3a81c3;">)</span>

<span style="color: #2aa1ae; background-color: #ecf3ec;">#</span><span style="color: #2aa1ae; background-color: #ecf3ec;">List passing in list members</span>
<span style="color: #715ab1;">l1</span> = <span style="color: #3a81c3;">[</span><span style="color: #2d9574;">'Jenn'</span>,23<span style="color: #3a81c3;">]</span>
<span style="color: #715ab1;">sentence</span> = <span style="color: #2d9574;">'My name is {0[0]} and I am {0[1]} year old.'</span>.<span style="color: #3a81c3;">format</span><span style="color: #3a81c3;">(</span>person<span style="color: #3a81c3;">)</span>
<span style="color: #3a81c3;">print</span><span style="color: #3a81c3;">(</span>l1<span style="color: #3a81c3;">)</span>

<span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">passing class attributes</span>

<span style="color: #3a81c3; font-weight: bold;">class</span> <span style="color: #ba2f59; font-weight: bold;">Person</span><span style="color: #3a81c3;">()</span>:
  <span style="color: #3a81c3; font-weight: bold;">def</span> <span style="color: #6c3163; font-weight: bold;">__init__</span><span style="color: #3a81c3;">(</span><span style="color: #3a81c3; font-weight: bold;">self</span>, name, age<span style="color: #3a81c3;">)</span>:
    <span style="color: #3a81c3; font-weight: bold;">self</span>.<span style="color: #715ab1;">name</span> = name
    <span style="color: #3a81c3; font-weight: bold;">self</span>.<span style="color: #715ab1;">age</span> = age

<span style="color: #715ab1;">p1</span> = Person<span style="color: #3a81c3;">(</span><span style="color: #2d9574;">'Jack'</span>,<span style="color: #2d9574;">'33'</span><span style="color: #3a81c3;">)</span>
<span style="color: #715ab1;">sentence</span> = <span style="color: #2d9574;">'My name is {0.name} and I am {0.age} year old.'</span>.formate<span style="color: #3a81c3;">(</span>p1<span style="color: #3a81c3;">)</span>
<span style="color: #3a81c3;">print</span><span style="color: #3a81c3;">(</span>sentence<span style="color: #3a81c3;">)</span>
</pre>
</div>
</div>
</li>
<li><a id="org2ac0018"></a>Numbers (Padding, Decimals(precession), Comma)<br />
<div class="outline-text-6" id="text-org2ac0018">
<div class="org-src-container">
<pre class="src src-python"><span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;"># Padding</span>

<span style="color: #3a81c3; font-weight: bold;">for</span> i <span style="color: #3a81c3; font-weight: bold;">in</span> <span style="color: #3a81c3;">range</span> <span style="color: #3a81c3;">(</span>1,11<span style="color: #3a81c3;">)</span>:
  <span style="color: #715ab1;">sentence</span> = <span style="color: #2d9574;">'This value is {:03}'</span>.<span style="color: #3a81c3;">format</span><span style="color: #3a81c3;">(</span>i<span style="color: #3a81c3;">)</span>
  <span style="color: #3a81c3;">print</span><span style="color: #3a81c3;">(</span>sentence<span style="color: #3a81c3;">)</span>              <span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">The value is 001</span>


<span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;"># decimals(pression)</span>

<span style="color: #715ab1;">pi</span> = 3.1415965

<span style="color: #715ab1;">sendence</span> = <span style="color: #2d9574;">'Pi is equal to {:.3f}'</span>.formate<span style="color: #3a81c3;">(</span>pi<span style="color: #3a81c3;">)</span>
<span style="color: #3a81c3;">print</span><span style="color: #3a81c3;">(</span>pi<span style="color: #3a81c3;">)</span>                        <span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">3.142</span>


<span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;"># comma seperator</span>

<span style="color: #715ab1;">sentence</span> = <span style="color: #2d9574;">'1 MB is equal to {:,.2f} bytes.'</span>fomate<span style="color: #3a81c3;">(</span>1000**2<span style="color: #3a81c3;">)</span>
<span style="color: #3a81c3;">print</span><span style="color: #3a81c3;">(</span>sentence<span style="color: #3a81c3;">)</span>

<span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">1MB is equal to 1,000,000.00 bytes</span>

</pre>
</div>
</div>
</li>
<li><a id="org7722163"></a>Date String format<br />
<div class="outline-text-6" id="text-org7722163">
<div class="org-src-container">
<pre class="src src-python"><span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;"># Date fomate link https://docs.python.org/3/library/datetime.html#strftime-and-strptime-behavior</span>
<span style="color: #3a81c3; font-weight: bold;">import</span> date time
<span style="color: #715ab1;">my_date</span> = datetime.date<span style="color: #3a81c3;">(</span>2016,9,24,12,45<span style="color: #3a81c3;">)</span> 


<span style="color: #715ab1;">sentence</span> =<span style="color: #2d9574;">'{:%B %d, %Y}'</span>.<span style="color: #3a81c3;">format</span><span style="color: #3a81c3;">(</span>my_date<span style="color: #3a81c3;">)</span>
<span style="color: #3a81c3;">print</span><span style="color: #3a81c3;">(</span>sentence<span style="color: #3a81c3;">)</span>  <span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">&gt;&gt; September 24, 2016</span>

<span style="color: #715ab1;">sentence</span> =<span style="color: #2d9574;">'{0:%B %d, %Y} fell on a {0:%A} and was the {0:%j} day of the years.'</span>.fomat<span style="color: #3a81c3;">(</span>my_date<span style="color: #3a81c3;">)</span>
<span style="color: #3a81c3;">print</span><span style="color: #3a81c3;">(</span>sentence<span style="color: #3a81c3;">)</span> <span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">&gt;&gt; September 24, 2016 fell on a Saturday and was the 268 day of the years</span>
</pre>
</div>
</div>
</li>
<li><a id="orge6227e1"></a>Example1<br />
<div class="outline-text-6" id="text-orge6227e1">
<div class="org-src-container">
<pre class="src src-python"><span style="color: #715ab1;">tag</span> = <span style="color: #2d9574;">'h1'</span>
<span style="color: #715ab1;">text</span> = <span style="color: #2d9574;">'This is a headerline'</span>
<span style="color: #715ab1;">sentence</span> = <span style="color: #2d9574;">'&lt;{0}&gt; &lt;{1} &lt;/{0}'</span>.<span style="color: #3a81c3;">format</span><span style="color: #3a81c3;">(</span>tag,text<span style="color: #3a81c3;">)</span>

<span style="color: #3a81c3;">print</span><span style="color: #3a81c3;">(</span>sentence<span style="color: #3a81c3;">)</span>             <span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">&gt;&gt;&gt; &lt;h1&gt;This is a headerline&lt;/h1&gt;</span>
</pre>
</div>
</div>
</li>
