python.org
***** Example 2
#+BEGIN_SRC python
age =24
print("My age is {0} years".format(age)) 								# >>> My age is 24 years
 
print("I am {0} years, {1} mounts, {2} days old".format(28,4,19))		# >>> I am 28 years, 4 mounts, 19 days old

print("""
 January     :{2} days
 February    :{0} days
 March       :{1} days
 April       :{1} days
 May         :{2} days
 June        :{1} days
 July        :{2} days
 August      :{2} days
 September   :{1} days
 October     :{2} days
 November    :{1} days
 December    :{2} days""".format(28, 30, 31))
#+END_SRC
**** R String
R string : is a raw string: the escape sequence are negleted   
#+BEGIN_SRC python
print(r'\tTab')                          # >>> \tTab      
#+END_SRC
**** F String {py3.6}
make string formate simple as possible
#+BEGIN_SRC python
greeting = 'Hello'
name = 'karthik
message = f'{greeting},  {name.upper()}.Welcome! '

print(dir(name))
print(help (str))
#+END_SRC

*** Print
convert convert the expressions you pass into a string and writes the result to standard output device(stdout in sys(sys.stdout and sys.stdin))
**** String Formating
| Foramt Symbol | Conversion             |
|---------------+------------------------|
| %c            | char                   |
| %s            | string                 |
| %i            | signed decimal int     |
| %d            | signed decimal int     |
| %u            | unsigned decimal int   |
| %o            | octal int              |
| %x            | hexa decimal int       |
| %e            | exponential            |
| %f            | floating point real no |
| %g            | shorter %f and %e      |


#+BEGIN_SRC python
#############################3#
#   String Formating
###############################

age = 24
print("My age is " + str(age) + "year")				# >>> My age is 24 year
print("My age is %d years using string formationg " %age) 	# >>> My age is 24 years

for i in range(1, 12):
    print("No. %2d square is %4d and cubed is %4d" %(i, i ** 2, i ** 3))		# >>> %d %2d, %4d  rightspace before var respectively #
#+END_SRC
**** Right Spacing & Precision 
***** Right Spacing Eg 0

#+BEGIN_SRC python

print("Pi value is appox %11f" %(22/7))       	# 11 = 03+1+1+06 	>>> Pi value is appox    3.142857
print("Pi value is appox %10f" %(22/7))       	# 10 = 02+1+1+06 	>>> Pi value is appox   3.142857
print("Pi value is appox %9f" %(22/7))       		# 09 = 01+1+1+06 	>>> Pi value is appox  3.142857
print("Pi value is appox %8f" %(22/7))		# 09 = 00+1+1+06 	>>> Pi value is appox 3.142857
print("Pi value is appox %7f" %(22/7))		# 09 = 00+1+1+06 	>>> Pi value is appox 3.142857
print("Pi value is appox %6f" %(22/7))		# 09 = 00+1+1+06 	>>> Pi value is appox 3.142857
print("		Conclusion :By Default Precission is 6digits")
#+END_SRC
***** Righ Spacing Eg 1
#+BEGIN_SRC python
for i in range(1, 12):
    print("No. %2d square is %4d and cubed is %4d" %(i, i ** 2, i ** 3))		# >>> %d %2d, %4d  rightspace before var respectively 
#+END_SRC

