python.html
<li><a id="orgfc2804e"></a>Example 2<br />
<div class="outline-text-6" id="text-orgfc2804e">
<div class="org-src-container">
<pre class="src src-python"><span style="color: #715ab1;">age</span> =24
<span style="color: #3a81c3;">print</span><span style="color: #3a81c3;">(</span><span style="color: #2d9574;">"My age is {0} years"</span>.<span style="color: #3a81c3;">format</span><span style="color: #6c3163;">(</span>age<span style="color: #6c3163;">)</span><span style="color: #3a81c3;">)</span>                                                                <span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">&gt;&gt;&gt; My age is 24 years</span>

<span style="color: #3a81c3;">print</span><span style="color: #3a81c3;">(</span><span style="color: #2d9574;">"I am {0} years, {1} mounts, {2} days old"</span>.<span style="color: #3a81c3;">format</span><span style="color: #6c3163;">(</span>28,4,19<span style="color: #6c3163;">)</span><span style="color: #3a81c3;">)</span>               <span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">&gt;&gt;&gt; I am 28 years, 4 mounts, 19 days old</span>

<span style="color: #3a81c3;">print</span><span style="color: #3a81c3;">(</span><span style="color: #2d9574;">"""</span>
<span style="color: #2d9574;"> January     :{2} days</span>
<span style="color: #2d9574;"> February    :{0} days</span>
<span style="color: #2d9574;"> March       :{1} days</span>
<span style="color: #2d9574;"> April       :{1} days</span>
<span style="color: #2d9574;"> May         :{2} days</span>
<span style="color: #2d9574;"> June        :{1} days</span>
<span style="color: #2d9574;"> July        :{2} days</span>
<span style="color: #2d9574;"> August      :{2} days</span>
<span style="color: #2d9574;"> September   :{1} days</span>
<span style="color: #2d9574;"> October     :{2} days</span>
<span style="color: #2d9574;"> November    :{1} days</span>
<span style="color: #2d9574;"> December    :{2} days"""</span>.<span style="color: #3a81c3;">format</span><span style="color: #6c3163;">(</span>28, 30, 31<span style="color: #6c3163;">)</span><span style="color: #3a81c3;">)</span>
</pre>
</div>
</div>
</li>
</ul>
</li>
<li><a id="orge9bf916"></a>R String<br />
<div class="outline-text-5" id="text-orge9bf916">
<p>
R string : is a raw string: the escape sequence are negleted   
</p>
<div class="org-src-container">
<pre class="src src-python"><span style="color: #3a81c3;">print</span><span style="color: #3a81c3;">(</span>r<span style="color: #2d9574;">'\tTab'</span><span style="color: #3a81c3;">)</span>                          <span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">&gt;&gt;&gt; \tTab      </span>
</pre>
</div>
</div>
</li>
<li><a id="org6d61a9d"></a>F String {py3.6}<br />
<div class="outline-text-5" id="text-org6d61a9d">
<p>
make string formate simple as possible
</p>
<div class="org-src-container">
<pre class="src src-python"><span style="color: #715ab1;">greeting</span> = <span style="color: #2d9574;">'Hello'</span>
<span style="color: #715ab1;">name</span> = <span style="color: #2d9574;">'karthik</span>
<span style="color: #2d9574;">message = f'</span><span style="color: #3a81c3;">{</span>greeting<span style="color: #3a81c3;">}</span>,  <span style="color: #3a81c3;">{</span>name.upper<span style="color: #6c3163;">()</span><span style="color: #3a81c3;">}</span>.Welcome! <span style="color: #2d9574;">'</span>

<span style="color: #2d9574;">print(dir(name))</span>
<span style="color: #2d9574;">print(help (str))</span>
</pre>
</div>
</div>
</li>
</ul>
</div>
<div id="outline-container-orgd51c2c2" class="outline-4">
<h4 id="orgd51c2c2">Print</h4>
<div class="outline-text-4" id="text-orgd51c2c2">
<p>
convert convert the expressions you pass into a string and writes the result to standard output device(stdout in sys(sys.stdout and sys.stdin))
</p>
</div>
<ul class="org-ul">
<li><a id="org287c207"></a>String Formating<br />
<div class="outline-text-5" id="text-org287c207">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Foramt Symbol</th>
<th scope="col" class="org-left">Conversion</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">%c</td>
<td class="org-left">char</td>
</tr>

<tr>
<td class="org-left">%s</td>
<td class="org-left">string</td>
</tr>

<tr>
<td class="org-left">%i</td>
<td class="org-left">signed decimal int</td>
</tr>

<tr>
<td class="org-left">%d</td>
<td class="org-left">signed decimal int</td>
</tr>

<tr>
<td class="org-left">%u</td>
<td class="org-left">unsigned decimal int</td>
</tr>

<tr>
<td class="org-left">%o</td>
<td class="org-left">octal int</td>
</tr>

<tr>
<td class="org-left">%x</td>
<td class="org-left">hexa decimal int</td>
</tr>

<tr>
<td class="org-left">%e</td>
<td class="org-left">exponential</td>
</tr>

<tr>
<td class="org-left">%f</td>
<td class="org-left">floating point real no</td>
</tr>

<tr>
<td class="org-left">%g</td>
<td class="org-left">shorter %f and %e</td>
</tr>
</tbody>
</table>


<div class="org-src-container">
<pre class="src src-python"><span style="color: #2aa1ae; background-color: #ecf3ec;">#############################</span><span style="color: #2aa1ae; background-color: #ecf3ec;">3#</span>
<span style="color: #2aa1ae; background-color: #ecf3ec;">#   </span><span style="color: #2aa1ae; background-color: #ecf3ec;">String Formating</span>
<span style="color: #2aa1ae; background-color: #ecf3ec;">###############################</span>

<span style="color: #715ab1;">age</span> = 24
<span style="color: #3a81c3;">print</span><span style="color: #3a81c3;">(</span><span style="color: #2d9574;">"My age is "</span> + <span style="color: #3a81c3;">str</span><span style="color: #6c3163;">(</span>age<span style="color: #6c3163;">)</span> + <span style="color: #2d9574;">"year"</span><span style="color: #3a81c3;">)</span>                         <span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">&gt;&gt;&gt; My age is 24 year</span>
<span style="color: #3a81c3;">print</span><span style="color: #3a81c3;">(</span><span style="color: #2d9574;">"My age is %d years using string formationg "</span> %age<span style="color: #3a81c3;">)</span>       <span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">&gt;&gt;&gt; My age is 24 years</span>

<span style="color: #3a81c3; font-weight: bold;">for</span> i <span style="color: #3a81c3; font-weight: bold;">in</span> <span style="color: #3a81c3;">range</span><span style="color: #3a81c3;">(</span>1, 12<span style="color: #3a81c3;">)</span>:
    <span style="color: #3a81c3;">print</span><span style="color: #3a81c3;">(</span><span style="color: #2d9574;">"No. %2d square is %4d and cubed is %4d"</span> %<span style="color: #6c3163;">(</span>i, i ** 2, i ** 3<span style="color: #6c3163;">)</span><span style="color: #3a81c3;">)</span>                <span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">&gt;&gt;&gt; %d %2d, %4d  rightspace before var respectively #</span>
</pre>
</div>
</div>
</li>
<li><a id="orga12914b"></a>Right Spacing &amp; Precision<br />
<ul class="org-ul">
<li><a id="orga2fe51d"></a>Right Spacing Eg 0<br />
<div class="outline-text-6" id="text-orga2fe51d">
<div class="org-src-container">
<pre class="src src-python">
<span style="color: #3a81c3;">print</span><span style="color: #3a81c3;">(</span><span style="color: #2d9574;">"Pi value is appox %11f"</span> %<span style="color: #6c3163;">(</span>22/7<span style="color: #6c3163;">)</span><span style="color: #3a81c3;">)</span>         <span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">11 = 03+1+1+06        &gt;&gt;&gt; Pi value is appox    3.142857</span>
<span style="color: #3a81c3;">print</span><span style="color: #3a81c3;">(</span><span style="color: #2d9574;">"Pi value is appox %10f"</span> %<span style="color: #6c3163;">(</span>22/7<span style="color: #6c3163;">)</span><span style="color: #3a81c3;">)</span>         <span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">10 = 02+1+1+06        &gt;&gt;&gt; Pi value is appox   3.142857</span>
<span style="color: #3a81c3;">print</span><span style="color: #3a81c3;">(</span><span style="color: #2d9574;">"Pi value is appox %9f"</span> %<span style="color: #6c3163;">(</span>22/7<span style="color: #6c3163;">)</span><span style="color: #3a81c3;">)</span>                  <span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">09 = 01+1+1+06        &gt;&gt;&gt; Pi value is appox  3.142857</span>
<span style="color: #3a81c3;">print</span><span style="color: #3a81c3;">(</span><span style="color: #2d9574;">"Pi value is appox %8f"</span> %<span style="color: #6c3163;">(</span>22/7<span style="color: #6c3163;">)</span><span style="color: #3a81c3;">)</span>          <span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">09 = 00+1+1+06        &gt;&gt;&gt; Pi value is appox 3.142857</span>
<span style="color: #3a81c3;">print</span><span style="color: #3a81c3;">(</span><span style="color: #2d9574;">"Pi value is appox %7f"</span> %<span style="color: #6c3163;">(</span>22/7<span style="color: #6c3163;">)</span><span style="color: #3a81c3;">)</span>          <span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">09 = 00+1+1+06        &gt;&gt;&gt; Pi value is appox 3.142857</span>
<span style="color: #3a81c3;">print</span><span style="color: #3a81c3;">(</span><span style="color: #2d9574;">"Pi value is appox %6f"</span> %<span style="color: #6c3163;">(</span>22/7<span style="color: #6c3163;">)</span><span style="color: #3a81c3;">)</span>          <span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">09 = 00+1+1+06        &gt;&gt;&gt; Pi value is appox 3.142857</span>
<span style="color: #3a81c3;">print</span><span style="color: #3a81c3;">(</span><span style="color: #2d9574;">"         Conclusion :By Default Precission is 6digits"</span><span style="color: #3a81c3;">)</span>
</pre>
</div>
</div>
</li>
<li><a id="org3a866d9"></a>Righ Spacing Eg 1<br />
<div class="outline-text-6" id="text-org3a866d9">
<div class="org-src-container">
<pre class="src src-python"><span style="color: #3a81c3; font-weight: bold;">for</span> i <span style="color: #3a81c3; font-weight: bold;">in</span> <span style="color: #3a81c3;">range</span><span style="color: #3a81c3;">(</span>1, 12<span style="color: #3a81c3;">)</span>:
    <span style="color: #3a81c3;">print</span><span style="color: #3a81c3;">(</span><span style="color: #2d9574;">"No. %2d square is %4d and cubed is %4d"</span> %<span style="color: #6c3163;">(</span>i, i ** 2, i ** 3<span style="color: #6c3163;">)</span><span style="color: #3a81c3;">)</span>                <span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">&gt;&gt;&gt; %d %2d, %4d  rightspace before var respectively </span>
</pre>
</div>
</div>
</li>
