python.org
***** Right Spacing Eg2
#+BEGIN_SRC python
###########################################################

# %12.50f >> If 12> 50 ==>size = 12  (RightSpace.s + Number.s + Point.s +  DecimalNAumber(precision).s

#############################################################
#                                                      S = RS+N+P+DN
print("\n")
print("Pi value is appox %12f" %(22/7))    		# 12 = 04+1+1+06	>>> Pi value is appox     3.142857
print("\n")

print("		Precision is varied %12.[01-10]f and result is below ")
print("Pi value is appox %12.1f" %(22/7))    		# 12 = 09+1+1+01 	>>> Pi value is appox          3.1
print("Pi value is appox %12.2f" %(22/7))    		# 12 = 08+1+1+02 	>>> Pi value is appox         3.14
print("Pi value is appox %12.3f" %(22/7))    		# 12 = 07+1+1+03 	>>> Pi value is appox        3.143
print("Pi value is appox %12.4f" %(22/7))    		# 12 = 06+1+1+04 	>>> Pi value is appox       3.1429
print("Pi value is appox %12.5f" %(22/7))    		# 12 = 05+1+1+05 	>>> Pi value is appox      3.14286
print("Pi value is appox %12.6f" %(22/7))    		# 12 = 04+1+1+06 	>>> Pi value is appox     3.142857
print("Pi value is appox %12.7f" %(22/7))    		# 12 = 03+1+1+07 	>>> Pi value is appox    3.1428571
print("Pi value is appox %12.8f" %(22/7))    		# 12 = 02+1+1+08 	>>> Pi value is appox   3.14285714
print("Pi value is appox %12.9f" %(22/7))    		# 12 = 01+1+1+09 	>>> Pi value is appox  3.142857143
print("Pi value is appox %12.10f" %(22/7))    		# 12 = 00+1+1+10 	>>> Pi value is appox 3.1428571429
print("		Conclusion :%12f used for left indexing by 12 spaces only if size No. is less than 12")

#+END_SRC

