python.html
<li><a id="org0e4263f"></a>Right Spacing Eg2<br />
<div class="outline-text-6" id="text-org0e4263f">
<div class="org-src-container">
<pre class="src src-python"><span style="color: #2aa1ae; background-color: #ecf3ec;">###########################################################</span>

<span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">%12.50f &gt;&gt; If 12&gt; 50 ==&gt;size = 12  (RightSpace.s + Number.s + Point.s +  DecimalNAumber(precision).s</span>

<span style="color: #2aa1ae; background-color: #ecf3ec;">#############################################################</span>
<span style="color: #2aa1ae; background-color: #ecf3ec;">#                                                      </span><span style="color: #2aa1ae; background-color: #ecf3ec;">S = RS+N+P+DN</span>
<span style="color: #3a81c3;">print</span><span style="color: #3a81c3;">(</span><span style="color: #2d9574;">"</span><span style="color: #4e3163;">\n</span><span style="color: #2d9574;">"</span><span style="color: #3a81c3;">)</span>
<span style="color: #3a81c3;">print</span><span style="color: #3a81c3;">(</span><span style="color: #2d9574;">"Pi value is appox %12f"</span> %<span style="color: #6c3163;">(</span>22/7<span style="color: #6c3163;">)</span><span style="color: #3a81c3;">)</span>                 <span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">12 = 04+1+1+06        &gt;&gt;&gt; Pi value is appox     3.142857</span>
<span style="color: #3a81c3;">print</span><span style="color: #3a81c3;">(</span><span style="color: #2d9574;">"</span><span style="color: #4e3163;">\n</span><span style="color: #2d9574;">"</span><span style="color: #3a81c3;">)</span>

<span style="color: #3a81c3;">print</span><span style="color: #3a81c3;">(</span><span style="color: #2d9574;">"         Precision is varied %12.[01-10]f and result is below "</span><span style="color: #3a81c3;">)</span>
<span style="color: #3a81c3;">print</span><span style="color: #3a81c3;">(</span><span style="color: #2d9574;">"Pi value is appox %12.1f"</span> %<span style="color: #6c3163;">(</span>22/7<span style="color: #6c3163;">)</span><span style="color: #3a81c3;">)</span>               <span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">12 = 09+1+1+01        &gt;&gt;&gt; Pi value is appox          3.1</span>
<span style="color: #3a81c3;">print</span><span style="color: #3a81c3;">(</span><span style="color: #2d9574;">"Pi value is appox %12.2f"</span> %<span style="color: #6c3163;">(</span>22/7<span style="color: #6c3163;">)</span><span style="color: #3a81c3;">)</span>               <span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">12 = 08+1+1+02        &gt;&gt;&gt; Pi value is appox         3.14</span>
<span style="color: #3a81c3;">print</span><span style="color: #3a81c3;">(</span><span style="color: #2d9574;">"Pi value is appox %12.3f"</span> %<span style="color: #6c3163;">(</span>22/7<span style="color: #6c3163;">)</span><span style="color: #3a81c3;">)</span>               <span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">12 = 07+1+1+03        &gt;&gt;&gt; Pi value is appox        3.143</span>
<span style="color: #3a81c3;">print</span><span style="color: #3a81c3;">(</span><span style="color: #2d9574;">"Pi value is appox %12.4f"</span> %<span style="color: #6c3163;">(</span>22/7<span style="color: #6c3163;">)</span><span style="color: #3a81c3;">)</span>               <span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">12 = 06+1+1+04        &gt;&gt;&gt; Pi value is appox       3.1429</span>
<span style="color: #3a81c3;">print</span><span style="color: #3a81c3;">(</span><span style="color: #2d9574;">"Pi value is appox %12.5f"</span> %<span style="color: #6c3163;">(</span>22/7<span style="color: #6c3163;">)</span><span style="color: #3a81c3;">)</span>               <span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">12 = 05+1+1+05        &gt;&gt;&gt; Pi value is appox      3.14286</span>
<span style="color: #3a81c3;">print</span><span style="color: #3a81c3;">(</span><span style="color: #2d9574;">"Pi value is appox %12.6f"</span> %<span style="color: #6c3163;">(</span>22/7<span style="color: #6c3163;">)</span><span style="color: #3a81c3;">)</span>               <span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">12 = 04+1+1+06        &gt;&gt;&gt; Pi value is appox     3.142857</span>
<span style="color: #3a81c3;">print</span><span style="color: #3a81c3;">(</span><span style="color: #2d9574;">"Pi value is appox %12.7f"</span> %<span style="color: #6c3163;">(</span>22/7<span style="color: #6c3163;">)</span><span style="color: #3a81c3;">)</span>               <span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">12 = 03+1+1+07        &gt;&gt;&gt; Pi value is appox    3.1428571</span>
<span style="color: #3a81c3;">print</span><span style="color: #3a81c3;">(</span><span style="color: #2d9574;">"Pi value is appox %12.8f"</span> %<span style="color: #6c3163;">(</span>22/7<span style="color: #6c3163;">)</span><span style="color: #3a81c3;">)</span>               <span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">12 = 02+1+1+08        &gt;&gt;&gt; Pi value is appox   3.14285714</span>
<span style="color: #3a81c3;">print</span><span style="color: #3a81c3;">(</span><span style="color: #2d9574;">"Pi value is appox %12.9f"</span> %<span style="color: #6c3163;">(</span>22/7<span style="color: #6c3163;">)</span><span style="color: #3a81c3;">)</span>               <span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">12 = 01+1+1+09        &gt;&gt;&gt; Pi value is appox  3.142857143</span>
<span style="color: #3a81c3;">print</span><span style="color: #3a81c3;">(</span><span style="color: #2d9574;">"Pi value is appox %12.10f"</span> %<span style="color: #6c3163;">(</span>22/7<span style="color: #6c3163;">)</span><span style="color: #3a81c3;">)</span>              <span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">12 = 00+1+1+10        &gt;&gt;&gt; Pi value is appox 3.1428571429</span>
<span style="color: #3a81c3;">print</span><span style="color: #3a81c3;">(</span><span style="color: #2d9574;">"         Conclusion :%12f used for left indexing by 12 spaces only if size No. is less than 12"</span><span style="color: #3a81c3;">)</span>

</pre>
</div>
</div>
</li>
