python.org
***** Precision
#+BEGIN_SRC python

print("		Precission >  Left Indexing then  ")


print("Pi value is appox %12.11f" %(22/7))    		# 13 = 00+1+1+11 	>>> Pi value is appox 3.14285714286
print("Pi value is appox %12.12f" %(22/7))    		# 14 = 00+1+1+12 	>>> Pi value is appox 3.142857142857
print("Pi value is appox %12.13f" %(22/7))    		# 15 = 00+1+1+13 	>>> Pi value is appox 3.1428571428571
print("Pi value is appox %12.14f" %(22/7))    		# 16 = 00+1+1+14 	>>> Pi value is appox 3.14285714285714
print("Pi value is appox %12.15f" %(22/7))    		# 17 = 00+1+1+15 	>>> Pi value is appox 3.142857142857143
print("Pi value is appox %12.16f" %(22/7))    		# 18 = 00+1+1+16 	>>> Pi value is appox 3.1428571428571428
print("Pi value is appox %12.17f" %(22/7))    		# 19 = 00+1+1+17 	>>> Pi value is appox 3.14285714285714279
print("Pi value is appox %12.18f" %(22/7))    		# 20 = 00+1+1+18 	>>> Pi value is appox 3.142857142857142794
print("Pi value is appox %12.19f" %(22/7))    		# 21 = 00+1+1+19 	>>> Pi value is appox 3.1428571428571427937
print("Pi value is appox %12.20f" %(22/7))    		# 22 = 00+1+1+20 	>>> Pi value is appox 3.14285714285714279370

print("Pi value is appox %12.30f" %(22/7))    		# 23 = 00+1+1+30 	>>> Pi value is appox 3.142857142857142793701541449991
print("Pi value is appox %12.40f" %(22/7))    		# 24 = 00+1+1+40 	>>> Pi value is appox 3.1428571428571427937015414499910548329353
print("Pi value is appox %12.50f" %(22/7))    		# 25 = 00+1+1+50 	>>> Pi value is appox 3.14285714285714279370154144999105483293533325195312
print("		Conclusion :If precision > Right space then no right shift is done")
#+END_SRC
*** EVAL : evaluate the string 
#+BEGIN_SRC python
a = '3+4+6'
print(eval(a))
eval ('my_list = [12,12,13,54]')
print(my_list)
#+END_SRC
** Tubles 
*** defination
#+BEGIN_SRC python
tuble1 = ("Neel","raj","sandeep")
#+END_SRC
*** Operations
      |---------------+-------------------------+---------------|
      | Operations    | tup1=('a') tup2=('b')   | Result        |
      |---------------+-------------------------+---------------|
      | Concatenation | tup1+tup2               | ('a','b')     |
      | Repetition    | tup1*3                  | ('a','a','a') |
      | Slicing       | t= ('a','b','c'),t[1:2] | ('b','c')     |
      | Indexing      | t[0]                    | 'a'           |
      |               |                         |               |

** List
*** Syntax
#+BEGIN_SRC python
# List iniciallization
list_1 = []			    # empty list
list_2 = list()			    # empty list
mylist = ["a", "b","c","d"]
mylist = ['Edureka',2.345,'Python']   # different data type

#+END_SRC
*** Operations

#+BEGIN_SRC python

  # Indexing 
  my_list = [0, 1, 2, 3, 4, 5, 6, 7, 8, 9]
             0, 1, 2, 3, 4, 5, 6, 7, 8, 9
           -10,-9,-8,-7,-6,-5,-4,-3,-2,-1


  print my_list[0]
  print my_list[-10]
#+END_SRC
