python.html
<li><a id="org5c0f3a1"></a>Precision<br />
<div class="outline-text-6" id="text-org5c0f3a1">
<div class="org-src-container">
<pre class="src src-python">
<span style="color: #3a81c3;">print</span><span style="color: #3a81c3;">(</span><span style="color: #2d9574;">"         Precission &gt;  Left Indexing then  "</span><span style="color: #3a81c3;">)</span>


<span style="color: #3a81c3;">print</span><span style="color: #3a81c3;">(</span><span style="color: #2d9574;">"Pi value is appox %12.11f"</span> %<span style="color: #6c3163;">(</span>22/7<span style="color: #6c3163;">)</span><span style="color: #3a81c3;">)</span>              <span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">13 = 00+1+1+11        &gt;&gt;&gt; Pi value is appox 3.14285714286</span>
<span style="color: #3a81c3;">print</span><span style="color: #3a81c3;">(</span><span style="color: #2d9574;">"Pi value is appox %12.12f"</span> %<span style="color: #6c3163;">(</span>22/7<span style="color: #6c3163;">)</span><span style="color: #3a81c3;">)</span>              <span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">14 = 00+1+1+12        &gt;&gt;&gt; Pi value is appox 3.142857142857</span>
<span style="color: #3a81c3;">print</span><span style="color: #3a81c3;">(</span><span style="color: #2d9574;">"Pi value is appox %12.13f"</span> %<span style="color: #6c3163;">(</span>22/7<span style="color: #6c3163;">)</span><span style="color: #3a81c3;">)</span>              <span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">15 = 00+1+1+13        &gt;&gt;&gt; Pi value is appox 3.1428571428571</span>
<span style="color: #3a81c3;">print</span><span style="color: #3a81c3;">(</span><span style="color: #2d9574;">"Pi value is appox %12.14f"</span> %<span style="color: #6c3163;">(</span>22/7<span style="color: #6c3163;">)</span><span style="color: #3a81c3;">)</span>              <span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">16 = 00+1+1+14        &gt;&gt;&gt; Pi value is appox 3.14285714285714</span>
<span style="color: #3a81c3;">print</span><span style="color: #3a81c3;">(</span><span style="color: #2d9574;">"Pi value is appox %12.15f"</span> %<span style="color: #6c3163;">(</span>22/7<span style="color: #6c3163;">)</span><span style="color: #3a81c3;">)</span>              <span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">17 = 00+1+1+15        &gt;&gt;&gt; Pi value is appox 3.142857142857143</span>
<span style="color: #3a81c3;">print</span><span style="color: #3a81c3;">(</span><span style="color: #2d9574;">"Pi value is appox %12.16f"</span> %<span style="color: #6c3163;">(</span>22/7<span style="color: #6c3163;">)</span><span style="color: #3a81c3;">)</span>              <span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">18 = 00+1+1+16        &gt;&gt;&gt; Pi value is appox 3.1428571428571428</span>
<span style="color: #3a81c3;">print</span><span style="color: #3a81c3;">(</span><span style="color: #2d9574;">"Pi value is appox %12.17f"</span> %<span style="color: #6c3163;">(</span>22/7<span style="color: #6c3163;">)</span><span style="color: #3a81c3;">)</span>              <span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">19 = 00+1+1+17        &gt;&gt;&gt; Pi value is appox 3.14285714285714279</span>
<span style="color: #3a81c3;">print</span><span style="color: #3a81c3;">(</span><span style="color: #2d9574;">"Pi value is appox %12.18f"</span> %<span style="color: #6c3163;">(</span>22/7<span style="color: #6c3163;">)</span><span style="color: #3a81c3;">)</span>              <span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">20 = 00+1+1+18        &gt;&gt;&gt; Pi value is appox 3.142857142857142794</span>
<span style="color: #3a81c3;">print</span><span style="color: #3a81c3;">(</span><span style="color: #2d9574;">"Pi value is appox %12.19f"</span> %<span style="color: #6c3163;">(</span>22/7<span style="color: #6c3163;">)</span><span style="color: #3a81c3;">)</span>              <span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">21 = 00+1+1+19        &gt;&gt;&gt; Pi value is appox 3.1428571428571427937</span>
<span style="color: #3a81c3;">print</span><span style="color: #3a81c3;">(</span><span style="color: #2d9574;">"Pi value is appox %12.20f"</span> %<span style="color: #6c3163;">(</span>22/7<span style="color: #6c3163;">)</span><span style="color: #3a81c3;">)</span>              <span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">22 = 00+1+1+20        &gt;&gt;&gt; Pi value is appox 3.14285714285714279370</span>

<span style="color: #3a81c3;">print</span><span style="color: #3a81c3;">(</span><span style="color: #2d9574;">"Pi value is appox %12.30f"</span> %<span style="color: #6c3163;">(</span>22/7<span style="color: #6c3163;">)</span><span style="color: #3a81c3;">)</span>              <span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">23 = 00+1+1+30        &gt;&gt;&gt; Pi value is appox 3.142857142857142793701541449991</span>
<span style="color: #3a81c3;">print</span><span style="color: #3a81c3;">(</span><span style="color: #2d9574;">"Pi value is appox %12.40f"</span> %<span style="color: #6c3163;">(</span>22/7<span style="color: #6c3163;">)</span><span style="color: #3a81c3;">)</span>              <span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">24 = 00+1+1+40        &gt;&gt;&gt; Pi value is appox 3.1428571428571427937015414499910548329353</span>
<span style="color: #3a81c3;">print</span><span style="color: #3a81c3;">(</span><span style="color: #2d9574;">"Pi value is appox %12.50f"</span> %<span style="color: #6c3163;">(</span>22/7<span style="color: #6c3163;">)</span><span style="color: #3a81c3;">)</span>              <span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">25 = 00+1+1+50        &gt;&gt;&gt; Pi value is appox 3.14285714285714279370154144999105483293533325195312</span>
<span style="color: #3a81c3;">print</span><span style="color: #3a81c3;">(</span><span style="color: #2d9574;">"         Conclusion :If precision &gt; Right space then no right shift is done"</span><span style="color: #3a81c3;">)</span>
</pre>
</div>
</div>
</li>
</ul>
</li>
</ul>
</div>
<div id="outline-container-orgfdf0588" class="outline-4">
<h4 id="orgfdf0588">EVAL : evaluate the string</h4>
<div class="outline-text-4" id="text-orgfdf0588">
<div class="org-src-container">
<pre class="src src-python"><span style="color: #715ab1;">a</span> = <span style="color: #2d9574;">'3+4+6'</span>
<span style="color: #3a81c3;">print</span><span style="color: #3a81c3;">(</span><span style="color: #3a81c3;">eval</span><span style="color: #6c3163;">(</span>a<span style="color: #6c3163;">)</span><span style="color: #3a81c3;">)</span>
<span style="color: #3a81c3;">eval</span> <span style="color: #3a81c3;">(</span><span style="color: #2d9574;">'my_list = [12,12,13,54]'</span><span style="color: #3a81c3;">)</span>
<span style="color: #3a81c3;">print</span><span style="color: #3a81c3;">(</span>my_list<span style="color: #3a81c3;">)</span>
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-org8b92653" class="outline-3">
<h3 id="org8b92653">Tubles</h3>
<div class="outline-text-3" id="text-org8b92653">
</div>
<div id="outline-container-orgfdbbc5a" class="outline-4">
<h4 id="orgfdbbc5a">defination</h4>
<div class="outline-text-4" id="text-orgfdbbc5a">
<div class="org-src-container">
<pre class="src src-python"><span style="color: #715ab1;">tuble1</span> = <span style="color: #3a81c3;">(</span><span style="color: #2d9574;">"Neel"</span>,<span style="color: #2d9574;">"raj"</span>,<span style="color: #2d9574;">"sandeep"</span><span style="color: #3a81c3;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-orge92e81f" class="outline-4">
<h4 id="orge92e81f">Operations</h4>
<div class="outline-text-4" id="text-orge92e81f">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Operations</th>
<th scope="col" class="org-left">tup1=('a') tup2=('b')</th>
<th scope="col" class="org-left">Result</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">Concatenation</td>
<td class="org-left">tup1+tup2</td>
<td class="org-left">('a','b')</td>
</tr>

<tr>
<td class="org-left">Repetition</td>
<td class="org-left">tup1*3</td>
<td class="org-left">('a','a','a')</td>
</tr>

<tr>
<td class="org-left">Slicing</td>
<td class="org-left">t= ('a','b','c'),t[1:2]</td>
<td class="org-left">('b','c')</td>
</tr>

<tr>
<td class="org-left">Indexing</td>
<td class="org-left">t[0]</td>
<td class="org-left">'a'</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
</table>
</div>
</div>
</div>
<div id="outline-container-org1835204" class="outline-3">
<h3 id="org1835204">List</h3>
<div class="outline-text-3" id="text-org1835204">
</div>
<div id="outline-container-org3bddb6b" class="outline-4">
<h4 id="org3bddb6b">Syntax</h4>
<div class="outline-text-4" id="text-org3bddb6b">
<div class="org-src-container">
<pre class="src src-python"><span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">List iniciallization</span>
<span style="color: #715ab1;">list_1</span> = <span style="color: #3a81c3;">[]</span>                         <span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">empty list</span>
<span style="color: #715ab1;">list_2</span> = <span style="color: #3a81c3;">list</span><span style="color: #3a81c3;">()</span>                     <span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">empty list</span>
<span style="color: #715ab1;">mylist</span> = <span style="color: #3a81c3;">[</span><span style="color: #2d9574;">"a"</span>, <span style="color: #2d9574;">"b"</span>,<span style="color: #2d9574;">"c"</span>,<span style="color: #2d9574;">"d"</span><span style="color: #3a81c3;">]</span>
<span style="color: #715ab1;">mylist</span> = <span style="color: #3a81c3;">[</span><span style="color: #2d9574;">'Edureka'</span>,2.345,<span style="color: #2d9574;">'Python'</span><span style="color: #3a81c3;">]</span>   <span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">different data type</span>

</pre>
</div>
</div>
</div>
<div id="outline-container-org6bf597b" class="outline-4">
<h4 id="org6bf597b">Operations</h4>
<div class="outline-text-4" id="text-org6bf597b">
<div class="org-src-container">
<pre class="src src-python">
<span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">Indexing </span>
<span style="color: #715ab1;">my_list</span> = <span style="color: #3a81c3;">[</span>0, 1, 2, 3, 4, 5, 6, 7, 8, 9<span style="color: #3a81c3;">]</span>
           0, 1, 2, 3, 4, 5, 6, 7, 8, 9
         -10,-9,-8,-7,-6,-5,-4,-3,-2,-1


<span style="color: #3a81c3;">print</span> my_list<span style="color: #3a81c3;">[</span>0<span style="color: #3a81c3;">]</span>
<span style="color: #3a81c3;">print</span> my_list<span style="color: #3a81c3;">[</span>-10<span style="color: #3a81c3;">]</span>
</pre>
</div>
</div>
</div>
