python.org
*** Slicing
#+BEGIN_SRC python

# #  Slicing
# list[start: end:step] and end is not included 
my_list

print my_list[3:8]            # [3, 4, 5, 6, 7]
print my_list[-7:-2]          # [3, 4, 5, 6, 7]

print my_list[1:-2]           # [1, ,2, 3, 4, 5, 6, 7]

# End is not include 

print my_list[1:9]
print my_list[1:]

# step : to skip 
print my_list[::2]           # [0, 2, 4, 6, 8]

# Reverse list

print my_list[::-1]          # [9, 8, 7, 6, 5, 4, 3, 2, 1] 

#+END_SRC

Try  slicing url into : top level domain, url without http://
#+BEGIN_SRC python
  url = http://corems.com

  # # Get top level domain

  print sample_url[-4:]               # >>> .com

  # # Print url without http:// 

  print sample_url[7: ]              # >>> corems


#+END_SRC

*** Sorted vs list.sorted
#+BEGIN_SRC python
  l1= [9, 1, 3, 2, 4, 5, 6, 7, 8]

  s_l1 = sorted(l1)

  print("Sorted Varible: \t", s_li)           # [1, 2, 3, 4, 5, 6, 7, 8, 9]
  print("Original Variable: \t",li)           # [9, 1, 3, 2, 4, 5, 6, 7, 8]

  # list.sort

  li.sort()
  print("Original Variable: \t",li)           # [1, 2, 3, 4, 5, 6, 7, 8, 9]

  li.sort(reverse = True)
  print("Original Variable: \t",li)           # [9, 8, 7, 6, 5, 4, 3, 2, 1]

  # sorted

  tup =  (9, 1, 3, 2, 4, 5, 6, 7, 8)
  s_tup = sorted(tup)
  printe ('Tuple \t', s_tup)           # [1, 2, 3, 4, 5, 6, 7, 8, 9]

  l1 = [-6, -5, -4, 1, 2, 3]
  s_li = sorted(li, key = abs)
  print(s_li)                          # [1, 2, 3, -4, -5, -6]

  di ={'name': 'Corey', 'job': 'programming', 'age':'None', 'os': 'Mac'}

  s_di = sorted(di)
  print('Dict \t', s_di)              # ['age','job', 'name', 'os']


  class Employee():
      def __init__(self, name, age, salary):
          self.name = name
          self.age= age
          self.salary= salary

      def __repr__(self):
          return '{}, {}, ${}'.formate(self.name, self.age, self.salary)

  e1 = Employee('Carl',37,700)
  e2 = Employee('Sarah',29,800)
  e3 = Employee('John',43,900)

  e_list = [e1, e2, e3]

  s_employees = sorted(e_list, key = lamda e:e.name)

  print(s_employees)              # [('Carl,37,$700'), (John,43,$400), (Sarah, 29, $800)]
#+END_SRC
