python.html
<div id="outline-container-orgf1c25f4" class="outline-4">
<h4 id="orgf1c25f4">Slicing</h4>
<div class="outline-text-4" id="text-orgf1c25f4">
<div class="org-src-container">
<pre class="src src-python">
<span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">#  Slicing</span>
<span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">list[start: end:step] and end is not included </span>
my_list

<span style="color: #3a81c3;">print</span> my_list<span style="color: #3a81c3;">[</span>3:8<span style="color: #3a81c3;">]</span>            <span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">[3, 4, 5, 6, 7]</span>
<span style="color: #3a81c3;">print</span> my_list<span style="color: #3a81c3;">[</span>-7:-2<span style="color: #3a81c3;">]</span>          <span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">[3, 4, 5, 6, 7]</span>

<span style="color: #3a81c3;">print</span> my_list<span style="color: #3a81c3;">[</span>1:-2<span style="color: #3a81c3;">]</span>           <span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">[1, ,2, 3, 4, 5, 6, 7]</span>

<span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">End is not include </span>

<span style="color: #3a81c3;">print</span> my_list<span style="color: #3a81c3;">[</span>1:9<span style="color: #3a81c3;">]</span>
<span style="color: #3a81c3;">print</span> my_list<span style="color: #3a81c3;">[</span>1:<span style="color: #3a81c3;">]</span>

<span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">step : to skip </span>
<span style="color: #3a81c3;">print</span> my_list<span style="color: #3a81c3;">[</span>::2<span style="color: #3a81c3;">]</span>           <span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">[0, 2, 4, 6, 8]</span>

<span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">Reverse list</span>

<span style="color: #3a81c3;">print</span> my_list<span style="color: #3a81c3;">[</span>::-1<span style="color: #3a81c3;">]</span>          <span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">[9, 8, 7, 6, 5, 4, 3, 2, 1] </span>

</pre>
</div>

<p>
Try  slicing url into : top level domain, url without <a href="http://">http://</a>
</p>
<div class="org-src-container">
<pre class="src src-python"><span style="color: #715ab1;">url</span> = http://corems.com

<span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;"># Get top level domain</span>

<span style="color: #3a81c3;">print</span> sample_url<span style="color: #3a81c3;">[</span>-4:<span style="color: #3a81c3;">]</span>               <span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">&gt;&gt;&gt; .com</span>

<span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;"># Print url without http:// </span>

<span style="color: #3a81c3;">print</span> sample_url<span style="color: #3a81c3;">[</span>7: <span style="color: #3a81c3;">]</span>              <span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">&gt;&gt;&gt; corems</span>


</pre>
</div>
</div>
</div>
<div id="outline-container-org378b5dd" class="outline-4">
<h4 id="org378b5dd">Sorted vs list.sorted</h4>
<div class="outline-text-4" id="text-org378b5dd">
<div class="org-src-container">
<pre class="src src-python"><span style="color: #715ab1;">l1</span>= <span style="color: #3a81c3;">[</span>9, 1, 3, 2, 4, 5, 6, 7, 8<span style="color: #3a81c3;">]</span>

<span style="color: #715ab1;">s_l1</span> = <span style="color: #3a81c3;">sorted</span><span style="color: #3a81c3;">(</span>l1<span style="color: #3a81c3;">)</span>

<span style="color: #3a81c3;">print</span><span style="color: #3a81c3;">(</span><span style="color: #2d9574;">"Sorted Varible: </span><span style="color: #4e3163;">\t</span><span style="color: #2d9574;">"</span>, s_li<span style="color: #3a81c3;">)</span>           <span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">[1, 2, 3, 4, 5, 6, 7, 8, 9]</span>
<span style="color: #3a81c3;">print</span><span style="color: #3a81c3;">(</span><span style="color: #2d9574;">"Original Variable: </span><span style="color: #4e3163;">\t</span><span style="color: #2d9574;">"</span>,li<span style="color: #3a81c3;">)</span>           <span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">[9, 1, 3, 2, 4, 5, 6, 7, 8]</span>

<span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">list.sort</span>

li.sort<span style="color: #3a81c3;">()</span>
<span style="color: #3a81c3;">print</span><span style="color: #3a81c3;">(</span><span style="color: #2d9574;">"Original Variable: </span><span style="color: #4e3163;">\t</span><span style="color: #2d9574;">"</span>,li<span style="color: #3a81c3;">)</span>           <span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">[1, 2, 3, 4, 5, 6, 7, 8, 9]</span>

li.sort<span style="color: #3a81c3;">(</span>reverse = <span style="color: #4e3163;">True</span><span style="color: #3a81c3;">)</span>
<span style="color: #3a81c3;">print</span><span style="color: #3a81c3;">(</span><span style="color: #2d9574;">"Original Variable: </span><span style="color: #4e3163;">\t</span><span style="color: #2d9574;">"</span>,li<span style="color: #3a81c3;">)</span>           <span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">[9, 8, 7, 6, 5, 4, 3, 2, 1]</span>

<span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">sorted</span>

<span style="color: #715ab1;">tup</span> =  <span style="color: #3a81c3;">(</span>9, 1, 3, 2, 4, 5, 6, 7, 8<span style="color: #3a81c3;">)</span>
<span style="color: #715ab1;">s_tup</span> = <span style="color: #3a81c3;">sorted</span><span style="color: #3a81c3;">(</span>tup<span style="color: #3a81c3;">)</span>
printe <span style="color: #3a81c3;">(</span><span style="color: #2d9574;">'Tuple </span><span style="color: #4e3163;">\t</span><span style="color: #2d9574;">'</span>, s_tup<span style="color: #3a81c3;">)</span>           <span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">[1, 2, 3, 4, 5, 6, 7, 8, 9]</span>

<span style="color: #715ab1;">l1</span> = <span style="color: #3a81c3;">[</span>-6, -5, -4, 1, 2, 3<span style="color: #3a81c3;">]</span>
<span style="color: #715ab1;">s_li</span> = <span style="color: #3a81c3;">sorted</span><span style="color: #3a81c3;">(</span>li, key = <span style="color: #3a81c3;">abs</span><span style="color: #3a81c3;">)</span>
<span style="color: #3a81c3;">print</span><span style="color: #3a81c3;">(</span>s_li<span style="color: #3a81c3;">)</span>                          <span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">[1, 2, 3, -4, -5, -6]</span>

<span style="color: #715ab1;">di</span> =<span style="color: #3a81c3;">{</span><span style="color: #2d9574;">'name'</span>: <span style="color: #2d9574;">'Corey'</span>, <span style="color: #2d9574;">'job'</span>: <span style="color: #2d9574;">'programming'</span>, <span style="color: #2d9574;">'age'</span>:<span style="color: #2d9574;">'None'</span>, <span style="color: #2d9574;">'os'</span>: <span style="color: #2d9574;">'Mac'</span><span style="color: #3a81c3;">}</span>

<span style="color: #715ab1;">s_di</span> = <span style="color: #3a81c3;">sorted</span><span style="color: #3a81c3;">(</span>di<span style="color: #3a81c3;">)</span>
<span style="color: #3a81c3;">print</span><span style="color: #3a81c3;">(</span><span style="color: #2d9574;">'Dict </span><span style="color: #4e3163;">\t</span><span style="color: #2d9574;">'</span>, s_di<span style="color: #3a81c3;">)</span>              <span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">['age','job', 'name', 'os']</span>


<span style="color: #3a81c3; font-weight: bold;">class</span> <span style="color: #ba2f59; font-weight: bold;">Employee</span><span style="color: #3a81c3;">()</span>:
    <span style="color: #3a81c3; font-weight: bold;">def</span> <span style="color: #6c3163; font-weight: bold;">__init__</span><span style="color: #3a81c3;">(</span><span style="color: #3a81c3; font-weight: bold;">self</span>, name, age, salary<span style="color: #3a81c3;">)</span>:
        <span style="color: #3a81c3; font-weight: bold;">self</span>.<span style="color: #715ab1;">name</span> = name
        <span style="color: #3a81c3; font-weight: bold;">self</span>.<span style="color: #715ab1;">age</span>= age
        <span style="color: #3a81c3; font-weight: bold;">self</span>.<span style="color: #715ab1;">salary</span>= salary

    <span style="color: #3a81c3; font-weight: bold;">def</span> <span style="color: #6c3163; font-weight: bold;">__repr__</span><span style="color: #3a81c3;">(</span><span style="color: #3a81c3; font-weight: bold;">self</span><span style="color: #3a81c3;">)</span>:
        <span style="color: #3a81c3; font-weight: bold;">return</span> <span style="color: #2d9574;">'{}, {}, ${}'</span>.formate<span style="color: #3a81c3;">(</span><span style="color: #3a81c3; font-weight: bold;">self</span>.name, <span style="color: #3a81c3; font-weight: bold;">self</span>.age, <span style="color: #3a81c3; font-weight: bold;">self</span>.salary<span style="color: #3a81c3;">)</span>

<span style="color: #715ab1;">e1</span> = Employee<span style="color: #3a81c3;">(</span><span style="color: #2d9574;">'Carl'</span>,37,700<span style="color: #3a81c3;">)</span>
<span style="color: #715ab1;">e2</span> = Employee<span style="color: #3a81c3;">(</span><span style="color: #2d9574;">'Sarah'</span>,29,800<span style="color: #3a81c3;">)</span>
<span style="color: #715ab1;">e3</span> = Employee<span style="color: #3a81c3;">(</span><span style="color: #2d9574;">'John'</span>,43,900<span style="color: #3a81c3;">)</span>

<span style="color: #715ab1;">e_list</span> = <span style="color: #3a81c3;">[</span>e1, e2, e3<span style="color: #3a81c3;">]</span>

<span style="color: #715ab1;">s_employees</span> = <span style="color: #3a81c3;">sorted</span><span style="color: #3a81c3;">(</span>e_list, key = lamda e:e.name<span style="color: #3a81c3;">)</span>

<span style="color: #3a81c3;">print</span><span style="color: #3a81c3;">(</span>s_employees<span style="color: #3a81c3;">)</span>              <span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">[('Carl,37,$700'), (John,43,$400), (Sarah, 29, $800)]</span>
</pre>
</div>
</div>
</div>
