python.org
*** Operations
 - adaddfasf
     lis1 = ['1','b',2.5]
     lis2 = ['a','d',4.6]
     lis_str = ['a', 'b', 'c', 'd']

      |---------------+---------------------------+----------------------------------------|
      | Operations    |                           | Result                                 |
      |---------------+---------------------------+----------------------------------------|
      | Concatenation | lis1 +lis2                | ['1','b',2.5, 'a','d',4.6]             |
      | Repetition    | lis1*3                    | ['1','b',2.5, '1','b',2.5,'1','b',2.5] |
      | Slicing       | lis1[0:4:2]               | ['1',2.5,]                             |
      | Indexing      | lis1[0]                   | '1'                                    |
      | delet         | del list1[0]              | ['b',2.5]                              |
      |               | del list1                 | []                                     |
      | Membership in | 2.5 in list1              | True                                   |
      |---------------+---------------------------+----------------------------------------|
      | Method        |                           |                                        |
      |---------------+---------------------------+----------------------------------------|
      | append        | list1.append('e')         | ['1','b',2.5,'e']                      |
      | extend        | list1.extend(['c','d'])   | ['1','b',2.5,'c','d']                  |
      | insert        | list1 .instert(1,'p')     | ['1','p','b',2.5 ]                     |
      | remove        | lis1.remove('1')          | ['1','b,2.5,'a','d',4.6]               |
      | pop()         | list1.pop()               | ['1','b']                              |
      | len           | len(list1)                | 3                                      |
      | count         | how many times obj occure |                                        |
      | sort          |                           |                                        |
      | list2str      | ' - '.joint(lis_str)      | 'a - b - c - d'                        |
      |               |                           |                                        |
**** list2str
#+BEGIN_SRC python
course = ['History', 'Math', 'Physics', 'CompSci']
course_str = " - ".join(courses)        # >>>  'History - Math - Physics - CompSci'
my_list = course_str.split(" - ")       # >>>  ['History', 'Math', 'Physics', 'CompSci']
#+END_SRC

** Tubles
*** Defination
#+BEGIN_SRC python
imelda = "More Mayhem", "Imelda May", 2011, ( (1, "Pulling the Rug"), (2, "Psycho"), (3, "Mayhem"), (4, "Kentish Town Waltz"))

print(imelda)

title, artist, year, tracks = imelda
#  Unpacking the Tuple
imelda
#+END_SRC
*** Operations
 - adaddfasf
     tup1 = ('1','b',2.5)
     tup2 = ('a','d',4.6)
     tup_str = ('a', 'b', 'c', 'd')

      |---------------+----------------------+----------------------------------------|
      | Operations    |                      | Result                                 |
      |---------------+----------------------+----------------------------------------|
      | Concatenation | tup1 +tup2           | ('1','b',2.5, 'a','d',4.6)             |
      | Repetition    | tup1*3               | ('1','b',2.5, '1','b',2.5,'1','b',2.5) |
      | Slicing       | tup1[0:4:2]          | ('1',2.5)                              |
      | Indexing      | tup1[0]              | '1'                                    |
      | Delete        | del tup1             |                                        |
      | Membership in | 2.5 in list1         | True                                   |
      |---------------+----------------------+----------------------------------------|
      | Method        |                      |                                        |
      |---------------+----------------------+----------------------------------------|
      | tub2str       | ' - '.joint(tup_str) | 'a - b - c - d'                        |
      | len           | len(tup1)            | 3                                      |
      | count         | ele(occures) in tup  |                                        |
      |               |                      |                                        |
** Dictionary
*** Defination
#+BEGIN_SRC python
fruit = {"orange": "a sweet, orange, citrus fruit",
	 "apple" : "good for making cider",
	 "lemon" : "a sour, yellow citrus fruit",
	 "grape" : "a small, sweet fruit growing in bunches",
	 "lime"  : "a sour, green citrus fruit"}
# ====================================

#+END_SRC
*** Adding New entity
#+BEGIN_SRC python
#  Adding a new key to existing Dic
fruit["pear"] = "an odd shaped apple"
#
# Updating or Replacing existing key
fruit["lime"] = "great with tequila"
print(fruit)
#+END_SRC
