python.html
<div id="outline-container-org4ac9861" class="outline-4">
<h4 id="org4ac9861">Operations</h4>
<div class="outline-text-4" id="text-org4ac9861">
<ul class="org-ul">
<li><p>
adaddfasf
lis1 = ['1','b',2.5]
lis2 = ['a','d',4.6]
lis_str = ['a', 'b', 'c', 'd']
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Operations</th>
<th scope="col" class="org-left">&#xa0;</th>
<th scope="col" class="org-left">Result</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">Concatenation</td>
<td class="org-left">lis1 +lis2</td>
<td class="org-left">['1','b',2.5, 'a','d',4.6]</td>
</tr>

<tr>
<td class="org-left">Repetition</td>
<td class="org-left">lis1*3</td>
<td class="org-left">['1','b',2.5, '1','b',2.5,'1','b',2.5]</td>
</tr>

<tr>
<td class="org-left">Slicing</td>
<td class="org-left">lis1[0:4:2]</td>
<td class="org-left">['1',2.5,]</td>
</tr>

<tr>
<td class="org-left">Indexing</td>
<td class="org-left">lis1[0]</td>
<td class="org-left">'1'</td>
</tr>

<tr>
<td class="org-left">delet</td>
<td class="org-left">del list1[0]</td>
<td class="org-left">['b',2.5]</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">del list1</td>
<td class="org-left">[]</td>
</tr>

<tr>
<td class="org-left">Membership in</td>
<td class="org-left">2.5 in list1</td>
<td class="org-left">True</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">Method</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">append</td>
<td class="org-left">list1.append('e')</td>
<td class="org-left">['1','b',2.5,'e']</td>
</tr>

<tr>
<td class="org-left">extend</td>
<td class="org-left">list1.extend(['c','d'])</td>
<td class="org-left">['1','b',2.5,'c','d']</td>
</tr>

<tr>
<td class="org-left">insert</td>
<td class="org-left">list1 .instert(1,'p')</td>
<td class="org-left">['1','p','b',2.5 ]</td>
</tr>

<tr>
<td class="org-left">remove</td>
<td class="org-left">lis1.remove('1')</td>
<td class="org-left">['1','b,2.5,'a','d',4.6]</td>
</tr>

<tr>
<td class="org-left">pop()</td>
<td class="org-left">list1.pop()</td>
<td class="org-left">['1','b']</td>
</tr>

<tr>
<td class="org-left">len</td>
<td class="org-left">len(list1)</td>
<td class="org-left">3</td>
</tr>

<tr>
<td class="org-left">count</td>
<td class="org-left">how many times obj occure</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">sort</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">list2str</td>
<td class="org-left">' - '.joint(lis_str)</td>
<td class="org-left">'a - b - c - d'</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
</table></li>
</ul>
</div>
<ul class="org-ul">
<li><a id="orge1f3d30"></a>list2str<br />
<div class="outline-text-5" id="text-orge1f3d30">
<div class="org-src-container">
<pre class="src src-python"><span style="color: #715ab1;">course</span> = <span style="color: #3a81c3;">[</span><span style="color: #2d9574;">'History'</span>, <span style="color: #2d9574;">'Math'</span>, <span style="color: #2d9574;">'Physics'</span>, <span style="color: #2d9574;">'CompSci'</span><span style="color: #3a81c3;">]</span>
<span style="color: #715ab1;">course_str</span> = <span style="color: #2d9574;">" - "</span>.join<span style="color: #3a81c3;">(</span>courses<span style="color: #3a81c3;">)</span>        <span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">&gt;&gt;&gt;  'History - Math - Physics - CompSci'</span>
<span style="color: #715ab1;">my_list</span> = course_str.split<span style="color: #3a81c3;">(</span><span style="color: #2d9574;">" - "</span><span style="color: #3a81c3;">)</span>       <span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">&gt;&gt;&gt;  ['History', 'Math', 'Physics', 'CompSci']</span>
</pre>
</div>
</div>
</li>
</ul>
</div>
</div>
<div id="outline-container-orgee85bed" class="outline-3">
<h3 id="orgee85bed">Tubles</h3>
<div class="outline-text-3" id="text-orgee85bed">
</div>
<div id="outline-container-orgb93ae45" class="outline-4">
<h4 id="orgb93ae45">Defination</h4>
<div class="outline-text-4" id="text-orgb93ae45">
<div class="org-src-container">
<pre class="src src-python"><span style="color: #715ab1;">imelda</span> = <span style="color: #2d9574;">"More Mayhem"</span>, <span style="color: #2d9574;">"Imelda May"</span>, 2011, <span style="color: #3a81c3;">(</span> <span style="color: #6c3163;">(</span>1, <span style="color: #2d9574;">"Pulling the Rug"</span><span style="color: #6c3163;">)</span>, <span style="color: #6c3163;">(</span>2, <span style="color: #2d9574;">"Psycho"</span><span style="color: #6c3163;">)</span>, <span style="color: #6c3163;">(</span>3, <span style="color: #2d9574;">"Mayhem"</span><span style="color: #6c3163;">)</span>, <span style="color: #6c3163;">(</span>4, <span style="color: #2d9574;">"Kentish Town Waltz"</span><span style="color: #6c3163;">)</span><span style="color: #3a81c3;">)</span>

<span style="color: #3a81c3;">print</span><span style="color: #3a81c3;">(</span>imelda<span style="color: #3a81c3;">)</span>

<span style="color: #715ab1;">title</span>, <span style="color: #715ab1;">artist</span>, <span style="color: #715ab1;">year</span>, <span style="color: #715ab1;">tracks</span> = imelda
<span style="color: #2aa1ae; background-color: #ecf3ec;">#  </span><span style="color: #2aa1ae; background-color: #ecf3ec;">Unpacking the Tuple</span>
imelda
</pre>
</div>
</div>
</div>
<div id="outline-container-org25591be" class="outline-4">
<h4 id="org25591be">Operations</h4>
<div class="outline-text-4" id="text-org25591be">
<ul class="org-ul">
<li><p>
adaddfasf
tup1 = ('1','b',2.5)
tup2 = ('a','d',4.6)
tup_str = ('a', 'b', 'c', 'd')
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Operations</th>
<th scope="col" class="org-left">&#xa0;</th>
<th scope="col" class="org-left">Result</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">Concatenation</td>
<td class="org-left">tup1 +tup2</td>
<td class="org-left">('1','b',2.5, 'a','d',4.6)</td>
</tr>

<tr>
<td class="org-left">Repetition</td>
<td class="org-left">tup1*3</td>
<td class="org-left">('1','b',2.5, '1','b',2.5,'1','b',2.5)</td>
</tr>

<tr>
<td class="org-left">Slicing</td>
<td class="org-left">tup1[0:4:2]</td>
<td class="org-left">('1',2.5)</td>
</tr>

<tr>
<td class="org-left">Indexing</td>
<td class="org-left">tup1[0]</td>
<td class="org-left">'1'</td>
</tr>

<tr>
<td class="org-left">Delete</td>
<td class="org-left">del tup1</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">Membership in</td>
<td class="org-left">2.5 in list1</td>
<td class="org-left">True</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">Method</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">tub2str</td>
<td class="org-left">' - '.joint(tup_str)</td>
<td class="org-left">'a - b - c - d'</td>
</tr>

<tr>
<td class="org-left">len</td>
<td class="org-left">len(tup1)</td>
<td class="org-left">3</td>
</tr>

<tr>
<td class="org-left">count</td>
<td class="org-left">ele(occures) in tup</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
</table></li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org8e0d759" class="outline-3">
<h3 id="org8e0d759">Dictionary</h3>
<div class="outline-text-3" id="text-org8e0d759">
</div>
<div id="outline-container-orgef810a8" class="outline-4">
<h4 id="orgef810a8">Defination</h4>
<div class="outline-text-4" id="text-orgef810a8">
<div class="org-src-container">
<pre class="src src-python"><span style="color: #715ab1;">fruit</span> = <span style="color: #3a81c3;">{</span><span style="color: #2d9574;">"orange"</span>: <span style="color: #2d9574;">"a sweet, orange, citrus fruit"</span>,
         <span style="color: #2d9574;">"apple"</span> : <span style="color: #2d9574;">"good for making cider"</span>,
         <span style="color: #2d9574;">"lemon"</span> : <span style="color: #2d9574;">"a sour, yellow citrus fruit"</span>,
         <span style="color: #2d9574;">"grape"</span> : <span style="color: #2d9574;">"a small, sweet fruit growing in bunches"</span>,
         <span style="color: #2d9574;">"lime"</span>  : <span style="color: #2d9574;">"a sour, green citrus fruit"</span><span style="color: #3a81c3;">}</span>
<span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">====================================</span>

</pre>
</div>
</div>
</div>
<div id="outline-container-orgbaaf868" class="outline-4">
<h4 id="orgbaaf868">Adding New entity</h4>
<div class="outline-text-4" id="text-orgbaaf868">
<div class="org-src-container">
<pre class="src src-python"><span style="color: #2aa1ae; background-color: #ecf3ec;">#  </span><span style="color: #2aa1ae; background-color: #ecf3ec;">Adding a new key to existing Dic</span>
<span style="color: #715ab1;">fruit</span><span style="color: #3a81c3;">[</span><span style="color: #2d9574;">"pear"</span><span style="color: #3a81c3;">]</span> = <span style="color: #2d9574;">"an odd shaped apple"</span>
<span style="color: #2aa1ae; background-color: #ecf3ec;">#</span>
<span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">Updating or Replacing existing key</span>
<span style="color: #715ab1;">fruit</span><span style="color: #3a81c3;">[</span><span style="color: #2d9574;">"lime"</span><span style="color: #3a81c3;">]</span> = <span style="color: #2d9574;">"great with tequila"</span>
<span style="color: #3a81c3;">print</span><span style="color: #3a81c3;">(</span>fruit<span style="color: #3a81c3;">)</span>
</pre>
</div>
</div>
</div>
