python.org
*** Deleting a key , Dic
#+BEGIN_SRC python
# =====================================
# #   Deleting a key,value from Dic
# del fruit["lemon"]
# =====================================
# # Deleting a Dic
# del fruit
# =====================================
# # 	Emptying the Dictionary
# fruit.clear()
# print(fruit)
# ====================================
#+END_SRC
*** Dict is UnOrder
#+BEGIN_SRC python
while True:
	dict_key = input("Please enter a fruit: ")
	if dict_key == "quit":
		break
	description = fruit.get(dict_key, "We don't have a" + dict_key)
	print(description)
	# if dict_key in fruit:
	# 	description = fruit.get(dict_key)
	# 	print(description)
	# else:
	# 	print("we don't have a " + dict_key)
  # =========================================
  #  Every time we run we will get different order

for item in fruit :
	print( item + "is"+ fruit[item])
for key, value in fruit.items():
   print(key,value) 
#+END_SRC
*** Ordered 
#+BEGIN_SRC python
  ordered_keys = list(fruit.keys())
  ordered_keys.sort()

  ordered_keys = sorted(list(fruit.keys()))
  for f in ordered_keys:
       print(f + " - " + fruit[f])

  # for f in sorted(fruit.keys()):
  # for f in fruit:
  #     print(f  + " - " + fruit[f])
  # for val in fruit.values():
  #     print(val)
  #
  # print('-' * 40)
  #
  # for key in fruit:
  #     print(fruit[key])
#+END_SRC 
*** Operations
myDict = {1:"apple",2:"ball"}
      |------------+------------------------+----------------------------|
      | Operations |                        | Result                     |
      |------------+------------------------+----------------------------|
      | accessing  | myDict[1]              | 'apple'                    |
      | len()      | len(myDict)            | 2                          |
      | key()      | key(myDict)            | [1,2]                      |
      | values()   | values(myDict)         | ['apple','ball']           |
*** Methods
      |--------------+------------------------+----------------------------|
      | Methods      |                        |                            |
      |--------------+------------------------+----------------------------|
      | items        | myDict.items()         | [(1,'apple'),(2,'ball')]   |
      | print "asdf" | myDict.get(4,"asdf")   | $: asdf                    |
      | get          | myDict.get(1)          | 'apple'                    |
      | update       | myDict.update({3:'c'}) | {1:'apple',2:'ball',3:"c"} |
      | pop          | myDict.pop(2)          | {1:'apple'}                |
      |              |                        |                            |
*** Loop in dictionary
#+begin_src python 
for key in a_dict:
    print(key, '->', a_dict[key])


a_dict = {'color': 'blue', 'fruit': 'apple', 'pet': 'dog'}
d_items = a_dict.items()
d_items  # Here d_items is a view of items

for item in a_dict.items():
     print(item)

# ('color', 'blue')
#('fruit', 'apple')
#('pet', 'dog')

for key, value in a_dict.items():
     print(key, '->', value)

#color -> blue
#ruit -> apple
#pet -> dog
#+end_src
** Set
In  [[SET Objects][https://docs.python.org/2/library/sets.html]]

*** defination
#+BEGIN_SRC python
myset = {1,2,3,4}
#+END_SRC
