python.html
<div id="outline-container-orga81bb4d" class="outline-4">
<h4 id="orga81bb4d">Deleting a key , Dic</h4>
<div class="outline-text-4" id="text-orga81bb4d">
<div class="org-src-container">
<pre class="src src-python"><span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">=====================================</span>
<span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">#   Deleting a key,value from Dic</span>
<span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">del fruit["lemon"]</span>
<span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">=====================================</span>
<span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;"># Deleting a Dic</span>
<span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">del fruit</span>
<span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">=====================================</span>
<span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">#     Emptying the Dictionary</span>
<span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">fruit.clear()</span>
<span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">print(fruit)</span>
<span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">====================================</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org5f65f07" class="outline-4">
<h4 id="org5f65f07">Dict is UnOrder</h4>
<div class="outline-text-4" id="text-org5f65f07">
<div class="org-src-container">
<pre class="src src-python"><span style="color: #3a81c3; font-weight: bold;">while</span> <span style="color: #4e3163;">True</span>:
        <span style="color: #715ab1;">dict_key</span> = <span style="color: #3a81c3;">input</span><span style="color: #3a81c3;">(</span><span style="color: #2d9574;">"Please enter a fruit: "</span><span style="color: #3a81c3;">)</span>
        <span style="color: #3a81c3; font-weight: bold;">if</span> dict_key == <span style="color: #2d9574;">"quit"</span>:
                <span style="color: #3a81c3; font-weight: bold;">break</span>
        <span style="color: #715ab1;">description</span> = fruit.get<span style="color: #3a81c3;">(</span>dict_key, <span style="color: #2d9574;">"We don't have a"</span> + dict_key<span style="color: #3a81c3;">)</span>
        <span style="color: #3a81c3;">print</span><span style="color: #3a81c3;">(</span>description<span style="color: #3a81c3;">)</span>
        <span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">if dict_key in fruit:</span>
        <span style="color: #2aa1ae; background-color: #ecf3ec;">#       </span><span style="color: #2aa1ae; background-color: #ecf3ec;">description = fruit.get(dict_key)</span>
        <span style="color: #2aa1ae; background-color: #ecf3ec;">#       </span><span style="color: #2aa1ae; background-color: #ecf3ec;">print(description)</span>
        <span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">else:</span>
        <span style="color: #2aa1ae; background-color: #ecf3ec;">#       </span><span style="color: #2aa1ae; background-color: #ecf3ec;">print("we don't have a " + dict_key)</span>
  <span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">=========================================</span>
  <span style="color: #2aa1ae; background-color: #ecf3ec;">#  </span><span style="color: #2aa1ae; background-color: #ecf3ec;">Every time we run we will get different order</span>

<span style="color: #3a81c3; font-weight: bold;">for</span> item <span style="color: #3a81c3; font-weight: bold;">in</span> fruit :
        <span style="color: #3a81c3;">print</span><span style="color: #3a81c3;">(</span> item + <span style="color: #2d9574;">"is"</span>+ fruit<span style="color: #6c3163;">[</span>item<span style="color: #6c3163;">]</span><span style="color: #3a81c3;">)</span>
<span style="color: #3a81c3; font-weight: bold;">for</span> key, value <span style="color: #3a81c3; font-weight: bold;">in</span> fruit.items<span style="color: #3a81c3;">()</span>:
   <span style="color: #3a81c3;">print</span><span style="color: #3a81c3;">(</span>key,value<span style="color: #3a81c3;">)</span> 
</pre>
</div>
</div>
</div>
<div id="outline-container-org93e724e" class="outline-4">
<h4 id="org93e724e">Ordered</h4>
<div class="outline-text-4" id="text-org93e724e">
<div class="org-src-container">
<pre class="src src-python"><span style="color: #715ab1;">ordered_keys</span> = <span style="color: #3a81c3;">list</span><span style="color: #3a81c3;">(</span>fruit.keys<span style="color: #6c3163;">()</span><span style="color: #3a81c3;">)</span>
ordered_keys.sort<span style="color: #3a81c3;">()</span>

<span style="color: #715ab1;">ordered_keys</span> = <span style="color: #3a81c3;">sorted</span><span style="color: #3a81c3;">(</span><span style="color: #3a81c3;">list</span><span style="color: #6c3163;">(</span>fruit.keys<span style="color: #2d9574;">()</span><span style="color: #6c3163;">)</span><span style="color: #3a81c3;">)</span>
<span style="color: #3a81c3; font-weight: bold;">for</span> f <span style="color: #3a81c3; font-weight: bold;">in</span> ordered_keys:
     <span style="color: #3a81c3;">print</span><span style="color: #3a81c3;">(</span>f + <span style="color: #2d9574;">" - "</span> + fruit<span style="color: #6c3163;">[</span>f<span style="color: #6c3163;">]</span><span style="color: #3a81c3;">)</span>

<span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">for f in sorted(fruit.keys()):</span>
<span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">for f in fruit:</span>
<span style="color: #2aa1ae; background-color: #ecf3ec;">#     </span><span style="color: #2aa1ae; background-color: #ecf3ec;">print(f  + " - " + fruit[f])</span>
<span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">for val in fruit.values():</span>
<span style="color: #2aa1ae; background-color: #ecf3ec;">#     </span><span style="color: #2aa1ae; background-color: #ecf3ec;">print(val)</span>
<span style="color: #2aa1ae; background-color: #ecf3ec;">#</span>
<span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">print('-' * 40)</span>
<span style="color: #2aa1ae; background-color: #ecf3ec;">#</span>
<span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">for key in fruit:</span>
<span style="color: #2aa1ae; background-color: #ecf3ec;">#     </span><span style="color: #2aa1ae; background-color: #ecf3ec;">print(fruit[key])</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org46d9e59" class="outline-4">
<h4 id="org46d9e59">Operations</h4>
<div class="outline-text-4" id="text-org46d9e59">
<p>
myDict = {1:"apple",2:"ball"}
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Operations</th>
<th scope="col" class="org-left">&#xa0;</th>
<th scope="col" class="org-left">Result</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">accessing</td>
<td class="org-left">myDict[1]</td>
<td class="org-left">'apple'</td>
</tr>

<tr>
<td class="org-left">len()</td>
<td class="org-left">len(myDict)</td>
<td class="org-left">2</td>
</tr>

<tr>
<td class="org-left">key()</td>
<td class="org-left">key(myDict)</td>
<td class="org-left">[1,2]</td>
</tr>

<tr>
<td class="org-left">values()</td>
<td class="org-left">values(myDict)</td>
<td class="org-left">['apple','ball']</td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-orga929d5b" class="outline-4">
<h4 id="orga929d5b">Methods</h4>
<div class="outline-text-4" id="text-orga929d5b">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Methods</th>
<th scope="col" class="org-left">&#xa0;</th>
<th scope="col" class="org-left">&#xa0;</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">items</td>
<td class="org-left">myDict.items()</td>
<td class="org-left">[(1,'apple'),(2,'ball')]</td>
</tr>

<tr>
<td class="org-left">print "asdf"</td>
<td class="org-left">myDict.get(4,"asdf")</td>
<td class="org-left">$: asdf</td>
</tr>

<tr>
<td class="org-left">get</td>
<td class="org-left">myDict.get(1)</td>
<td class="org-left">'apple'</td>
</tr>

<tr>
<td class="org-left">update</td>
<td class="org-left">myDict.update({3:'c'})</td>
<td class="org-left">{1:'apple',2:'ball',3:"c"}</td>
</tr>

<tr>
<td class="org-left">pop</td>
<td class="org-left">myDict.pop(2)</td>
<td class="org-left">{1:'apple'}</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-org6b043fd" class="outline-4">
<h4 id="org6b043fd">Loop in dictionary</h4>
<div class="outline-text-4" id="text-org6b043fd">
<div class="org-src-container">
<pre class="src src-python"><span style="color: #3a81c3; font-weight: bold;">for</span> key <span style="color: #3a81c3; font-weight: bold;">in</span> a_dict:
    <span style="color: #3a81c3;">print</span><span style="color: #3a81c3;">(</span>key, <span style="color: #2d9574;">'-&gt;'</span>, a_dict<span style="color: #6c3163;">[</span>key<span style="color: #6c3163;">]</span><span style="color: #3a81c3;">)</span>


<span style="color: #715ab1;">a_dict</span> = <span style="color: #3a81c3;">{</span><span style="color: #2d9574;">'color'</span>: <span style="color: #2d9574;">'blue'</span>, <span style="color: #2d9574;">'fruit'</span>: <span style="color: #2d9574;">'apple'</span>, <span style="color: #2d9574;">'pet'</span>: <span style="color: #2d9574;">'dog'</span><span style="color: #3a81c3;">}</span>
<span style="color: #715ab1;">d_items</span> = a_dict.items<span style="color: #3a81c3;">()</span>
d_items  <span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">Here d_items is a view of items</span>

<span style="color: #3a81c3; font-weight: bold;">for</span> item <span style="color: #3a81c3; font-weight: bold;">in</span> a_dict.items<span style="color: #3a81c3;">()</span>:
     <span style="color: #3a81c3;">print</span><span style="color: #3a81c3;">(</span>item<span style="color: #3a81c3;">)</span>

<span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">('color', 'blue')</span>
<span style="color: #2aa1ae; background-color: #ecf3ec;">#</span><span style="color: #2aa1ae; background-color: #ecf3ec;">('fruit', 'apple')</span>
<span style="color: #2aa1ae; background-color: #ecf3ec;">#</span><span style="color: #2aa1ae; background-color: #ecf3ec;">('pet', 'dog')</span>

<span style="color: #3a81c3; font-weight: bold;">for</span> key, value <span style="color: #3a81c3; font-weight: bold;">in</span> a_dict.items<span style="color: #3a81c3;">()</span>:
     <span style="color: #3a81c3;">print</span><span style="color: #3a81c3;">(</span>key, <span style="color: #2d9574;">'-&gt;'</span>, value<span style="color: #3a81c3;">)</span>

<span style="color: #2aa1ae; background-color: #ecf3ec;">#</span><span style="color: #2aa1ae; background-color: #ecf3ec;">color -&gt; blue</span>
<span style="color: #2aa1ae; background-color: #ecf3ec;">#</span><span style="color: #2aa1ae; background-color: #ecf3ec;">ruit -&gt; apple</span>
<span style="color: #2aa1ae; background-color: #ecf3ec;">#</span><span style="color: #2aa1ae; background-color: #ecf3ec;">pet -&gt; dog</span>
</pre>
</div>
</div>
</div>
</div>
