python.org
*** Syntax
#+BEGIN_SRC python
farm_animals = {"sheep", "cow", "hen"}
print(farm_animals)

 for animal in farm_animals:
     print(animal)

#+END_SRC
*** Adding elements 
#+BEGIN_SRC python
wild_animals = set(["lion", "tiger", "panther", "elephant", "hare"])

farm_animals.add("horse")
wild_animals.add("horse")
print(farm_animals)
print(wild_animals)
empty_set = set()
empty_set_2 = {}
empty_set.add("a")
 empty_set_2.add("a")

even = set(range(0, 40, 2))
print(even)
squares_tuple = (4, 6, 9, 16, 25)
squares = set(squares_tuple)
print(squares)
even = set(range(0, 40, 2))
print(even)
print(len(even))
#+END_SRC

*** Union,Intersection,difference,symmetric differ
#+BEGIN_SRC python
print(even.union(squares))
print(len(even.union(squares)))

print(squares.union(even))

print("-" * 40)

print(even.intersection(squares))
print(even & squares)
print(squares.intersection(even))
print(squares & even)

even = set(range(0, 40, 2))
print(sorted(even))
squares_tuple = (4, 6, 9, 16, 25)
squares = set(squares_tuple)
print(sorted(squares))

print("even minus squares")
print(sorted(even.difference(squares)))
print(sorted(even - squares))

print("squares minus even")
print(squares.difference(even))
print(squares - even)


print("symmetric even minus squares")
print(sorted(even.symmetric_difference(squares)))

print("symmetric squares minus even")
print(squares.symmetric_difference(even))
#+END_SRC
*** Sort
#+BEGIN_SRC python
print(sorted(even))
print(squares)
even.difference_update(squares)
print(sorted(even))
#+END_SRC
*** remove or discard elements
#+BEGIN_SRC python
# squares.discard(4)
# squares.remove(16)
# squares.discard(8)   # no error, does nothing
# print(squares)

# #   square.remove(8) 		>> error is occured and it error is used for condition
# try:
#     squares.remove(8)
# except KeyError:
#     print("The item 8 is not a member of the set")
#+END_SRC
