python.html
<div id="outline-container-org27d905a" class="outline-3">
<h3 id="org27d905a">Set</h3>
<div class="outline-text-3" id="text-org27d905a">
<p>
In  
</p>
</div>
<div id="outline-container-org5cc24cd" class="outline-4">
<h4 id="org5cc24cd">defination</h4>
<div class="outline-text-4" id="text-org5cc24cd">
<div class="org-src-container">
<pre class="src src-python"><span style="color: #715ab1;">myset</span> = <span style="color: #3a81c3;">{</span>1,2,3,4<span style="color: #3a81c3;">}</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org863c843" class="outline-4">
<h4 id="org863c843">Syntax</h4>
<div class="outline-text-4" id="text-org863c843">
<div class="org-src-container">
<pre class="src src-python"><span style="color: #715ab1;">farm_animals</span> = <span style="color: #3a81c3;">{</span><span style="color: #2d9574;">"sheep"</span>, <span style="color: #2d9574;">"cow"</span>, <span style="color: #2d9574;">"hen"</span><span style="color: #3a81c3;">}</span>
<span style="color: #3a81c3;">print</span><span style="color: #3a81c3;">(</span>farm_animals<span style="color: #3a81c3;">)</span>

 <span style="color: #3a81c3; font-weight: bold;">for</span> animal <span style="color: #3a81c3; font-weight: bold;">in</span> farm_animals:
     <span style="color: #3a81c3;">print</span><span style="color: #3a81c3;">(</span>animal<span style="color: #3a81c3;">)</span>

</pre>
</div>
</div>
</div>
<div id="outline-container-orge68c25c" class="outline-4">
<h4 id="orge68c25c">Adding elements</h4>
<div class="outline-text-4" id="text-orge68c25c">
<div class="org-src-container">
<pre class="src src-python"><span style="color: #715ab1;">wild_animals</span> = <span style="color: #3a81c3;">set</span><span style="color: #3a81c3;">(</span><span style="color: #6c3163;">[</span><span style="color: #2d9574;">"lion"</span>, <span style="color: #2d9574;">"tiger"</span>, <span style="color: #2d9574;">"panther"</span>, <span style="color: #2d9574;">"elephant"</span>, <span style="color: #2d9574;">"hare"</span><span style="color: #6c3163;">]</span><span style="color: #3a81c3;">)</span>

farm_animals.add<span style="color: #3a81c3;">(</span><span style="color: #2d9574;">"horse"</span><span style="color: #3a81c3;">)</span>
wild_animals.add<span style="color: #3a81c3;">(</span><span style="color: #2d9574;">"horse"</span><span style="color: #3a81c3;">)</span>
<span style="color: #3a81c3;">print</span><span style="color: #3a81c3;">(</span>farm_animals<span style="color: #3a81c3;">)</span>
<span style="color: #3a81c3;">print</span><span style="color: #3a81c3;">(</span>wild_animals<span style="color: #3a81c3;">)</span>
<span style="color: #715ab1;">empty_set</span> = <span style="color: #3a81c3;">set</span><span style="color: #3a81c3;">()</span>
<span style="color: #715ab1;">empty_set_2</span> = <span style="color: #3a81c3;">{}</span>
empty_set.add<span style="color: #3a81c3;">(</span><span style="color: #2d9574;">"a"</span><span style="color: #3a81c3;">)</span>
 empty_set_2.add<span style="color: #3a81c3;">(</span><span style="color: #2d9574;">"a"</span><span style="color: #3a81c3;">)</span>

<span style="color: #715ab1;">even</span> = <span style="color: #3a81c3;">set</span><span style="color: #3a81c3;">(</span><span style="color: #3a81c3;">range</span><span style="color: #6c3163;">(</span>0, 40, 2<span style="color: #6c3163;">)</span><span style="color: #3a81c3;">)</span>
<span style="color: #3a81c3;">print</span><span style="color: #3a81c3;">(</span>even<span style="color: #3a81c3;">)</span>
<span style="color: #715ab1;">squares_tuple</span> = <span style="color: #3a81c3;">(</span>4, 6, 9, 16, 25<span style="color: #3a81c3;">)</span>
<span style="color: #715ab1;">squares</span> = <span style="color: #3a81c3;">set</span><span style="color: #3a81c3;">(</span>squares_tuple<span style="color: #3a81c3;">)</span>
<span style="color: #3a81c3;">print</span><span style="color: #3a81c3;">(</span>squares<span style="color: #3a81c3;">)</span>
<span style="color: #715ab1;">even</span> = <span style="color: #3a81c3;">set</span><span style="color: #3a81c3;">(</span><span style="color: #3a81c3;">range</span><span style="color: #6c3163;">(</span>0, 40, 2<span style="color: #6c3163;">)</span><span style="color: #3a81c3;">)</span>
<span style="color: #3a81c3;">print</span><span style="color: #3a81c3;">(</span>even<span style="color: #3a81c3;">)</span>
<span style="color: #3a81c3;">print</span><span style="color: #3a81c3;">(</span><span style="color: #3a81c3;">len</span><span style="color: #6c3163;">(</span>even<span style="color: #6c3163;">)</span><span style="color: #3a81c3;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org834c4e8" class="outline-4">
<h4 id="org834c4e8">Union,Intersection,difference,symmetric differ</h4>
<div class="outline-text-4" id="text-org834c4e8">
<div class="org-src-container">
<pre class="src src-python"><span style="color: #3a81c3;">print</span><span style="color: #3a81c3;">(</span>even.union<span style="color: #6c3163;">(</span>squares<span style="color: #6c3163;">)</span><span style="color: #3a81c3;">)</span>
<span style="color: #3a81c3;">print</span><span style="color: #3a81c3;">(</span><span style="color: #3a81c3;">len</span><span style="color: #6c3163;">(</span>even.union<span style="color: #2d9574;">(</span>squares<span style="color: #2d9574;">)</span><span style="color: #6c3163;">)</span><span style="color: #3a81c3;">)</span>

<span style="color: #3a81c3;">print</span><span style="color: #3a81c3;">(</span>squares.union<span style="color: #6c3163;">(</span>even<span style="color: #6c3163;">)</span><span style="color: #3a81c3;">)</span>

<span style="color: #3a81c3;">print</span><span style="color: #3a81c3;">(</span><span style="color: #2d9574;">"-"</span> * 40<span style="color: #3a81c3;">)</span>

<span style="color: #3a81c3;">print</span><span style="color: #3a81c3;">(</span>even.intersection<span style="color: #6c3163;">(</span>squares<span style="color: #6c3163;">)</span><span style="color: #3a81c3;">)</span>
<span style="color: #3a81c3;">print</span><span style="color: #3a81c3;">(</span>even &amp; squares<span style="color: #3a81c3;">)</span>
<span style="color: #3a81c3;">print</span><span style="color: #3a81c3;">(</span>squares.intersection<span style="color: #6c3163;">(</span>even<span style="color: #6c3163;">)</span><span style="color: #3a81c3;">)</span>
<span style="color: #3a81c3;">print</span><span style="color: #3a81c3;">(</span>squares &amp; even<span style="color: #3a81c3;">)</span>

<span style="color: #715ab1;">even</span> = <span style="color: #3a81c3;">set</span><span style="color: #3a81c3;">(</span><span style="color: #3a81c3;">range</span><span style="color: #6c3163;">(</span>0, 40, 2<span style="color: #6c3163;">)</span><span style="color: #3a81c3;">)</span>
<span style="color: #3a81c3;">print</span><span style="color: #3a81c3;">(</span><span style="color: #3a81c3;">sorted</span><span style="color: #6c3163;">(</span>even<span style="color: #6c3163;">)</span><span style="color: #3a81c3;">)</span>
<span style="color: #715ab1;">squares_tuple</span> = <span style="color: #3a81c3;">(</span>4, 6, 9, 16, 25<span style="color: #3a81c3;">)</span>
<span style="color: #715ab1;">squares</span> = <span style="color: #3a81c3;">set</span><span style="color: #3a81c3;">(</span>squares_tuple<span style="color: #3a81c3;">)</span>
<span style="color: #3a81c3;">print</span><span style="color: #3a81c3;">(</span><span style="color: #3a81c3;">sorted</span><span style="color: #6c3163;">(</span>squares<span style="color: #6c3163;">)</span><span style="color: #3a81c3;">)</span>

<span style="color: #3a81c3;">print</span><span style="color: #3a81c3;">(</span><span style="color: #2d9574;">"even minus squares"</span><span style="color: #3a81c3;">)</span>
<span style="color: #3a81c3;">print</span><span style="color: #3a81c3;">(</span><span style="color: #3a81c3;">sorted</span><span style="color: #6c3163;">(</span>even.difference<span style="color: #2d9574;">(</span>squares<span style="color: #2d9574;">)</span><span style="color: #6c3163;">)</span><span style="color: #3a81c3;">)</span>
<span style="color: #3a81c3;">print</span><span style="color: #3a81c3;">(</span><span style="color: #3a81c3;">sorted</span><span style="color: #6c3163;">(</span>even - squares<span style="color: #6c3163;">)</span><span style="color: #3a81c3;">)</span>

<span style="color: #3a81c3;">print</span><span style="color: #3a81c3;">(</span><span style="color: #2d9574;">"squares minus even"</span><span style="color: #3a81c3;">)</span>
<span style="color: #3a81c3;">print</span><span style="color: #3a81c3;">(</span>squares.difference<span style="color: #6c3163;">(</span>even<span style="color: #6c3163;">)</span><span style="color: #3a81c3;">)</span>
<span style="color: #3a81c3;">print</span><span style="color: #3a81c3;">(</span>squares - even<span style="color: #3a81c3;">)</span>


<span style="color: #3a81c3;">print</span><span style="color: #3a81c3;">(</span><span style="color: #2d9574;">"symmetric even minus squares"</span><span style="color: #3a81c3;">)</span>
<span style="color: #3a81c3;">print</span><span style="color: #3a81c3;">(</span><span style="color: #3a81c3;">sorted</span><span style="color: #6c3163;">(</span>even.symmetric_difference<span style="color: #2d9574;">(</span>squares<span style="color: #2d9574;">)</span><span style="color: #6c3163;">)</span><span style="color: #3a81c3;">)</span>

<span style="color: #3a81c3;">print</span><span style="color: #3a81c3;">(</span><span style="color: #2d9574;">"symmetric squares minus even"</span><span style="color: #3a81c3;">)</span>
<span style="color: #3a81c3;">print</span><span style="color: #3a81c3;">(</span>squares.symmetric_difference<span style="color: #6c3163;">(</span>even<span style="color: #6c3163;">)</span><span style="color: #3a81c3;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-orgc6b01aa" class="outline-4">
<h4 id="orgc6b01aa">Sort</h4>
<div class="outline-text-4" id="text-orgc6b01aa">
<div class="org-src-container">
<pre class="src src-python"><span style="color: #3a81c3;">print</span><span style="color: #3a81c3;">(</span><span style="color: #3a81c3;">sorted</span><span style="color: #6c3163;">(</span>even<span style="color: #6c3163;">)</span><span style="color: #3a81c3;">)</span>
<span style="color: #3a81c3;">print</span><span style="color: #3a81c3;">(</span>squares<span style="color: #3a81c3;">)</span>
even.difference_update<span style="color: #3a81c3;">(</span>squares<span style="color: #3a81c3;">)</span>
<span style="color: #3a81c3;">print</span><span style="color: #3a81c3;">(</span><span style="color: #3a81c3;">sorted</span><span style="color: #6c3163;">(</span>even<span style="color: #6c3163;">)</span><span style="color: #3a81c3;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-orgef75da5" class="outline-4">
<h4 id="orgef75da5">remove or discard elements</h4>
<div class="outline-text-4" id="text-orgef75da5">
<div class="org-src-container">
<pre class="src src-python"><span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">squares.discard(4)</span>
<span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">squares.remove(16)</span>
<span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">squares.discard(8)   # no error, does nothing</span>
<span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">print(squares)</span>

<span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">#   square.remove(8)          &gt;&gt; error is occured and it error is used for condition</span>
<span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">try:</span>
<span style="color: #2aa1ae; background-color: #ecf3ec;">#     </span><span style="color: #2aa1ae; background-color: #ecf3ec;">squares.remove(8)</span>
<span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">except KeyError:</span>
<span style="color: #2aa1ae; background-color: #ecf3ec;">#     </span><span style="color: #2aa1ae; background-color: #ecf3ec;">print("The item 8 is not a member of the set")</span>
</pre>
</div>
</div>
</div>
