python.org
*** subset/superset
#+BEGIN_SRC python
# even = set(range(0, 40, 2))
# print(even)
# squares_tuple = (4, 6, 16)
# squares = set(squares_tuple)
# print(squares)
#
# if squares.issubset(even):
#     print("squares is a subset of even")
#
# if even.issuperset(squares):
#     print("even is a superset of squares")

even = frozenset(range(0, 100, 2))

print(even)
# even.add(3)
#+END_SRC
*** Methods
myS1 = {1,2,3}
myS2 = {1,'B','C'}
  |-----------------------------+---------------------------------+---------------|
  | Methods                     |                                 |               |
  |-----------------------------+---------------------------------+---------------|
  | Union                       | (myS1 UNION myS2)               | {1,2,'B','C'} |
  |                             | myS1.union(myS2)                | {1,2,'B','C'} |
  | Intersection                | myS1 & myS2                     | {1,'C'}       |
  |                             | myS1.intersection(myS2)         | {1,'C'}       |
  | difference                  | myS1 - myS2                     | {2}           |
  |                             | myS1.difference(myS2)           | {2}           |
  | symmetric_difference        | myS1.symmetric_difference(myS2) |               |
  | remove                      | myS1.remove(1)                  | {2,3}         |
  | discard(no exception rised) | myS1.discarde(3)                |               |
  | issubset                    |                                 |               |
  | issuperset                  |                                 |               |
  |                             |                                 |               |
** Type Conversions
*** tub2list
#+BEGIN_SRC python
tup1 = ()
#+END_SRC
*** list2Str
#+begin_src python
# Converting a list to str

mylist = ["a", "b","c","d"]
newString = ""
#
for c in mylist:
		newString = c + "."
print(newString)
# OR 
newString1 = ".".join(mylist)
print(newString1)
#+end_src

*** tubles2set
#+BEGIN_SRC python
##### details visit #set-objects

# even = set(range(0, 40, 2))
# print(even)
# squares_tuple = (4, 6, 9, 16, 25)
# squares = set(squares_tuple)
# print(squares)
#+END_SRC
*** Conversion tubles2dic
#+BEGIN_SRC python
fruit_keys = fruit.keys()
print(fruit_keys)

fruit_list = fruit.items() 			# Convert dic to list containing tuples ( key, value )
# [('lime', 'a sour, green citrus fruit'), ('apple', 'good for making cider') .....etc ]

fruit_tup = tuple(fruit.items()) 	# Convert dic to tuples containing tuples (key, value)
# (  ('lime', 'a sour, green citrus fruit'), ('apple', 'good for making cider') .....etc )

fruit_dic2 = dict( fruit_tup)		# Convert tuple to dic
#+END_SRC
*** String2int
#+BEGIN_SRC python
a = '123'
b = int(a)
#+END_SRC
*** str2float
#+BEGIN_SRC python
a= '123.456'
b = float(a)        # 123
c= int(a) # ValueErro: invalid literal for int() with base 10
d = int(float(a))    # 123
#+END_SRC

*** str2list,set,tuple
#+BEGIN_SRC python
a = 'hello'
list(a)      # ['h', 'e','l','l','o']
set(a)       # {'h', 'e','l','l','o'}
tuple(a)     # ('h', 'e','l','l','o')
#+END_SRC
