python.html
<div id="outline-container-orgc288909" class="outline-4">
<h4 id="orgc288909">subset/superset</h4>
<div class="outline-text-4" id="text-orgc288909">
<div class="org-src-container">
<pre class="src src-python"><span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">even = set(range(0, 40, 2))</span>
<span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">print(even)</span>
<span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">squares_tuple = (4, 6, 16)</span>
<span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">squares = set(squares_tuple)</span>
<span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">print(squares)</span>
<span style="color: #2aa1ae; background-color: #ecf3ec;">#</span>
<span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">if squares.issubset(even):</span>
<span style="color: #2aa1ae; background-color: #ecf3ec;">#     </span><span style="color: #2aa1ae; background-color: #ecf3ec;">print("squares is a subset of even")</span>
<span style="color: #2aa1ae; background-color: #ecf3ec;">#</span>
<span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">if even.issuperset(squares):</span>
<span style="color: #2aa1ae; background-color: #ecf3ec;">#     </span><span style="color: #2aa1ae; background-color: #ecf3ec;">print("even is a superset of squares")</span>

<span style="color: #715ab1;">even</span> = <span style="color: #3a81c3;">frozenset</span><span style="color: #3a81c3;">(</span><span style="color: #3a81c3;">range</span><span style="color: #6c3163;">(</span>0, 100, 2<span style="color: #6c3163;">)</span><span style="color: #3a81c3;">)</span>

<span style="color: #3a81c3;">print</span><span style="color: #3a81c3;">(</span>even<span style="color: #3a81c3;">)</span>
<span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">even.add(3)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-orga17e5e5" class="outline-4">
<h4 id="orga17e5e5">Methods</h4>
<div class="outline-text-4" id="text-orga17e5e5">
<p>
myS1 = {1,2,3}
myS2 = {1,'B','C'}
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Methods</th>
<th scope="col" class="org-left">&#xa0;</th>
<th scope="col" class="org-left">&#xa0;</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">Union</td>
<td class="org-left">(myS1 UNION myS2)</td>
<td class="org-left">{1,2,'B','C'}</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">myS1.union(myS2)</td>
<td class="org-left">{1,2,'B','C'}</td>
</tr>

<tr>
<td class="org-left">Intersection</td>
<td class="org-left">myS1 &amp; myS2</td>
<td class="org-left">{1,'C'}</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">myS1.intersection(myS2)</td>
<td class="org-left">{1,'C'}</td>
</tr>

<tr>
<td class="org-left">difference</td>
<td class="org-left">myS1 - myS2</td>
<td class="org-left">{2}</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">myS1.difference(myS2)</td>
<td class="org-left">{2}</td>
</tr>

<tr>
<td class="org-left">symmetric_difference</td>
<td class="org-left">myS1.symmetric_difference(myS2)</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">remove</td>
<td class="org-left">myS1.remove(1)</td>
<td class="org-left">{2,3}</td>
</tr>

<tr>
<td class="org-left">discard(no exception rised)</td>
<td class="org-left">myS1.discarde(3)</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">issubset</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">issuperset</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
</table>
</div>
</div>
</div>
<div id="outline-container-org1a2e8af" class="outline-3">
<h3 id="org1a2e8af">Type Conversions</h3>
<div class="outline-text-3" id="text-org1a2e8af">
</div>
<div id="outline-container-org1e19867" class="outline-4">
<h4 id="org1e19867">tub2list</h4>
<div class="outline-text-4" id="text-org1e19867">
<div class="org-src-container">
<pre class="src src-python"><span style="color: #715ab1;">tup1</span> = <span style="color: #3a81c3;">()</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-orgaeb3fb4" class="outline-4">
<h4 id="orgaeb3fb4">list2Str</h4>
<div class="outline-text-4" id="text-orgaeb3fb4">
<div class="org-src-container">
<pre class="src src-python"><span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">Converting a list to str</span>

<span style="color: #715ab1;">mylist</span> = <span style="color: #3a81c3;">[</span><span style="color: #2d9574;">"a"</span>, <span style="color: #2d9574;">"b"</span>,<span style="color: #2d9574;">"c"</span>,<span style="color: #2d9574;">"d"</span><span style="color: #3a81c3;">]</span>
<span style="color: #715ab1;">newString</span> = <span style="color: #2d9574;">""</span>
<span style="color: #2aa1ae; background-color: #ecf3ec;">#</span>
<span style="color: #3a81c3; font-weight: bold;">for</span> c <span style="color: #3a81c3; font-weight: bold;">in</span> mylist:
                <span style="color: #715ab1;">newString</span> = c + <span style="color: #2d9574;">"."</span>
<span style="color: #3a81c3;">print</span><span style="color: #3a81c3;">(</span>newString<span style="color: #3a81c3;">)</span>
<span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">OR </span>
<span style="color: #715ab1;">newString1</span> = <span style="color: #2d9574;">"."</span>.join<span style="color: #3a81c3;">(</span>mylist<span style="color: #3a81c3;">)</span>
<span style="color: #3a81c3;">print</span><span style="color: #3a81c3;">(</span>newString1<span style="color: #3a81c3;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org73e7b83" class="outline-4">
<h4 id="org73e7b83">tubles2set</h4>
<div class="outline-text-4" id="text-org73e7b83">
<div class="org-src-container">
<pre class="src src-python"><span style="color: #2aa1ae; background-color: #ecf3ec;">##### </span><span style="color: #2aa1ae; background-color: #ecf3ec;">details visit #set-objects</span>

<span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">even = set(range(0, 40, 2))</span>
<span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">print(even)</span>
<span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">squares_tuple = (4, 6, 9, 16, 25)</span>
<span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">squares = set(squares_tuple)</span>
<span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">print(squares)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org5810eb9" class="outline-4">
<h4 id="org5810eb9">Conversion tubles2dic</h4>
<div class="outline-text-4" id="text-org5810eb9">
<div class="org-src-container">
<pre class="src src-python"><span style="color: #715ab1;">fruit_keys</span> = fruit.keys<span style="color: #3a81c3;">()</span>
<span style="color: #3a81c3;">print</span><span style="color: #3a81c3;">(</span>fruit_keys<span style="color: #3a81c3;">)</span>

<span style="color: #715ab1;">fruit_list</span> = fruit.items<span style="color: #3a81c3;">()</span>                      <span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">Convert dic to list containing tuples ( key, value )</span>
<span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">[('lime', 'a sour, green citrus fruit'), ('apple', 'good for making cider') .....etc ]</span>

<span style="color: #715ab1;">fruit_tup</span> = <span style="color: #3a81c3;">tuple</span><span style="color: #3a81c3;">(</span>fruit.items<span style="color: #6c3163;">()</span><span style="color: #3a81c3;">)</span>        <span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">Convert dic to tuples containing tuples (key, value)</span>
<span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">(  ('lime', 'a sour, green citrus fruit'), ('apple', 'good for making cider') .....etc )</span>

<span style="color: #715ab1;">fruit_dic2</span> = <span style="color: #3a81c3;">dict</span><span style="color: #3a81c3;">(</span> fruit_tup<span style="color: #3a81c3;">)</span>           <span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">Convert tuple to dic</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org669b82d" class="outline-4">
<h4 id="org669b82d">String2int</h4>
<div class="outline-text-4" id="text-org669b82d">
<div class="org-src-container">
<pre class="src src-python"><span style="color: #715ab1;">a</span> = <span style="color: #2d9574;">'123'</span>
<span style="color: #715ab1;">b</span> = <span style="color: #3a81c3;">int</span><span style="color: #3a81c3;">(</span>a<span style="color: #3a81c3;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-orgffd58a8" class="outline-4">
<h4 id="orgffd58a8">str2float</h4>
<div class="outline-text-4" id="text-orgffd58a8">
<div class="org-src-container">
<pre class="src src-python"><span style="color: #715ab1;">a</span>= <span style="color: #2d9574;">'123.456'</span>
<span style="color: #715ab1;">b</span> = <span style="color: #3a81c3;">float</span><span style="color: #3a81c3;">(</span>a<span style="color: #3a81c3;">)</span>        <span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">123</span>
<span style="color: #715ab1;">c</span>= <span style="color: #3a81c3;">int</span><span style="color: #3a81c3;">(</span>a<span style="color: #3a81c3;">)</span> <span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">ValueErro: invalid literal for int() with base 10</span>
<span style="color: #715ab1;">d</span> = <span style="color: #3a81c3;">int</span><span style="color: #3a81c3;">(</span><span style="color: #3a81c3;">float</span><span style="color: #6c3163;">(</span>a<span style="color: #6c3163;">)</span><span style="color: #3a81c3;">)</span>    <span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">123</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-orgbd1ae19" class="outline-4">
<h4 id="orgbd1ae19">str2list,set,tuple</h4>
<div class="outline-text-4" id="text-orgbd1ae19">
<div class="org-src-container">
<pre class="src src-python"><span style="color: #715ab1;">a</span> = <span style="color: #2d9574;">'hello'</span>
<span style="color: #3a81c3;">list</span><span style="color: #3a81c3;">(</span>a<span style="color: #3a81c3;">)</span>      <span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">['h', 'e','l','l','o']</span>
<span style="color: #3a81c3;">set</span><span style="color: #3a81c3;">(</span>a<span style="color: #3a81c3;">)</span>       <span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">{'h', 'e','l','l','o'}</span>
<span style="color: #3a81c3;">tuple</span><span style="color: #3a81c3;">(</span>a<span style="color: #3a81c3;">)</span>     <span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">('h', 'e','l','l','o')</span>
</pre>
</div>
</div>
</div>
</div>
