python.org
** Sort 
#+begin_src python
li = [9,1,8,2,5,4,6,3,7]
s_li = sorted (li, reverse=True)

print('Sorted Variable: \t', s_li)
li.sort(reverse=True)
print('Orignial Variable:\t',li)

# Tuple 
tup = (9,1,8,1,7,3,6,4,5)
s_tup = sorted (tup)

print ('Tuple\t' , s_tup)


# Dictionary 
di  = {'name' : 'Corey', 'job': 'programming', 'age': None , 'os': 'Mint'}
s_di = sort(di)
pritn('Dict\t', s_di)

# sort number based on absolute value 
li = [-6,-5,-4,1,2,3]
print(li,key=abs)


# Sort class
class Employee():
   def __init__(self, name, age, salary):
           self.name = name
           self.age = age
           self.salary= salary
   def __repr__(self):
          return '({},{},${})'.formate(selft.name, self.age, self.salary)
e1 = Employee('Carl',37, 70000)
e2 = Employee('Sarah',29, 8000)
e3 = Employee('John',43, 9000)

employees = [e1,e2,e3]

# s_employees = soreted(employee) # gives error

def e_sort(emp):
   return emp.name
#   return emp.age
#   return emp.salary

s_employees = sorted(employees, key=e_sort)
s_employees = sorted(employees, key=e_sort, reverse= True)


# Usingg lambda there is no need of e_sort function

s_employees = sorted(employees, key=lamdba e: e.name, reverse= True)
s_employees = 
print(s_employees)


# Sorting using operator and attrgetter

from operator import attrgetter

e1 = Employee('Carl', 37, 70000)
e2 = Employee('Sarah', 29, 8000)
e3 =  Employee('John', 43,9000)

employees = [e1,e2,e3]


s_employees = soreted(employees, key= attrgetter('age'))
print(s_employees)
#+end_src
* Data Binding
#+BEGIN_SRC python
# List iniciallization

list_1 = []			# empty list
list_2 = list()		# empty list

###############################
	# Data Binding
###############################

even1  = [2, 4, 6, 8]
even2 = even1		# >>> even2 is even1		>>> True

print(even2 is even1)
even2.sort(reverse=True)
print(even)
# Changes done in even2 will change even1 vic versa, this is called Data Binding




x1= [1,2,3,4,5,6,90,1,54,78,6,34]
print(x1)
x1.sort() # .sort doestnot create a new list (obj) but change the existing list
print(x1)

#+END_SRC

* Flow Control
*** if elif else 
**** syntax
#+BEGIN_SRC python
  if condition1:
      statement
      statement
  elif condition2:
      statement
      statement
  else:
      statement
      statement

#+END_SRC
