python.html
<div id="outline-container-orgde5fc04" class="outline-3">
<h3 id="orgde5fc04">Sort</h3>
<div class="outline-text-3" id="text-orgde5fc04">
<div class="org-src-container">
<pre class="src src-python"><span style="color: #715ab1;">li</span> = <span style="color: #3a81c3;">[</span>9,1,8,2,5,4,6,3,7<span style="color: #3a81c3;">]</span>
<span style="color: #715ab1;">s_li</span> = <span style="color: #3a81c3;">sorted</span> <span style="color: #3a81c3;">(</span>li, reverse=<span style="color: #4e3163;">True</span><span style="color: #3a81c3;">)</span>

<span style="color: #3a81c3;">print</span><span style="color: #3a81c3;">(</span><span style="color: #2d9574;">'Sorted Variable: </span><span style="color: #4e3163;">\t</span><span style="color: #2d9574;">'</span>, s_li<span style="color: #3a81c3;">)</span>
li.sort<span style="color: #3a81c3;">(</span>reverse=<span style="color: #4e3163;">True</span><span style="color: #3a81c3;">)</span>
<span style="color: #3a81c3;">print</span><span style="color: #3a81c3;">(</span><span style="color: #2d9574;">'Orignial Variable:</span><span style="color: #4e3163;">\t</span><span style="color: #2d9574;">'</span>,li<span style="color: #3a81c3;">)</span>

<span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">Tuple </span>
<span style="color: #715ab1;">tup</span> = <span style="color: #3a81c3;">(</span>9,1,8,1,7,3,6,4,5<span style="color: #3a81c3;">)</span>
<span style="color: #715ab1;">s_tup</span> = <span style="color: #3a81c3;">sorted</span> <span style="color: #3a81c3;">(</span>tup<span style="color: #3a81c3;">)</span>

<span style="color: #3a81c3;">print</span> <span style="color: #3a81c3;">(</span><span style="color: #2d9574;">'Tuple</span><span style="color: #4e3163;">\t</span><span style="color: #2d9574;">'</span> , s_tup<span style="color: #3a81c3;">)</span>


<span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">Dictionary </span>
<span style="color: #715ab1;">di</span>  = <span style="color: #3a81c3;">{</span><span style="color: #2d9574;">'name'</span> : <span style="color: #2d9574;">'Corey'</span>, <span style="color: #2d9574;">'job'</span>: <span style="color: #2d9574;">'programming'</span>, <span style="color: #2d9574;">'age'</span>: <span style="color: #4e3163;">None</span> , <span style="color: #2d9574;">'os'</span>: <span style="color: #2d9574;">'Mint'</span><span style="color: #3a81c3;">}</span>
<span style="color: #715ab1;">s_di</span> = sort<span style="color: #3a81c3;">(</span>di<span style="color: #3a81c3;">)</span>
pritn<span style="color: #3a81c3;">(</span><span style="color: #2d9574;">'Dict</span><span style="color: #4e3163;">\t</span><span style="color: #2d9574;">'</span>, s_di<span style="color: #3a81c3;">)</span>

<span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">sort number based on absolute value </span>
<span style="color: #715ab1;">li</span> = <span style="color: #3a81c3;">[</span>-6,-5,-4,1,2,3<span style="color: #3a81c3;">]</span>
<span style="color: #3a81c3;">print</span><span style="color: #3a81c3;">(</span>li,key=<span style="color: #3a81c3;">abs</span><span style="color: #3a81c3;">)</span>


<span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">Sort class</span>
<span style="color: #3a81c3; font-weight: bold;">class</span> <span style="color: #ba2f59; font-weight: bold;">Employee</span><span style="color: #3a81c3;">()</span>:
   <span style="color: #3a81c3; font-weight: bold;">def</span> <span style="color: #6c3163; font-weight: bold;">__init__</span><span style="color: #3a81c3;">(</span><span style="color: #3a81c3; font-weight: bold;">self</span>, name, age, salary<span style="color: #3a81c3;">)</span>:
           <span style="color: #3a81c3; font-weight: bold;">self</span>.<span style="color: #715ab1;">name</span> = name
           <span style="color: #3a81c3; font-weight: bold;">self</span>.<span style="color: #715ab1;">age</span> = age
           <span style="color: #3a81c3; font-weight: bold;">self</span>.<span style="color: #715ab1;">salary</span>= salary
   <span style="color: #3a81c3; font-weight: bold;">def</span> <span style="color: #6c3163; font-weight: bold;">__repr__</span><span style="color: #3a81c3;">(</span><span style="color: #3a81c3; font-weight: bold;">self</span><span style="color: #3a81c3;">)</span>:
          <span style="color: #3a81c3; font-weight: bold;">return</span> <span style="color: #2d9574;">'({},{},${})'</span>.formate<span style="color: #3a81c3;">(</span>selft.name, <span style="color: #3a81c3; font-weight: bold;">self</span>.age, <span style="color: #3a81c3; font-weight: bold;">self</span>.salary<span style="color: #3a81c3;">)</span>
<span style="color: #715ab1;">e1</span> = Employee<span style="color: #3a81c3;">(</span><span style="color: #2d9574;">'Carl'</span>,37, 70000<span style="color: #3a81c3;">)</span>
<span style="color: #715ab1;">e2</span> = Employee<span style="color: #3a81c3;">(</span><span style="color: #2d9574;">'Sarah'</span>,29, 8000<span style="color: #3a81c3;">)</span>
<span style="color: #715ab1;">e3</span> = Employee<span style="color: #3a81c3;">(</span><span style="color: #2d9574;">'John'</span>,43, 9000<span style="color: #3a81c3;">)</span>

<span style="color: #715ab1;">employees</span> = <span style="color: #3a81c3;">[</span>e1,e2,e3<span style="color: #3a81c3;">]</span>

<span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">s_employees = soreted(employee) # gives error</span>

<span style="color: #3a81c3; font-weight: bold;">def</span> <span style="color: #6c3163; font-weight: bold;">e_sort</span><span style="color: #3a81c3;">(</span>emp<span style="color: #3a81c3;">)</span>:
   <span style="color: #3a81c3; font-weight: bold;">return</span> emp.name
<span style="color: #2aa1ae; background-color: #ecf3ec;">#   </span><span style="color: #2aa1ae; background-color: #ecf3ec;">return emp.age</span>
<span style="color: #2aa1ae; background-color: #ecf3ec;">#   </span><span style="color: #2aa1ae; background-color: #ecf3ec;">return emp.salary</span>

<span style="color: #715ab1;">s_employees</span> = <span style="color: #3a81c3;">sorted</span><span style="color: #3a81c3;">(</span>employees, key=e_sort<span style="color: #3a81c3;">)</span>
<span style="color: #715ab1;">s_employees</span> = <span style="color: #3a81c3;">sorted</span><span style="color: #3a81c3;">(</span>employees, key=e_sort, reverse= <span style="color: #4e3163;">True</span><span style="color: #3a81c3;">)</span>


<span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">Usingg lambda there is no need of e_sort function</span>

<span style="color: #715ab1;">s_employees</span> = <span style="color: #3a81c3;">sorted</span><span style="color: #3a81c3;">(</span>employees, key=lamdba e: e.name, reverse= <span style="color: #4e3163;">True</span><span style="color: #3a81c3;">)</span>
<span style="color: #715ab1;">s_employees</span> = 
<span style="color: #3a81c3;">print</span><span style="color: #3a81c3;">(</span>s_employees<span style="color: #3a81c3;">)</span>


<span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">Sorting using operator and attrgetter</span>

<span style="color: #3a81c3; font-weight: bold;">from</span> operator <span style="color: #3a81c3; font-weight: bold;">import</span> attrgetter

<span style="color: #715ab1;">e1</span> = Employee<span style="color: #3a81c3;">(</span><span style="color: #2d9574;">'Carl'</span>, 37, 70000<span style="color: #3a81c3;">)</span>
<span style="color: #715ab1;">e2</span> = Employee<span style="color: #3a81c3;">(</span><span style="color: #2d9574;">'Sarah'</span>, 29, 8000<span style="color: #3a81c3;">)</span>
<span style="color: #715ab1;">e3</span> =  Employee<span style="color: #3a81c3;">(</span><span style="color: #2d9574;">'John'</span>, 43,9000<span style="color: #3a81c3;">)</span>

<span style="color: #715ab1;">employees</span> = <span style="color: #3a81c3;">[</span>e1,e2,e3<span style="color: #3a81c3;">]</span>


<span style="color: #715ab1;">s_employees</span> = soreted<span style="color: #3a81c3;">(</span>employees, key= attrgetter<span style="color: #6c3163;">(</span><span style="color: #2d9574;">'age'</span><span style="color: #6c3163;">)</span><span style="color: #3a81c3;">)</span>
<span style="color: #3a81c3;">print</span><span style="color: #3a81c3;">(</span>s_employees<span style="color: #3a81c3;">)</span>
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-org4f5ee80" class="outline-2">
<h2 id="org4f5ee80">Data Binding</h2>
<div class="outline-text-2" id="text-org4f5ee80">
<div class="org-src-container">
<pre class="src src-python"><span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">List iniciallization</span>

<span style="color: #715ab1;">list_1</span> = <span style="color: #3a81c3;">[]</span>                     <span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">empty list</span>
<span style="color: #715ab1;">list_2</span> = <span style="color: #3a81c3;">list</span><span style="color: #3a81c3;">()</span>         <span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">empty list</span>

<span style="color: #2aa1ae; background-color: #ecf3ec;">###############################</span>
        <span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">Data Binding</span>
<span style="color: #2aa1ae; background-color: #ecf3ec;">###############################</span>

<span style="color: #715ab1;">even1</span>  = <span style="color: #3a81c3;">[</span>2, 4, 6, 8<span style="color: #3a81c3;">]</span>
<span style="color: #715ab1;">even2</span> = even1           <span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">&gt;&gt;&gt; even2 is even1            &gt;&gt;&gt; True</span>

<span style="color: #3a81c3;">print</span><span style="color: #3a81c3;">(</span>even2 <span style="color: #3a81c3; font-weight: bold;">is</span> even1<span style="color: #3a81c3;">)</span>
even2.sort<span style="color: #3a81c3;">(</span>reverse=<span style="color: #4e3163;">True</span><span style="color: #3a81c3;">)</span>
<span style="color: #3a81c3;">print</span><span style="color: #3a81c3;">(</span>even<span style="color: #3a81c3;">)</span>
<span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">Changes done in even2 will change even1 vic versa, this is called Data Binding</span>




<span style="color: #715ab1;">x1</span>= <span style="color: #3a81c3;">[</span>1,2,3,4,5,6,90,1,54,78,6,34<span style="color: #3a81c3;">]</span>
<span style="color: #3a81c3;">print</span><span style="color: #3a81c3;">(</span>x1<span style="color: #3a81c3;">)</span>
x1.sort<span style="color: #3a81c3;">()</span> <span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">.sort doestnot create a new list (obj) but change the existing list</span>
<span style="color: #3a81c3;">print</span><span style="color: #3a81c3;">(</span>x1<span style="color: #3a81c3;">)</span>

</pre>
</div>
</div>
</div>
<div id="outline-container-org4ba79ca" class="outline-2">
<h2 id="org4ba79ca">Flow Control</h2>
<div class="outline-text-2" id="text-org4ba79ca">
</div>
<div id="outline-container-org48b9fe7" class="outline-4">
<h4 id="org48b9fe7">if elif else</h4>
<div class="outline-text-4" id="text-org48b9fe7">
</div>
<ul class="org-ul">
<li><a id="orgef175ce"></a>syntax<br />
<div class="outline-text-5" id="text-orgef175ce">
<div class="org-src-container">
<pre class="src src-python"><span style="color: #3a81c3; font-weight: bold;">if</span> condition1:
    statement
    statement
<span style="color: #3a81c3; font-weight: bold;">elif</span> condition2:
    statement
    statement
<span style="color: #3a81c3; font-weight: bold;">else</span>:
    statement
    statement

</pre>
</div>
</div>
</li>
