python.org
**** Eg 1
#+BEGIN_SRC python
  name  = input("Please enter your name ")
  age = int(input("How old are you {0}".format(name)))
 
  print(age)

  if (age<16):
      print("You are not eligible to vote Come back after {0} years".format(18-age))
  elif (16<=age<66):
      print("You are eligible to vote")
  else :
      print("Enter age in whole no")
#+END_SRC
**** Eg 2
#+BEGIN_SRC python
if True:
	print("if allow True")

x = 12
if x:
	print("if allow int ")
else:
	print("if not allow int")


x = 12.65
if x:
	print("if allow float ")
else:
	print("if not allow float")

x = "it is string"
if x:
	print("if allow string ")
else:
	print("if not allow string")

if False:
	print("if allow False")
else:
	print("if not allow False")

x = None
if x:
	print("if allow None ")
else:
	print("if not allow None")

print(not False)
print(not True)
#+END_SRC
*** Loop
**** while
***** Eg 01
#+BEGIN_SRC python
valid_ip = ["north", "south", "east", "west"]
give_ip =""
while give_ip is not valid_ip:
	give_ip = input("Enter the Direction: ")
      # execute statement




#+END_SRC
**** for
***** Eg
#+BEGIN_SRC python
str = ['i','am','a','programmer', 'in','python']
for i in str:
	print(i,end=" ")	# >>> i am a programmer in python
	if i=="a":
		continue		# >>> i am programmer in python
		# break			# >>> i am
	print("\n")
	print(i,end=" ")

nums = [1,2,3,4,5]

for num in nums :
   if num ==3:
      print('Found!')
      continue
   print(num)

# output : 1,2, Found!,4,5


for letter in 'abc':
    print(num, letter)

for i in range(10):  # range(1,11)
    print(i)

#+END_SRC

**** for loop by iterating by sequencec index
#+BEGIN_SRC python
str = "123456789"

# for char in str:
# 	print(char)

# iter_my = iter(str)
#
# print(iter_my)
# print(next(iter_my))
# print(next(iter_my))
# print(next(iter_my))
# print(next(iter_my))
# print(next(iter_my))
# print(next(iter_my))
# print(next(iter_my))
# print(next(iter_my))
# print(next(iter_my))


# or we can use for

for char in iter(str):
	print(char)
#+END_SRC
*** Flow control :
**** continue
**** break
