python.html
<li><a id="org5bb8f57"></a>Eg 1<br />
<div class="outline-text-5" id="text-org5bb8f57">
<div class="org-src-container">
<pre class="src src-python"><span style="color: #715ab1;">name</span>  = <span style="color: #3a81c3;">input</span><span style="color: #3a81c3;">(</span><span style="color: #2d9574;">"Please enter your name "</span><span style="color: #3a81c3;">)</span>
<span style="color: #715ab1;">age</span> = <span style="color: #3a81c3;">int</span><span style="color: #3a81c3;">(</span><span style="color: #3a81c3;">input</span><span style="color: #6c3163;">(</span><span style="color: #2d9574;">"How old are you {0}"</span>.<span style="color: #3a81c3;">format</span><span style="color: #2d9574;">(</span>name<span style="color: #2d9574;">)</span><span style="color: #6c3163;">)</span><span style="color: #3a81c3;">)</span>

<span style="color: #3a81c3;">print</span><span style="color: #3a81c3;">(</span>age<span style="color: #3a81c3;">)</span>

<span style="color: #3a81c3; font-weight: bold;">if</span> <span style="color: #3a81c3;">(</span>age&lt;16<span style="color: #3a81c3;">)</span>:
    <span style="color: #3a81c3;">print</span><span style="color: #3a81c3;">(</span><span style="color: #2d9574;">"You are not eligible to vote Come back after {0} years"</span>.<span style="color: #3a81c3;">format</span><span style="color: #6c3163;">(</span>18-age<span style="color: #6c3163;">)</span><span style="color: #3a81c3;">)</span>
<span style="color: #3a81c3; font-weight: bold;">elif</span> <span style="color: #3a81c3;">(</span>16&lt;=age&lt;66<span style="color: #3a81c3;">)</span>:
    <span style="color: #3a81c3;">print</span><span style="color: #3a81c3;">(</span><span style="color: #2d9574;">"You are eligible to vote"</span><span style="color: #3a81c3;">)</span>
<span style="color: #3a81c3; font-weight: bold;">else</span> :
    <span style="color: #3a81c3;">print</span><span style="color: #3a81c3;">(</span><span style="color: #2d9574;">"Enter age in whole no"</span><span style="color: #3a81c3;">)</span>
</pre>
</div>
</div>
</li>
<li><a id="org09f2cab"></a>Eg 2<br />
<div class="outline-text-5" id="text-org09f2cab">
<div class="org-src-container">
<pre class="src src-python"><span style="color: #3a81c3; font-weight: bold;">if</span> <span style="color: #4e3163;">True</span>:
        <span style="color: #3a81c3;">print</span><span style="color: #3a81c3;">(</span><span style="color: #2d9574;">"if allow True"</span><span style="color: #3a81c3;">)</span>

<span style="color: #715ab1;">x</span> = 12
<span style="color: #3a81c3; font-weight: bold;">if</span> x:
        <span style="color: #3a81c3;">print</span><span style="color: #3a81c3;">(</span><span style="color: #2d9574;">"if allow int "</span><span style="color: #3a81c3;">)</span>
<span style="color: #3a81c3; font-weight: bold;">else</span>:
        <span style="color: #3a81c3;">print</span><span style="color: #3a81c3;">(</span><span style="color: #2d9574;">"if not allow int"</span><span style="color: #3a81c3;">)</span>


<span style="color: #715ab1;">x</span> = 12.65
<span style="color: #3a81c3; font-weight: bold;">if</span> x:
        <span style="color: #3a81c3;">print</span><span style="color: #3a81c3;">(</span><span style="color: #2d9574;">"if allow float "</span><span style="color: #3a81c3;">)</span>
<span style="color: #3a81c3; font-weight: bold;">else</span>:
        <span style="color: #3a81c3;">print</span><span style="color: #3a81c3;">(</span><span style="color: #2d9574;">"if not allow float"</span><span style="color: #3a81c3;">)</span>

<span style="color: #715ab1;">x</span> = <span style="color: #2d9574;">"it is string"</span>
<span style="color: #3a81c3; font-weight: bold;">if</span> x:
        <span style="color: #3a81c3;">print</span><span style="color: #3a81c3;">(</span><span style="color: #2d9574;">"if allow string "</span><span style="color: #3a81c3;">)</span>
<span style="color: #3a81c3; font-weight: bold;">else</span>:
        <span style="color: #3a81c3;">print</span><span style="color: #3a81c3;">(</span><span style="color: #2d9574;">"if not allow string"</span><span style="color: #3a81c3;">)</span>

<span style="color: #3a81c3; font-weight: bold;">if</span> <span style="color: #4e3163;">False</span>:
        <span style="color: #3a81c3;">print</span><span style="color: #3a81c3;">(</span><span style="color: #2d9574;">"if allow False"</span><span style="color: #3a81c3;">)</span>
<span style="color: #3a81c3; font-weight: bold;">else</span>:
        <span style="color: #3a81c3;">print</span><span style="color: #3a81c3;">(</span><span style="color: #2d9574;">"if not allow False"</span><span style="color: #3a81c3;">)</span>

<span style="color: #715ab1;">x</span> = <span style="color: #4e3163;">None</span>
<span style="color: #3a81c3; font-weight: bold;">if</span> x:
        <span style="color: #3a81c3;">print</span><span style="color: #3a81c3;">(</span><span style="color: #2d9574;">"if allow None "</span><span style="color: #3a81c3;">)</span>
<span style="color: #3a81c3; font-weight: bold;">else</span>:
        <span style="color: #3a81c3;">print</span><span style="color: #3a81c3;">(</span><span style="color: #2d9574;">"if not allow None"</span><span style="color: #3a81c3;">)</span>

<span style="color: #3a81c3;">print</span><span style="color: #3a81c3;">(</span><span style="color: #3a81c3; font-weight: bold;">not</span> <span style="color: #4e3163;">False</span><span style="color: #3a81c3;">)</span>
<span style="color: #3a81c3;">print</span><span style="color: #3a81c3;">(</span><span style="color: #3a81c3; font-weight: bold;">not</span> <span style="color: #4e3163;">True</span><span style="color: #3a81c3;">)</span>
</pre>
</div>
</div>
</li>
</ul>
</div>
<div id="outline-container-orgafd70cd" class="outline-4">
<h4 id="orgafd70cd">Loop</h4>
<div class="outline-text-4" id="text-orgafd70cd">
</div>
<ul class="org-ul">
<li><a id="org44e4c82"></a>while<br />
<ul class="org-ul">
<li><a id="org1f0a924"></a>Eg 01<br />
<div class="outline-text-6" id="text-org1f0a924">
<div class="org-src-container">
<pre class="src src-python"><span style="color: #715ab1;">valid_ip</span> = <span style="color: #3a81c3;">[</span><span style="color: #2d9574;">"north"</span>, <span style="color: #2d9574;">"south"</span>, <span style="color: #2d9574;">"east"</span>, <span style="color: #2d9574;">"west"</span><span style="color: #3a81c3;">]</span>
<span style="color: #715ab1;">give_ip</span> =<span style="color: #2d9574;">""</span>
<span style="color: #3a81c3; font-weight: bold;">while</span> give_ip <span style="color: #3a81c3; font-weight: bold;">is</span> <span style="color: #3a81c3; font-weight: bold;">not</span> valid_ip:
        <span style="color: #715ab1;">give_ip</span> = <span style="color: #3a81c3;">input</span><span style="color: #3a81c3;">(</span><span style="color: #2d9574;">"Enter the Direction: "</span><span style="color: #3a81c3;">)</span>
      <span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">execute statement</span>




</pre>
</div>
</div>
</li>
</ul>
</li>
<li><a id="org48e6902"></a>for<br />
<ul class="org-ul">
<li><a id="org5f050fb"></a>Eg<br />
<div class="outline-text-6" id="text-org5f050fb">
<div class="org-src-container">
<pre class="src src-python"><span style="color: #3a81c3;">str</span> = <span style="color: #3a81c3;">[</span><span style="color: #2d9574;">'i'</span>,<span style="color: #2d9574;">'am'</span>,<span style="color: #2d9574;">'a'</span>,<span style="color: #2d9574;">'programmer'</span>, <span style="color: #2d9574;">'in'</span>,<span style="color: #2d9574;">'python'</span><span style="color: #3a81c3;">]</span>
<span style="color: #3a81c3; font-weight: bold;">for</span> i <span style="color: #3a81c3; font-weight: bold;">in</span> <span style="color: #3a81c3;">str</span>:
        <span style="color: #3a81c3;">print</span><span style="color: #3a81c3;">(</span>i,end=<span style="color: #2d9574;">" "</span><span style="color: #3a81c3;">)</span>        <span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">&gt;&gt;&gt; i am a programmer in python</span>
        <span style="color: #3a81c3; font-weight: bold;">if</span> i==<span style="color: #2d9574;">"a"</span>:
                <span style="color: #3a81c3; font-weight: bold;">continue</span>                <span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">&gt;&gt;&gt; i am programmer in python</span>
                <span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">break                 # &gt;&gt;&gt; i am</span>
        <span style="color: #3a81c3;">print</span><span style="color: #3a81c3;">(</span><span style="color: #2d9574;">"</span><span style="color: #4e3163;">\n</span><span style="color: #2d9574;">"</span><span style="color: #3a81c3;">)</span>
        <span style="color: #3a81c3;">print</span><span style="color: #3a81c3;">(</span>i,end=<span style="color: #2d9574;">" "</span><span style="color: #3a81c3;">)</span>

<span style="color: #715ab1;">nums</span> = <span style="color: #3a81c3;">[</span>1,2,3,4,5<span style="color: #3a81c3;">]</span>

<span style="color: #3a81c3; font-weight: bold;">for</span> num <span style="color: #3a81c3; font-weight: bold;">in</span> nums :
   <span style="color: #3a81c3; font-weight: bold;">if</span> num ==3:
      <span style="color: #3a81c3;">print</span><span style="color: #3a81c3;">(</span><span style="color: #2d9574;">'Found!'</span><span style="color: #3a81c3;">)</span>
      <span style="color: #3a81c3; font-weight: bold;">continue</span>
   <span style="color: #3a81c3;">print</span><span style="color: #3a81c3;">(</span>num<span style="color: #3a81c3;">)</span>

<span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">output : 1,2, Found!,4,5</span>


<span style="color: #3a81c3; font-weight: bold;">for</span> letter <span style="color: #3a81c3; font-weight: bold;">in</span> <span style="color: #2d9574;">'abc'</span>:
    <span style="color: #3a81c3;">print</span><span style="color: #3a81c3;">(</span>num, letter<span style="color: #3a81c3;">)</span>

<span style="color: #3a81c3; font-weight: bold;">for</span> i <span style="color: #3a81c3; font-weight: bold;">in</span> <span style="color: #3a81c3;">range</span><span style="color: #3a81c3;">(</span>10<span style="color: #3a81c3;">)</span>:  <span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">range(1,11)</span>
    <span style="color: #3a81c3;">print</span><span style="color: #3a81c3;">(</span>i<span style="color: #3a81c3;">)</span>

</pre>
</div>
</div>
</li>
</ul>
</li>
<li><a id="org836b379"></a>for loop by iterating by sequencec index<br />
<div class="outline-text-5" id="text-org836b379">
<div class="org-src-container">
<pre class="src src-python"><span style="color: #3a81c3;">str</span> = <span style="color: #2d9574;">"123456789"</span>

<span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">for char in str:</span>
<span style="color: #2aa1ae; background-color: #ecf3ec;">#       </span><span style="color: #2aa1ae; background-color: #ecf3ec;">print(char)</span>

<span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">iter_my = iter(str)</span>
<span style="color: #2aa1ae; background-color: #ecf3ec;">#</span>
<span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">print(iter_my)</span>
<span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">print(next(iter_my))</span>
<span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">print(next(iter_my))</span>
<span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">print(next(iter_my))</span>
<span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">print(next(iter_my))</span>
<span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">print(next(iter_my))</span>
<span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">print(next(iter_my))</span>
<span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">print(next(iter_my))</span>
<span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">print(next(iter_my))</span>
<span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">print(next(iter_my))</span>


<span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">or we can use for</span>

<span style="color: #3a81c3; font-weight: bold;">for</span> char <span style="color: #3a81c3; font-weight: bold;">in</span> <span style="color: #3a81c3;">iter</span><span style="color: #3a81c3;">(</span><span style="color: #3a81c3;">str</span><span style="color: #3a81c3;">)</span>:
        <span style="color: #3a81c3;">print</span><span style="color: #3a81c3;">(</span>char<span style="color: #3a81c3;">)</span>
</pre>
</div>
</div>
</li>
</ul>
</div>
