python.org
* Loop
#+begin_src python
courses = ['History','Math', 'Physics', 'ComSci']

for index, course in enumerate(course, start =1) :
    print(index,course)

student = {'name':'John', 'age' :25, 'courses': ['Math', 'CompSci']}
 
for key, value in student.items():
    print (key, value) 


#+end_src
* Comprehension

** If-else Comprehension 
#+BEGIN_SRC python
# without Comprehension
if 'summary' in mykeys:
    temp_dic.update({'summary':item['summary']})
else:
    temp_dic.update({'summary':''})

# with Comprehension
temp_dic.update({'summary':item['summary']}) if 'summary' in mykeys else temp_dic.update({'summary':''})
#+END_SRC

** List Comprehension
#+BEGIN_SRC python
my_list = [1,2,3,4,5,6,7,8,9,10]

# using for loop

my_list =[]
for n in nums:
  my_list.append(n*n)

print(my_list)
#+END_SRC

lambda 
#+BEGIN_SRC python
# using list comprahession
my_list = [n for n in nums]
print(my_list)

my_list[n*n for n in nums]
print(my_list)

# using map + lambda

my_list = map(lambda n: n*n, nums)

print(my_list)
#+END_SRC

#+BEGIN_SRC python
# Using for  even list 
my_list =[]
for n in nums:
  if n%2==0:
     my_list.append(n)
print(my_list)

#+END_SRC

#+BEGIN_SRC python
# Using Compression

my_list[n*n for n in nums if n%2==0]
print(my_list)

# Filter + lambda 
my_list = filter(lambda  n: n%2 ==0, nums)
print(my_list)
#+END_SRC

#+BEGIN_SRC python
 # I want a (letter, num) pai for each letter in "abcd" and number in "0123"
  my_list =[]
  for letter in "abcd":
      for num in range(4):
          my_list.append((letter, num))
  print my_list

#+END_SRC

#+BEGIN_SRC python
  # Using list comprssion
  my_list = [(letter, num) for letter in "abcd" for num in rang(4)]
  print my_list
  # for matwork, andriod, vir job, jav,   ,js
#+END_SRC
** List Comprehension for dynamical create List of  integer 
#+BEGIN_SRC python
my_list = [ int(x) for x in input("Enter the integers seperated by spcae").split(" ")]
#+END_SRC

