python.html
<div id="outline-container-org04a8695" class="outline-4">
<h4 id="org04a8695">Flow control :</h4>
<div class="outline-text-4" id="text-org04a8695">
</div>
<ul class="org-ul">
<li><a id="orgfc528cd"></a>continue<br /></li>
<li><a id="org404d01f"></a>break<br /></li>
</ul>
</div>
</div>
<div id="outline-container-orga2120e6" class="outline-2">
<h2 id="orga2120e6">Loop</h2>
<div class="outline-text-2" id="text-orga2120e6">
<div class="org-src-container">
<pre class="src src-python"><span style="color: #715ab1;">courses</span> = <span style="color: #3a81c3;">[</span><span style="color: #2d9574;">'History'</span>,<span style="color: #2d9574;">'Math'</span>, <span style="color: #2d9574;">'Physics'</span>, <span style="color: #2d9574;">'ComSci'</span><span style="color: #3a81c3;">]</span>

<span style="color: #3a81c3; font-weight: bold;">for</span> index, course <span style="color: #3a81c3; font-weight: bold;">in</span> <span style="color: #3a81c3;">enumerate</span><span style="color: #3a81c3;">(</span>course, start =1<span style="color: #3a81c3;">)</span> :
    <span style="color: #3a81c3;">print</span><span style="color: #3a81c3;">(</span>index,course<span style="color: #3a81c3;">)</span>

<span style="color: #715ab1;">student</span> = <span style="color: #3a81c3;">{</span><span style="color: #2d9574;">'name'</span>:<span style="color: #2d9574;">'John'</span>, <span style="color: #2d9574;">'age'</span> :25, <span style="color: #2d9574;">'courses'</span>: <span style="color: #6c3163;">[</span><span style="color: #2d9574;">'Math'</span>, <span style="color: #2d9574;">'CompSci'</span><span style="color: #6c3163;">]</span><span style="color: #3a81c3;">}</span>

<span style="color: #3a81c3; font-weight: bold;">for</span> key, value <span style="color: #3a81c3; font-weight: bold;">in</span> student.items<span style="color: #3a81c3;">()</span>:
    <span style="color: #3a81c3;">print</span> <span style="color: #3a81c3;">(</span>key, value<span style="color: #3a81c3;">)</span> 


</pre>
</div>
</div>
</div>
<div id="outline-container-org7e979c0" class="outline-2">
<h2 id="org7e979c0">Comprehension</h2>
<div class="outline-text-2" id="text-org7e979c0">
</div>
<div id="outline-container-org24a3c0e" class="outline-3">
<h3 id="org24a3c0e">If-else Comprehension</h3>
<div class="outline-text-3" id="text-org24a3c0e">
<div class="org-src-container">
<pre class="src src-python"><span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">without Comprehension</span>
<span style="color: #3a81c3; font-weight: bold;">if</span> <span style="color: #2d9574;">'summary'</span> <span style="color: #3a81c3; font-weight: bold;">in</span> mykeys:
    temp_dic.update<span style="color: #3a81c3;">(</span><span style="color: #6c3163;">{</span><span style="color: #2d9574;">'summary'</span>:item<span style="color: #2d9574;">[</span><span style="color: #2d9574;">'summary'</span><span style="color: #2d9574;">]</span><span style="color: #6c3163;">}</span><span style="color: #3a81c3;">)</span>
<span style="color: #3a81c3; font-weight: bold;">else</span>:
    temp_dic.update<span style="color: #3a81c3;">(</span><span style="color: #6c3163;">{</span><span style="color: #2d9574;">'summary'</span>:<span style="color: #2d9574;">''</span><span style="color: #6c3163;">}</span><span style="color: #3a81c3;">)</span>

<span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">with Comprehension</span>
temp_dic.update<span style="color: #3a81c3;">(</span><span style="color: #6c3163;">{</span><span style="color: #2d9574;">'summary'</span>:item<span style="color: #2d9574;">[</span><span style="color: #2d9574;">'summary'</span><span style="color: #2d9574;">]</span><span style="color: #6c3163;">}</span><span style="color: #3a81c3;">)</span> <span style="color: #3a81c3; font-weight: bold;">if</span> <span style="color: #2d9574;">'summary'</span> <span style="color: #3a81c3; font-weight: bold;">in</span> mykeys <span style="color: #3a81c3; font-weight: bold;">else</span> temp_dic.update<span style="color: #3a81c3;">(</span><span style="color: #6c3163;">{</span><span style="color: #2d9574;">'summary'</span>:<span style="color: #2d9574;">''</span><span style="color: #6c3163;">}</span><span style="color: #3a81c3;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-orge4e1225" class="outline-3">
<h3 id="orge4e1225">List Comprehension</h3>
<div class="outline-text-3" id="text-orge4e1225">
<div class="org-src-container">
<pre class="src src-python"><span style="color: #715ab1;">my_list</span> = <span style="color: #3a81c3;">[</span>1,2,3,4,5,6,7,8,9,10<span style="color: #3a81c3;">]</span>

<span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">using for loop</span>

<span style="color: #715ab1;">my_list</span> =<span style="color: #3a81c3;">[]</span>
<span style="color: #3a81c3; font-weight: bold;">for</span> n <span style="color: #3a81c3; font-weight: bold;">in</span> nums:
  my_list.append<span style="color: #3a81c3;">(</span>n*n<span style="color: #3a81c3;">)</span>

<span style="color: #3a81c3;">print</span><span style="color: #3a81c3;">(</span>my_list<span style="color: #3a81c3;">)</span>
</pre>
</div>

<p>
lambda 
</p>
<div class="org-src-container">
<pre class="src src-python"><span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">using list comprahession</span>
<span style="color: #715ab1;">my_list</span> = <span style="color: #3a81c3;">[</span>n <span style="color: #3a81c3; font-weight: bold;">for</span> n <span style="color: #3a81c3; font-weight: bold;">in</span> nums<span style="color: #3a81c3;">]</span>
<span style="color: #3a81c3;">print</span><span style="color: #3a81c3;">(</span>my_list<span style="color: #3a81c3;">)</span>

my_list<span style="color: #3a81c3;">[</span>n*n <span style="color: #3a81c3; font-weight: bold;">for</span> n <span style="color: #3a81c3; font-weight: bold;">in</span> nums<span style="color: #3a81c3;">]</span>
<span style="color: #3a81c3;">print</span><span style="color: #3a81c3;">(</span>my_list<span style="color: #3a81c3;">)</span>

<span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">using map + lambda</span>

<span style="color: #715ab1;">my_list</span> = <span style="color: #3a81c3;">map</span><span style="color: #3a81c3;">(</span><span style="color: #3a81c3; font-weight: bold;">lambda</span> n: n*n, nums<span style="color: #3a81c3;">)</span>

<span style="color: #3a81c3;">print</span><span style="color: #3a81c3;">(</span>my_list<span style="color: #3a81c3;">)</span>
</pre>
</div>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">Using for  even list </span>
<span style="color: #715ab1;">my_list</span> =<span style="color: #3a81c3;">[]</span>
<span style="color: #3a81c3; font-weight: bold;">for</span> n <span style="color: #3a81c3; font-weight: bold;">in</span> nums:
  <span style="color: #3a81c3; font-weight: bold;">if</span> n%2==0:
     my_list.append<span style="color: #3a81c3;">(</span>n<span style="color: #3a81c3;">)</span>
<span style="color: #3a81c3;">print</span><span style="color: #3a81c3;">(</span>my_list<span style="color: #3a81c3;">)</span>

</pre>
</div>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">Using Compression</span>

my_list<span style="color: #3a81c3;">[</span>n*n <span style="color: #3a81c3; font-weight: bold;">for</span> n <span style="color: #3a81c3; font-weight: bold;">in</span> nums <span style="color: #3a81c3; font-weight: bold;">if</span> n%2==0<span style="color: #3a81c3;">]</span>
<span style="color: #3a81c3;">print</span><span style="color: #3a81c3;">(</span>my_list<span style="color: #3a81c3;">)</span>

<span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">Filter + lambda </span>
<span style="color: #715ab1;">my_list</span> = <span style="color: #3a81c3;">filter</span><span style="color: #3a81c3;">(</span><span style="color: #3a81c3; font-weight: bold;">lambda</span>  n: n%2 ==0, nums<span style="color: #3a81c3;">)</span>
<span style="color: #3a81c3;">print</span><span style="color: #3a81c3;">(</span>my_list<span style="color: #3a81c3;">)</span>
</pre>
</div>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">I want a (letter, num) pai for each letter in "abcd" and number in "0123"</span>
 <span style="color: #715ab1;">my_list</span> =<span style="color: #3a81c3;">[]</span>
 <span style="color: #3a81c3; font-weight: bold;">for</span> letter <span style="color: #3a81c3; font-weight: bold;">in</span> <span style="color: #2d9574;">"abcd"</span>:
     <span style="color: #3a81c3; font-weight: bold;">for</span> num <span style="color: #3a81c3; font-weight: bold;">in</span> <span style="color: #3a81c3;">range</span><span style="color: #3a81c3;">(</span>4<span style="color: #3a81c3;">)</span>:
         my_list.append<span style="color: #3a81c3;">(</span><span style="color: #6c3163;">(</span>letter, num<span style="color: #6c3163;">)</span><span style="color: #3a81c3;">)</span>
 <span style="color: #3a81c3;">print</span> my_list

</pre>
</div>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">Using list comprssion</span>
<span style="color: #715ab1;">my_list</span> = <span style="color: #3a81c3;">[</span><span style="color: #6c3163;">(</span>letter, num<span style="color: #6c3163;">)</span> <span style="color: #3a81c3; font-weight: bold;">for</span> letter <span style="color: #3a81c3; font-weight: bold;">in</span> <span style="color: #2d9574;">"abcd"</span> <span style="color: #3a81c3; font-weight: bold;">for</span> num <span style="color: #3a81c3; font-weight: bold;">in</span> rang<span style="color: #6c3163;">(</span>4<span style="color: #6c3163;">)</span><span style="color: #3a81c3;">]</span>
<span style="color: #3a81c3;">print</span> my_list
<span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">for matwork, andriod, vir job, jav,   ,js</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-orgd23e91c" class="outline-3">
<h3 id="orgd23e91c">List Comprehension for dynamical create List of  integer</h3>
<div class="outline-text-3" id="text-orgd23e91c">
<div class="org-src-container">
<pre class="src src-python"><span style="color: #715ab1;">my_list</span> = <span style="color: #3a81c3;">[</span> <span style="color: #3a81c3;">int</span><span style="color: #6c3163;">(</span>x<span style="color: #6c3163;">)</span> <span style="color: #3a81c3; font-weight: bold;">for</span> x <span style="color: #3a81c3; font-weight: bold;">in</span> <span style="color: #3a81c3;">input</span><span style="color: #6c3163;">(</span><span style="color: #2d9574;">"Enter the integers seperated by spcae"</span><span style="color: #6c3163;">)</span>.split<span style="color: #6c3163;">(</span><span style="color: #2d9574;">" "</span><span style="color: #6c3163;">)</span><span style="color: #3a81c3;">]</span>
</pre>
</div>
</div>
</div>
