python.org
** Dictitionary Comprehension
#+begin_src python
nums = [1,2,3,4,5,6,7,8,910]

# Dictionary Comprehension
names = ['Bruce', 'Clark', 'Peter', 'Logan', 'Wade']
heros = ['Batman','Superman', 'Spiderman', 'Wolverine', 'Deadpool']
print zip (name, heros)
# [(Bruce, Batman), ('Clark','Superman'), ('Peter', 'Spiderman'), ('Logan', 'Wolverine'), ('Wade,'Deadpool')]

# with out list comprehension
my_dict = {}
for name, hero in zip(name, heros):
   my_dict [name] = hero
print my_dict

my_dict = {name : hero for name, hero in zip(name,heros) if name != 'peter'}
print my_dict


#
#+end_src
** Set Comprehension 
nums = [1,2,3,4,5,6,7,8,9,10]
#+begin_src python
# Set Comprehension 
nums = [1,1,2,1,3,4,3,4,55,6,7,9,9]
my_set = set()
for n in nums:
    my_set.add(n)
print(my_set)

my_set = {n for n in nums} 
#+end_src
** Generator Expression 
#+begin_src python
nums = [1,2,3,4,5,6,7,8,9,10]

def gen_func(nums):
   for n in nums
        yield n*n

my_gen = my_gen_func(nums)

for i in my_gen:
   print i

for i in my_gen:
   print i

# Generator using list Comprehension

my_nums = (x*x for x in [1,2,3,4,5])

for my_num in my_nums :
    print(my_num)


#+end_src
* Keyboard Input:
python3 has build-in function =input()= to read input data from standard input(sys.stdin)

python2 has  =raw_input= is deprecated
Why ?
 raw_input is used to receive only  string input, and reading digit is not possible to remove this raw_input is deprecated 
#+BEGIN_SRC python
name = input("Give Input to python ")
print("Given input is : "+ name)
#+END_SRC
* Function
Predefine
Use define
*** Syntax
#+BEGIN_SRC python
  # Function Defination
  def func_name (arg1,arg2,.......):   # arg1,agr2...  are formal arg
      statements
      return[expression]

  # Function Call
  func_name(x,y,.......)              # x,y...... are actual arg
#+END_SRC
*** Pass by Reference
Call by reference : sends the address(ref) of =actual arg= to =formal arg=
Python uses pass by reference 
we can check by finding if of actual arg and formal arg are same
*** Pass by Value
Python does not uses pass by value
Call by value : send the value of =actual arg= to =formal arg= 
*** argument
**** required arg
Python check no of formal arg = no of actual arg if not it will send a error 
**** keywoard agr
actual agr need not be send to order but it can be called by unorded by using actual arg assigned to formal arg
#+BEGIN_SRC python
  def printinfo (name,age):
      print("Name: ", name)
      print("Age: ", age)
      return

  printinfo("xyz", 20) 
  printinfo( age=50, name="miki")    # keyword arg
#+END_SRC
**** ,default argument
A default age is an arg that assume a default value if a value is not provided in function call for that argument
#+BEGIN_SRC python
  def printinfo( name, age=35):
      print("Name: ", name)
      print("Age: ",age)
      return

  printinfo("xyz")                # default agr
  printinfo(name = 'miki',age =50)
#+END_SRC

