python.html
<div id="outline-container-org6a185b4" class="outline-3">
<h3 id="org6a185b4">Dictitionary Comprehension</h3>
<div class="outline-text-3" id="text-org6a185b4">
<div class="org-src-container">
<pre class="src src-python"><span style="color: #715ab1;">nums</span> = <span style="color: #3a81c3;">[</span>1,2,3,4,5,6,7,8,910<span style="color: #3a81c3;">]</span>

<span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">Dictionary Comprehension</span>
<span style="color: #715ab1;">names</span> = <span style="color: #3a81c3;">[</span><span style="color: #2d9574;">'Bruce'</span>, <span style="color: #2d9574;">'Clark'</span>, <span style="color: #2d9574;">'Peter'</span>, <span style="color: #2d9574;">'Logan'</span>, <span style="color: #2d9574;">'Wade'</span><span style="color: #3a81c3;">]</span>
<span style="color: #715ab1;">heros</span> = <span style="color: #3a81c3;">[</span><span style="color: #2d9574;">'Batman'</span>,<span style="color: #2d9574;">'Superman'</span>, <span style="color: #2d9574;">'Spiderman'</span>, <span style="color: #2d9574;">'Wolverine'</span>, <span style="color: #2d9574;">'Deadpool'</span><span style="color: #3a81c3;">]</span>
<span style="color: #3a81c3;">print</span> <span style="color: #3a81c3;">zip</span> <span style="color: #3a81c3;">(</span>name, heros<span style="color: #3a81c3;">)</span>
<span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">[(Bruce, Batman), ('Clark','Superman'), ('Peter', 'Spiderman'), ('Logan', 'Wolverine'), ('Wade,'Deadpool')]</span>

<span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">with out list comprehension</span>
<span style="color: #715ab1;">my_dict</span> = <span style="color: #3a81c3;">{}</span>
<span style="color: #3a81c3; font-weight: bold;">for</span> name, hero <span style="color: #3a81c3; font-weight: bold;">in</span> <span style="color: #3a81c3;">zip</span><span style="color: #3a81c3;">(</span>name, heros<span style="color: #3a81c3;">)</span>:
   my_dict <span style="color: #3a81c3;">[</span>name<span style="color: #3a81c3;">]</span> = hero
<span style="color: #3a81c3;">print</span> my_dict

<span style="color: #715ab1;">my_dict</span> = <span style="color: #3a81c3;">{</span>name : hero <span style="color: #3a81c3; font-weight: bold;">for</span> name, hero <span style="color: #3a81c3; font-weight: bold;">in</span> <span style="color: #3a81c3;">zip</span><span style="color: #6c3163;">(</span>name,heros<span style="color: #6c3163;">)</span> <span style="color: #3a81c3; font-weight: bold;">if</span> name != <span style="color: #2d9574;">'peter'</span><span style="color: #3a81c3;">}</span>
<span style="color: #3a81c3;">print</span> my_dict


<span style="color: #2aa1ae; background-color: #ecf3ec;">#</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-orgbb4aa10" class="outline-3">
<h3 id="orgbb4aa10">Set Comprehension</h3>
<div class="outline-text-3" id="text-orgbb4aa10">
<p>
nums = [1,2,3,4,5,6,7,8,9,10]
</p>
<div class="org-src-container">
<pre class="src src-python"><span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">Set Comprehension </span>
<span style="color: #715ab1;">nums</span> = <span style="color: #3a81c3;">[</span>1,1,2,1,3,4,3,4,55,6,7,9,9<span style="color: #3a81c3;">]</span>
<span style="color: #715ab1;">my_set</span> = <span style="color: #3a81c3;">set</span><span style="color: #3a81c3;">()</span>
<span style="color: #3a81c3; font-weight: bold;">for</span> n <span style="color: #3a81c3; font-weight: bold;">in</span> nums:
    my_set.add<span style="color: #3a81c3;">(</span>n<span style="color: #3a81c3;">)</span>
<span style="color: #3a81c3;">print</span><span style="color: #3a81c3;">(</span>my_set<span style="color: #3a81c3;">)</span>

<span style="color: #715ab1;">my_set</span> = <span style="color: #3a81c3;">{</span>n <span style="color: #3a81c3; font-weight: bold;">for</span> n <span style="color: #3a81c3; font-weight: bold;">in</span> nums<span style="color: #3a81c3;">}</span> 
</pre>
</div>
</div>
</div>
<div id="outline-container-org6e6899c" class="outline-3">
<h3 id="org6e6899c">Generator Expression</h3>
<div class="outline-text-3" id="text-org6e6899c">
<div class="org-src-container">
<pre class="src src-python"><span style="color: #715ab1;">nums</span> = <span style="color: #3a81c3;">[</span>1,2,3,4,5,6,7,8,9,10<span style="color: #3a81c3;">]</span>

<span style="color: #3a81c3; font-weight: bold;">def</span> <span style="color: #6c3163; font-weight: bold;">gen_func</span><span style="color: #3a81c3;">(</span>nums<span style="color: #3a81c3;">)</span>:
   <span style="color: #3a81c3; font-weight: bold;">for</span> n <span style="color: #3a81c3; font-weight: bold;">in</span> nums
        <span style="color: #3a81c3; font-weight: bold;">yield</span> n*n

<span style="color: #715ab1;">my_gen</span> = my_gen_func<span style="color: #3a81c3;">(</span>nums<span style="color: #3a81c3;">)</span>

<span style="color: #3a81c3; font-weight: bold;">for</span> i <span style="color: #3a81c3; font-weight: bold;">in</span> my_gen:
   <span style="color: #3a81c3;">print</span> i

<span style="color: #3a81c3; font-weight: bold;">for</span> i <span style="color: #3a81c3; font-weight: bold;">in</span> my_gen:
   <span style="color: #3a81c3;">print</span> i

<span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">Generator using list Comprehension</span>

<span style="color: #715ab1;">my_nums</span> = <span style="color: #3a81c3;">(</span>x*x <span style="color: #3a81c3; font-weight: bold;">for</span> x <span style="color: #3a81c3; font-weight: bold;">in</span> <span style="color: #6c3163;">[</span>1,2,3,4,5<span style="color: #6c3163;">]</span><span style="color: #3a81c3;">)</span>

<span style="color: #3a81c3; font-weight: bold;">for</span> my_num <span style="color: #3a81c3; font-weight: bold;">in</span> my_nums :
    <span style="color: #3a81c3;">print</span><span style="color: #3a81c3;">(</span>my_num<span style="color: #3a81c3;">)</span>


</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-org6a9d9c5" class="outline-2">
<h2 id="org6a9d9c5">Keyboard Input:</h2>
<div class="outline-text-2" id="text-org6a9d9c5">
<p>
python3 has build-in function <code>input()</code> to read input data from standard input(sys.stdin)
</p>

<p>
python2 has  <code>raw_input</code> is deprecated
Why ?
 raw_input is used to receive only  string input, and reading digit is not possible to remove this raw_input is deprecated 
</p>
<div class="org-src-container">
<pre class="src src-python"><span style="color: #715ab1;">name</span> = <span style="color: #3a81c3;">input</span><span style="color: #3a81c3;">(</span><span style="color: #2d9574;">"Give Input to python "</span><span style="color: #3a81c3;">)</span>
<span style="color: #3a81c3;">print</span><span style="color: #3a81c3;">(</span><span style="color: #2d9574;">"Given input is : "</span>+ name<span style="color: #3a81c3;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-orgec76e44" class="outline-2">
<h2 id="orgec76e44">Function</h2>
<div class="outline-text-2" id="text-orgec76e44">
<p>
Predefine
Use define
</p>
</div>
<div id="outline-container-org1c97ead" class="outline-4">
<h4 id="org1c97ead">Syntax</h4>
<div class="outline-text-4" id="text-org1c97ead">
<div class="org-src-container">
<pre class="src src-python"><span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">Function Defination</span>
<span style="color: #3a81c3; font-weight: bold;">def</span> <span style="color: #6c3163; font-weight: bold;">func_name</span> <span style="color: #3a81c3;">(</span>arg1,arg2,.......<span style="color: #3a81c3;">)</span>:   <span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">arg1,agr2...  are formal arg</span>
    statements
    <span style="color: #3a81c3; font-weight: bold;">return</span><span style="color: #3a81c3;">[</span>expression<span style="color: #3a81c3;">]</span>

<span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">Function Call</span>
func_name<span style="color: #3a81c3;">(</span>x,y,.......<span style="color: #3a81c3;">)</span>              <span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">x,y...... are actual arg</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-orgc814a69" class="outline-4">
<h4 id="orgc814a69">Pass by Reference</h4>
<div class="outline-text-4" id="text-orgc814a69">
<p>
Call by reference : sends the address(ref) of <code>actual arg</code> to <code>formal arg</code>
Python uses pass by reference 
we can check by finding if of actual arg and formal arg are same
</p>
</div>
</div>
<div id="outline-container-org767275d" class="outline-4">
<h4 id="org767275d">Pass by Value</h4>
<div class="outline-text-4" id="text-org767275d">
<p>
Python does not uses pass by value
Call by value : send the value of <code>actual arg</code> to <code>formal arg</code> 
</p>
</div>
</div>
<div id="outline-container-org1edf15b" class="outline-4">
<h4 id="org1edf15b">argument</h4>
<div class="outline-text-4" id="text-org1edf15b">
</div>
<ul class="org-ul">
<li><a id="orgdc27849"></a>required arg<br />
<div class="outline-text-5" id="text-orgdc27849">
<p>
Python check no of formal arg = no of actual arg if not it will send a error 
</p>
</div>
</li>
<li><a id="orgd3dfa4a"></a>keywoard agr<br />
<div class="outline-text-5" id="text-orgd3dfa4a">
<p>
actual agr need not be send to order but it can be called by unorded by using actual arg assigned to formal arg
</p>
<div class="org-src-container">
<pre class="src src-python"><span style="color: #3a81c3; font-weight: bold;">def</span> <span style="color: #6c3163; font-weight: bold;">printinfo</span> <span style="color: #3a81c3;">(</span>name,age<span style="color: #3a81c3;">)</span>:
    <span style="color: #3a81c3;">print</span><span style="color: #3a81c3;">(</span><span style="color: #2d9574;">"Name: "</span>, name<span style="color: #3a81c3;">)</span>
    <span style="color: #3a81c3;">print</span><span style="color: #3a81c3;">(</span><span style="color: #2d9574;">"Age: "</span>, age<span style="color: #3a81c3;">)</span>
    <span style="color: #3a81c3; font-weight: bold;">return</span>

printinfo<span style="color: #3a81c3;">(</span><span style="color: #2d9574;">"xyz"</span>, 20<span style="color: #3a81c3;">)</span> 
printinfo<span style="color: #3a81c3;">(</span> age=50, name=<span style="color: #2d9574;">"miki"</span><span style="color: #3a81c3;">)</span>    <span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">keyword arg</span>
</pre>
</div>
</div>
</li>
<li><a id="org9f6965a"></a>,default argument<br />
<div class="outline-text-5" id="text-org9f6965a">
<p>
A default age is an arg that assume a default value if a value is not provided in function call for that argument
</p>
<div class="org-src-container">
<pre class="src src-python"><span style="color: #3a81c3; font-weight: bold;">def</span> <span style="color: #6c3163; font-weight: bold;">printinfo</span><span style="color: #3a81c3;">(</span> name, age=35<span style="color: #3a81c3;">)</span>:
    <span style="color: #3a81c3;">print</span><span style="color: #3a81c3;">(</span><span style="color: #2d9574;">"Name: "</span>, name<span style="color: #3a81c3;">)</span>
    <span style="color: #3a81c3;">print</span><span style="color: #3a81c3;">(</span><span style="color: #2d9574;">"Age: "</span>,age<span style="color: #3a81c3;">)</span>
    <span style="color: #3a81c3; font-weight: bold;">return</span>

printinfo<span style="color: #3a81c3;">(</span><span style="color: #2d9574;">"xyz"</span><span style="color: #3a81c3;">)</span>                <span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">default agr</span>
printinfo<span style="color: #3a81c3;">(</span>name = <span style="color: #2d9574;">'miki'</span>,age =50<span style="color: #3a81c3;">)</span>
</pre>
</div>
</div>
</li>
