python.org
**** Variable Length arguments:
You may need to proecess a function for more arg than you specified while defining the function 

These arg are called variable-length-arguments and are not named in the function definition,unlike required and default arguments
#+BEGIN_SRC python
  def fun_name([formal_arg], *var_args_tuples):
                  statements
                  statements
                  return variable
#+END_SRC

Note : asterisk (\*) is placed before var name that hold value of all non-keyword variable arg. This tuple remains empty if no additional arg are speciied during the function called
***** Example
#+BEGIN_SRC python
  def printinfo( arg1,*vartuple):
      print("Output is: ")
      print(arg1)
      for var in vartuple:
          print(var)
      return

  printinfo(10)
  printinfo(70,60,50)
#+END_SRC

**** Lamda (Anonymous) Functions:
create small function
not create by std manner by using def keyword
can take any number of arg but return 1 value
can't contain commands or multiple expressions
has there own local namespace contain variabels (parameter list) and gloval namespace
 can't acess other var  

 #+BEGIN_SRC python 
   sum = lambda arg1, arg2:   arg1+arg2

   print(sum(10,20)) 
 #+END_SRC

**** Return
**** args and kwargs
*args and **kwargs In Python : https://www.youtube.com/watch?v=0lu2SY3menU
#+BEGIN_SRC python
  def student_info(*args, **kwargs):
    # print(type(args)) # <class 'tuple'>
    # print(type(kwargs)) # <class 'dict'>

    # print(len(args))     # >>> 2
    # print(len(kwargs))  # >>> 3

    # print(args)          #  >>> ('Math', 'Art')
    # print(kwargs)        # >>> {'name': 'John', 'age': 22}
    print(kwargs.keys())   #  >>> dict_keys(['name', 'age'])
    print(kwargs.values()) # >>> dict_values(['John', 22])
    print( '(' + ', '.join(list(kwargs.keys())) + ')' )   # >>> (name, age)

 student_info( "Math", "Art", name = 'John', age =22)

  # ("Math", "Art")
  # {name 'John', 'age': 22}


  course = ["Math", "Art"]
  info = {name 'John', 'age': 22}

  student_info(course, info)
  # ( ["Math", "Art"], {name 'John', 'age': 22} )
  # {}


  student_info(*course, **info)
  # ("Math", "Art")
  # {name 'John', 'age': 22}


#+END_SRC

lamda
filter
* Namespace & Scope
