python.html
<li><a id="orge8bcc7b"></a>Variable Length arguments:<br />
<div class="outline-text-5" id="text-orge8bcc7b">
<p>
You may need to proecess a function for more arg than you specified while defining the function 
</p>

<p>
These arg are called variable-length-arguments and are not named in the function definition,unlike required and default arguments
</p>
<div class="org-src-container">
<pre class="src src-python"><span style="color: #3a81c3; font-weight: bold;">def</span> <span style="color: #6c3163; font-weight: bold;">fun_name</span><span style="color: #3a81c3;">(</span><span style="color: #6c3163;">[</span>formal_arg<span style="color: #6c3163;">]</span>, *var_args_tuples<span style="color: #3a81c3;">)</span>:
                statements
                statements
                <span style="color: #3a81c3; font-weight: bold;">return</span> variable
</pre>
</div>

<p>
Note : asterisk (\*) is placed before var name that hold value of all non-keyword variable arg. This tuple remains empty if no additional arg are speciied during the function called
</p>
</div>
<ul class="org-ul">
<li><a id="org1cf2f07"></a>Example<br />
<div class="outline-text-6" id="text-org1cf2f07">
<div class="org-src-container">
<pre class="src src-python"><span style="color: #3a81c3; font-weight: bold;">def</span> <span style="color: #6c3163; font-weight: bold;">printinfo</span><span style="color: #3a81c3;">(</span> arg1,*vartuple<span style="color: #3a81c3;">)</span>:
    <span style="color: #3a81c3;">print</span><span style="color: #3a81c3;">(</span><span style="color: #2d9574;">"Output is: "</span><span style="color: #3a81c3;">)</span>
    <span style="color: #3a81c3;">print</span><span style="color: #3a81c3;">(</span>arg1<span style="color: #3a81c3;">)</span>
    <span style="color: #3a81c3; font-weight: bold;">for</span> var <span style="color: #3a81c3; font-weight: bold;">in</span> vartuple:
        <span style="color: #3a81c3;">print</span><span style="color: #3a81c3;">(</span>var<span style="color: #3a81c3;">)</span>
    <span style="color: #3a81c3; font-weight: bold;">return</span>

printinfo<span style="color: #3a81c3;">(</span>10<span style="color: #3a81c3;">)</span>
printinfo<span style="color: #3a81c3;">(</span>70,60,50<span style="color: #3a81c3;">)</span>
</pre>
</div>
</div>
</li>
</ul>
</li>
<li><a id="orga248aac"></a>Lamda (Anonymous) Functions:<br />
<div class="outline-text-5" id="text-orga248aac">
<p>
create small function
not create by std manner by using def keyword
can take any number of arg but return 1 value
can't contain commands or multiple expressions
has there own local namespace contain variabels (parameter list) and gloval namespace
 can't acess other var  
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #3a81c3;">sum</span> = <span style="color: #3a81c3; font-weight: bold;">lambda</span> arg1, arg2:   arg1+arg2

<span style="color: #3a81c3;">print</span><span style="color: #3a81c3;">(</span><span style="color: #3a81c3;">sum</span><span style="color: #6c3163;">(</span>10,20<span style="color: #6c3163;">)</span><span style="color: #3a81c3;">)</span> 
</pre>
</div>
</div>
</li>
<li><a id="org3034a49"></a>Return<br /></li>
<li><a id="org5f7e1f3"></a>args and kwargs<br />
<div class="outline-text-5" id="text-org5f7e1f3">
<p>
*args and **kwargs In Python : <a href="https://www.youtube.com/watch?v=0lu2SY3menU">https://www.youtube.com/watch?v=0lu2SY3menU</a>
</p>
<div class="org-src-container">
<pre class="src src-python"> <span style="color: #3a81c3; font-weight: bold;">def</span> <span style="color: #6c3163; font-weight: bold;">student_info</span><span style="color: #3a81c3;">(</span>*args, **kwargs<span style="color: #3a81c3;">)</span>:
   <span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">print(type(args)) # &lt;class 'tuple'&gt;</span>
   <span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">print(type(kwargs)) # &lt;class 'dict'&gt;</span>

   <span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">print(len(args))     # &gt;&gt;&gt; 2</span>
   <span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">print(len(kwargs))  # &gt;&gt;&gt; 3</span>

   <span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">print(args)          #  &gt;&gt;&gt; ('Math', 'Art')</span>
   <span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">print(kwargs)        # &gt;&gt;&gt; {'name': 'John', 'age': 22}</span>
   <span style="color: #3a81c3;">print</span><span style="color: #3a81c3;">(</span>kwargs.keys<span style="color: #6c3163;">()</span><span style="color: #3a81c3;">)</span>   <span style="color: #2aa1ae; background-color: #ecf3ec;">#  </span><span style="color: #2aa1ae; background-color: #ecf3ec;">&gt;&gt;&gt; dict_keys(['name', 'age'])</span>
   <span style="color: #3a81c3;">print</span><span style="color: #3a81c3;">(</span>kwargs.values<span style="color: #6c3163;">()</span><span style="color: #3a81c3;">)</span> <span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">&gt;&gt;&gt; dict_values(['John', 22])</span>
   <span style="color: #3a81c3;">print</span><span style="color: #3a81c3;">(</span> <span style="color: #2d9574;">'('</span> + <span style="color: #2d9574;">', '</span>.join<span style="color: #6c3163;">(</span><span style="color: #3a81c3;">list</span><span style="color: #2d9574;">(</span>kwargs.keys<span style="color: #67b11d;">()</span><span style="color: #2d9574;">)</span><span style="color: #6c3163;">)</span> + <span style="color: #2d9574;">')'</span> <span style="color: #3a81c3;">)</span>   <span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">&gt;&gt;&gt; (name, age)</span>

student_info<span style="color: #3a81c3;">(</span> <span style="color: #2d9574;">"Math"</span>, <span style="color: #2d9574;">"Art"</span>, name = <span style="color: #2d9574;">'John'</span>, age =22<span style="color: #3a81c3;">)</span>

 <span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">("Math", "Art")</span>
 <span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">{name 'John', 'age': 22}</span>


 <span style="color: #715ab1;">course</span> = <span style="color: #3a81c3;">[</span><span style="color: #2d9574;">"Math"</span>, <span style="color: #2d9574;">"Art"</span><span style="color: #3a81c3;">]</span>
 <span style="color: #715ab1;">info</span> = <span style="color: #3a81c3;">{</span>name <span style="color: #2d9574;">'John'</span>, <span style="color: #2d9574;">'age'</span>: 22<span style="color: #3a81c3;">}</span>

 student_info<span style="color: #3a81c3;">(</span>course, info<span style="color: #3a81c3;">)</span>
 <span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">( ["Math", "Art"], {name 'John', 'age': 22} )</span>
 <span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">{}</span>


 student_info<span style="color: #3a81c3;">(</span>*course, **info<span style="color: #3a81c3;">)</span>
 <span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">("Math", "Art")</span>
 <span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">{name 'John', 'age': 22}</span>


</pre>
</div>

<p>
lamda
filter
</p>
</div>
</li>
</ul>
</div>
</div>
<div id="outline-container-orgeda8a1a" class="outline-2">
<h2 id="orgeda8a1a">Namespace &amp; Scope</h2>
<div class="outline-text-2" id="text-orgeda8a1a">
</div>
