python.org
*** Scope
LEGB : Local, Enclose, Global, Built-in 
18 video of chore schafer
- Local   :defined with in a function
- Enclose :defined with in a enclose {} or <Tab>
- Global  : top of module or using a global key
- Built-in: pre-assigned 

py check in local then enclosed, global and last built-in

- LOCAL SCOPE

#+BEGIN_SRC python
  x = 'global x'

  def test():
      y= 'local y'
      print(y)     
      print(x)  # x is global variable

  test()  # y is local varialble in test

#+END_SRC

- Global  varable
#+BEGIN_SRC python
  x = "global x "

  def test():
      global z

      y ="local y"
      
      print(x)    # x is global 
      print(y)    # y is local
      print(z)    # z is global

  test()
  print(x)
  print(z)

#+END_SRC

Built-in : name pre-assigned in py ex: min,

#+BEGIN_SRC python
  import builtins

  print(dir(builtins))


  def min():
      pass

  m= min([ 5, 5, 4, 5])  # error : min take 0 argments (min is over riden )
  print(m)



#+END_SRC


Encloseing <Tab> in define nested function

#+BEGIN_SRC python
  def outer():
      x= 'outer x'
      y = 'outer y'

      def inner():
          x="inner x"
          # nonlocal x        
          print(x)           # >>> inner x
          print(y)           # >>> outer y

      inner()
      print(x)

  outer()
#+END_SRC


Scope of a variable determines the portion of prg where you can access a particual identifier or region in which var is construct/ deleted

There are two basic scope of a varialbe 
Local : can access only inside a block,function in which it is delacred  
Global: can access thorughout the prg by all function

| local( )  | return all names  that are accessed locally from that function              |
| global( ) | return all names that  are accessed globally and locally from that function |

#+BEGIN_SRC python
  total = 0    # global variable


  def sum(arg1, arg2):
      total = arg1 + arg2           # local var
      print('inside the local function total :',total)
      return total

  sum (10,20)
  print("outside the function  total : ", total)    
#+END_SRC
*** Namespace
 Namespace is like a dictionary (which stores key and value) stores variable and there corresponding objects(values)
 In python as two namespace
**** Local namespace:
             each function, block has it own namespace where it own variables,function,methods, objects
             
**** Global namespace :
             variables(obj ) which can be acessed to all the functions and other variables

**** Local Vs GlobalIf 
local variable and global variable as same name local variable is given priority.

If a variable is defined inside a function,block it is local varialbe
If a variable is defined outside a function it is global variable
Note : To use the global variable in local namespace we have to 1st use globle statement 
#+BEGIN_SRC python

  count = 2000
  # if we don't sepecify global the count is treated as local
  # if local count is not defined then it will give a error
  def Addcount():
      # global count
      count = count +1

  priint(count)
  Addcount()
  print(count)
#+END_SRC
* Modules (librays)
Grouping related method,attribues, class into a module

- Easier to understand and Write
- Module  allows to logically organize your code
- Module in py  is objects  with arbitrarily named attributes that you can bind and reference
- Simply a module is a file =.py file= consistign of py code
- Module can define functions,classes and varibale
- Module can also include runnable code

There are different Modules like File Module, OS Module, Datatime, csv, time , json, regular expression,Subprocess,

For More info visit :  [[./py_modules.html][Python Modules]] 
* TODO Python Module
For beginner NO need to go indepth for each module just need to know overview and when it should be used.

For More info visit :  [[./py_modules.html][Python Modules]] 
* Import 
