python.html
<div id="outline-container-org1cb6f15" class="outline-4">
<h4 id="org1cb6f15">Scope</h4>
<div class="outline-text-4" id="text-org1cb6f15">
<p>
LEGB : Local, Enclose, Global, Built-in 
18 video of chore schafer
</p>
<ul class="org-ul">
<li>Local   :defined with in a function</li>
<li>Enclose :defined with in a enclose {} or &lt;Tab&gt;</li>
<li>Global  : top of module or using a global key</li>
<li>Built-in: pre-assigned</li>
</ul>

<p>
py check in local then enclosed, global and last built-in
</p>

<ul class="org-ul">
<li>LOCAL SCOPE</li>
</ul>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #715ab1;">x</span> = <span style="color: #2d9574;">'global x'</span>

<span style="color: #3a81c3; font-weight: bold;">def</span> <span style="color: #6c3163; font-weight: bold;">test</span><span style="color: #3a81c3;">()</span>:
    <span style="color: #715ab1;">y</span>= <span style="color: #2d9574;">'local y'</span>
    <span style="color: #3a81c3;">print</span><span style="color: #3a81c3;">(</span>y<span style="color: #3a81c3;">)</span>     
    <span style="color: #3a81c3;">print</span><span style="color: #3a81c3;">(</span>x<span style="color: #3a81c3;">)</span>  <span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">x is global variable</span>

test<span style="color: #3a81c3;">()</span>  <span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">y is local varialble in test</span>

</pre>
</div>

<ul class="org-ul">
<li>Global  varable</li>
</ul>
<div class="org-src-container">
<pre class="src src-python"><span style="color: #715ab1;">x</span> = <span style="color: #2d9574;">"global x "</span>

<span style="color: #3a81c3; font-weight: bold;">def</span> <span style="color: #6c3163; font-weight: bold;">test</span><span style="color: #3a81c3;">()</span>:
    <span style="color: #3a81c3; font-weight: bold;">global</span> z

    <span style="color: #715ab1;">y</span> =<span style="color: #2d9574;">"local y"</span>

    <span style="color: #3a81c3;">print</span><span style="color: #3a81c3;">(</span>x<span style="color: #3a81c3;">)</span>    <span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">x is global </span>
    <span style="color: #3a81c3;">print</span><span style="color: #3a81c3;">(</span>y<span style="color: #3a81c3;">)</span>    <span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">y is local</span>
    <span style="color: #3a81c3;">print</span><span style="color: #3a81c3;">(</span>z<span style="color: #3a81c3;">)</span>    <span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">z is global</span>

test<span style="color: #3a81c3;">()</span>
<span style="color: #3a81c3;">print</span><span style="color: #3a81c3;">(</span>x<span style="color: #3a81c3;">)</span>
<span style="color: #3a81c3;">print</span><span style="color: #3a81c3;">(</span>z<span style="color: #3a81c3;">)</span>

</pre>
</div>

<p>
Built-in : name pre-assigned in py ex: min,
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #3a81c3; font-weight: bold;">import</span> builtins

<span style="color: #3a81c3;">print</span><span style="color: #3a81c3;">(</span><span style="color: #3a81c3;">dir</span><span style="color: #6c3163;">(</span>builtins<span style="color: #6c3163;">)</span><span style="color: #3a81c3;">)</span>


<span style="color: #3a81c3; font-weight: bold;">def</span> <span style="color: #6c3163; font-weight: bold;">min</span><span style="color: #3a81c3;">()</span>:
    <span style="color: #3a81c3; font-weight: bold;">pass</span>

<span style="color: #715ab1;">m</span>= <span style="color: #3a81c3;">min</span><span style="color: #3a81c3;">(</span><span style="color: #6c3163;">[</span> 5, 5, 4, 5<span style="color: #6c3163;">]</span><span style="color: #3a81c3;">)</span>  <span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">error : min take 0 argments (min is over riden )</span>
<span style="color: #3a81c3;">print</span><span style="color: #3a81c3;">(</span>m<span style="color: #3a81c3;">)</span>



</pre>
</div>


<p>
Encloseing &lt;Tab&gt; in define nested function
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #3a81c3; font-weight: bold;">def</span> <span style="color: #6c3163; font-weight: bold;">outer</span><span style="color: #3a81c3;">()</span>:
    <span style="color: #715ab1;">x</span>= <span style="color: #2d9574;">'outer x'</span>
    <span style="color: #715ab1;">y</span> = <span style="color: #2d9574;">'outer y'</span>

    <span style="color: #3a81c3; font-weight: bold;">def</span> <span style="color: #6c3163; font-weight: bold;">inner</span><span style="color: #3a81c3;">()</span>:
        <span style="color: #715ab1;">x</span>=<span style="color: #2d9574;">"inner x"</span>
        <span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">nonlocal x        </span>
        <span style="color: #3a81c3;">print</span><span style="color: #3a81c3;">(</span>x<span style="color: #3a81c3;">)</span>           <span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">&gt;&gt;&gt; inner x</span>
        <span style="color: #3a81c3;">print</span><span style="color: #3a81c3;">(</span>y<span style="color: #3a81c3;">)</span>           <span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">&gt;&gt;&gt; outer y</span>

    inner<span style="color: #3a81c3;">()</span>
    <span style="color: #3a81c3;">print</span><span style="color: #3a81c3;">(</span>x<span style="color: #3a81c3;">)</span>

outer<span style="color: #3a81c3;">()</span>
</pre>
</div>


<p>
Scope of a variable determines the portion of prg where you can access a particual identifier or region in which var is construct/ deleted
</p>

<p>
There are two basic scope of a varialbe 
Local : can access only inside a block,function in which it is delacred  
Global: can access thorughout the prg by all function
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">local( )</td>
<td class="org-left">return all names  that are accessed locally from that function</td>
</tr>

<tr>
<td class="org-left">global( )</td>
<td class="org-left">return all names that  are accessed globally and locally from that function</td>
</tr>
</tbody>
</table>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #715ab1;">total</span> = 0    <span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">global variable</span>


<span style="color: #3a81c3; font-weight: bold;">def</span> <span style="color: #6c3163; font-weight: bold;">sum</span><span style="color: #3a81c3;">(</span>arg1, arg2<span style="color: #3a81c3;">)</span>:
    <span style="color: #715ab1;">total</span> = arg1 + arg2           <span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">local var</span>
    <span style="color: #3a81c3;">print</span><span style="color: #3a81c3;">(</span><span style="color: #2d9574;">'inside the local function total :'</span>,total<span style="color: #3a81c3;">)</span>
    <span style="color: #3a81c3; font-weight: bold;">return</span> total

<span style="color: #3a81c3;">sum</span> <span style="color: #3a81c3;">(</span>10,20<span style="color: #3a81c3;">)</span>
<span style="color: #3a81c3;">print</span><span style="color: #3a81c3;">(</span><span style="color: #2d9574;">"outside the function  total : "</span>, total<span style="color: #3a81c3;">)</span>    
</pre>
</div>
</div>
</div>
<div id="outline-container-org7a21f24" class="outline-4">
<h4 id="org7a21f24">Namespace</h4>
<div class="outline-text-4" id="text-org7a21f24">
<p>
Namespace is like a dictionary (which stores key and value) stores variable and there corresponding objects(values)
In python as two namespace
</p>
</div>
<ul class="org-ul">
<li><a id="org38ca4e1"></a>Local namespace:<br />
<div class="outline-text-5" id="text-org38ca4e1">
<p>
each function, block has it own namespace where it own variables,function,methods, objects
</p>
</div>
</li>
<li><a id="orgc731b0b"></a>Global namespace :<br />
<div class="outline-text-5" id="text-orgc731b0b">
<p>
variables(obj ) which can be acessed to all the functions and other variables
</p>
</div>
</li>
<li><a id="org55dac87"></a>Local Vs GlobalIf<br />
<div class="outline-text-5" id="text-org55dac87">
<p>
local variable and global variable as same name local variable is given priority.
</p>

<p>
If a variable is defined inside a function,block it is local varialbe
If a variable is defined outside a function it is global variable
Note : To use the global variable in local namespace we have to 1st use globle statement 
</p>
<div class="org-src-container">
<pre class="src src-python">
<span style="color: #715ab1;">count</span> = 2000
<span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">if we don't sepecify global the count is treated as local</span>
<span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">if local count is not defined then it will give a error</span>
<span style="color: #3a81c3; font-weight: bold;">def</span> <span style="color: #6c3163; font-weight: bold;">Addcount</span><span style="color: #3a81c3;">()</span>:
    <span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">global count</span>
    <span style="color: #715ab1;">count</span> = count +1

priint<span style="color: #3a81c3;">(</span>count<span style="color: #3a81c3;">)</span>
Addcount<span style="color: #3a81c3;">()</span>
<span style="color: #3a81c3;">print</span><span style="color: #3a81c3;">(</span>count<span style="color: #3a81c3;">)</span>
</pre>
</div>
</div>
</li>
</ul>
</div>
</div>
<div id="outline-container-org630faf5" class="outline-2">
<h2 id="org630faf5">Modules (librays)</h2>
<div class="outline-text-2" id="text-org630faf5">
<p>
Grouping related method,attribues, class into a module
</p>

<ul class="org-ul">
<li>Easier to understand and Write</li>
<li>Module  allows to logically organize your code</li>
<li>Module in py  is objects  with arbitrarily named attributes that you can bind and reference</li>
<li>Simply a module is a file <code>.py file</code> consistign of py code</li>
<li>Module can define functions,classes and varibale</li>
<li>Module can also include runnable code</li>
</ul>

<p>
There are different Modules like File Module, OS Module, Datatime, csv, time , json, regular expression,Subprocess,
</p>

<p>
For More info visit :  <a href="./py_modules.html">Python Modules</a> 
</p>
</div>
</div>
<div id="outline-container-orgae1060b" class="outline-2">
<h2 id="orgae1060b"><span class="todo TODO">TODO</span> Python Module</h2>
<div class="outline-text-2" id="text-orgae1060b">
<p>
For beginner NO need to go indepth for each module just need to know overview and when it should be used.
</p>

<p>
For More info visit :  <a href="./py_modules.html">Python Modules</a> 
</p>
</div>
</div>
