python.org
*** Introduction

You can use any py source file as module by executing an import statement in some other python sourcec file
#+BEGIN_SRC python 
  import module1, module2, module3,.......moduleN
#+END_SRC

when the interpreter encounters an important statment
  It will import (include,insert) the module if the module is present in =search path=

**** Search path :
Search path is a list of dir that the interpreter searches before importing module

*** Import your own obj and functions

save the you own obj & function in same dir 

and add  " import file_name"  in other  py prg

https://docs.python.org/3/reference/import.html
*** from Import 
when you use  =import module1= the 
It will import all the objects , functions,variables to the namespace 
Then it will unnessaryly overloades Namespace of prg
But if you want to import only a specific part from module we use =from module_name import=

#+BEGIN_SRC python
  from mod_name import name1,name2, name3.....nameN
#+END_SRC

**** Eg
model defination

#+BEGIN_SRC python
 #  ~/fib.py

  def fibo(n):
      result = []
      a,b = 0,1
      while b <n:
          result.append(b)
          a,b= b,a+b
      return result

  def hello():
      print("Hello World")
      return
#+END_SRC

Using model
#+BEGIN_SRC python
from fib import fibo
print(fibo(10))
#+END_SRC
*** Executing module as script
In a file sys the module is stored by a file name =module name= (string) 
If inside the module the global variable(=__name__= ) has  =module name= is avalable as the value then code will be executed 

#+BEGIN_SRC python
  # given module is executable is it has following statement
  if __name__ == "__main__"":
  main()
#+END_SRC 
 If execute then module it will execute if  global variable =__name__= has =__main__=

#+BEGIN_SRC python
     ~/fib.py

    def fibo(n):
        result = []
        a,b = 0,1
        while b <n:
            result.append(b)
            a,b= b,a+b
        return result

    def hello():
        print("Hello World")
        return

    if __name__ == "__main__":      # py able to understand if file is used as import or has executable script  
        print(fibo(100))

# if fib.py is directly run the __name__ is (__main__)

# if fib.py is imported into other py script then value of __name__ is not equal to __main__

# So a module can be used as executalbe script by __name__
    
#+END_SRC
*** Loading Module 
 When you import a module, the python interpreter searches for module in following sequences:
- Current dir
- If =module= isn't found,python searchs each dir in shell variabel =PYTHONPATH=
- If =module= isn't found, python checks default path (installation dir) =(linux : /usr/local/lib/python)=
- module search path is stored in system module(=sys=) as =sys.path varialbe= contains all the default path,PYTHONPATH,installation default path
 - =sys.path= variable contains the current dir,PYTHONPATH, and the isntallation dependent default.
*** Reload() a module
When module is improted into a script  (The code is excuted  once sequenc order top-level priority)
- To re-execute the top-level code, we use =relaod()=  function
- =relaod()= function imports previously imported module again
#+BEGIN_SRC python
  import imp
  imp.relaod(module1)
#+END_SRC

* Package 
Package is hierarihical file directory structure that defines a single python application environment that consist of modules and sub packages ,sub sub packages ....
each dir or folder  consist of one or more modules, each modules has one or more functions,classes

