python.html
<div id="outline-container-orge065c76" class="outline-2">
<h2 id="orge065c76">Import</h2>
<div class="outline-text-2" id="text-orge065c76">
</div>
<div id="outline-container-org2292345" class="outline-4">
<h4 id="org2292345">Introduction</h4>
<div class="outline-text-4" id="text-org2292345">
<p>
You can use any py source file as module by executing an import statement in some other python sourcec file
</p>
<div class="org-src-container">
<pre class="src src-python"><span style="color: #3a81c3; font-weight: bold;">import</span> module1, module2, module3,.......moduleN
</pre>
</div>

<p>
when the interpreter encounters an important statment
  It will import (include,insert) the module if the module is present in <code>search path</code>
</p>
</div>
<ul class="org-ul">
<li><a id="org4e6c0ec"></a>Search path :<br />
<div class="outline-text-5" id="text-org4e6c0ec">
<p>
Search path is a list of dir that the interpreter searches before importing module
</p>
</div>
</li>
</ul>
</div>
<div id="outline-container-orgd3653eb" class="outline-4">
<h4 id="orgd3653eb">Import your own obj and functions</h4>
<div class="outline-text-4" id="text-orgd3653eb">
<p>
save the you own obj &amp; function in same dir 
</p>

<p>
and add  " import file_name"  in other  py prg
</p>

<p>
<a href="https://docs.python.org/3/reference/import.html">https://docs.python.org/3/reference/import.html</a>
</p>
</div>
</div>
<div id="outline-container-org7fb31be" class="outline-4">
<h4 id="org7fb31be">from Import</h4>
<div class="outline-text-4" id="text-org7fb31be">
<p>
when you use  <code>import module1</code> the 
It will import all the objects , functions,variables to the namespace 
Then it will unnessaryly overloades Namespace of prg
But if you want to import only a specific part from module we use <code>from module_name import</code>
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #3a81c3; font-weight: bold;">from</span> mod_name <span style="color: #3a81c3; font-weight: bold;">import</span> name1,name2, name3.....nameN
</pre>
</div>
</div>
<ul class="org-ul">
<li><a id="org6970e26"></a>Eg<br />
<div class="outline-text-5" id="text-org6970e26">
<p>
model defination
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #2aa1ae; background-color: #ecf3ec;">#  </span><span style="color: #2aa1ae; background-color: #ecf3ec;">~/fib.py</span>

 <span style="color: #3a81c3; font-weight: bold;">def</span> <span style="color: #6c3163; font-weight: bold;">fibo</span><span style="color: #3a81c3;">(</span>n<span style="color: #3a81c3;">)</span>:
     <span style="color: #715ab1;">result</span> = <span style="color: #3a81c3;">[]</span>
     <span style="color: #715ab1;">a</span>,<span style="color: #715ab1;">b</span> = 0,1
     <span style="color: #3a81c3; font-weight: bold;">while</span> b &lt;n:
         result.append<span style="color: #3a81c3;">(</span>b<span style="color: #3a81c3;">)</span>
         <span style="color: #715ab1;">a</span>,<span style="color: #715ab1;">b</span>= b,a+b
     <span style="color: #3a81c3; font-weight: bold;">return</span> result

 <span style="color: #3a81c3; font-weight: bold;">def</span> <span style="color: #6c3163; font-weight: bold;">hello</span><span style="color: #3a81c3;">()</span>:
     <span style="color: #3a81c3;">print</span><span style="color: #3a81c3;">(</span><span style="color: #2d9574;">"Hello World"</span><span style="color: #3a81c3;">)</span>
     <span style="color: #3a81c3; font-weight: bold;">return</span>
</pre>
</div>

<p>
Using model
</p>
<div class="org-src-container">
<pre class="src src-python"><span style="color: #3a81c3; font-weight: bold;">from</span> fib <span style="color: #3a81c3; font-weight: bold;">import</span> fibo
<span style="color: #3a81c3;">print</span><span style="color: #3a81c3;">(</span>fibo<span style="color: #6c3163;">(</span>10<span style="color: #6c3163;">)</span><span style="color: #3a81c3;">)</span>
</pre>
</div>
</div>
</li>
</ul>
</div>
<div id="outline-container-org492e6f8" class="outline-4">
<h4 id="org492e6f8">Executing module as script</h4>
<div class="outline-text-4" id="text-org492e6f8">
<p>
In a file sys the module is stored by a file name <code>module name</code> (string) 
If inside the module the global variable(<code>__name__</code> ) has  <code>module name</code> is avalable as the value then code will be executed 
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">given module is executable is it has following statement</span>
<span style="color: #3a81c3; font-weight: bold;">if</span> <span style="color: #3a81c3;">__name__</span> == <span style="color: #2d9574;">"__main__"":</span>
<span style="color: #2d9574;">main()</span>
</pre>
</div>
<p>
If execute then module it will execute if  global variable <code>__name__</code> has <code>__main__</code>
</p>

<div class="org-src-container">
<pre class="src src-python">     ~/fib.py

    <span style="color: #3a81c3; font-weight: bold;">def</span> <span style="color: #6c3163; font-weight: bold;">fibo</span><span style="color: #3a81c3;">(</span>n<span style="color: #3a81c3;">)</span>:
        <span style="color: #715ab1;">result</span> = <span style="color: #3a81c3;">[]</span>
        <span style="color: #715ab1;">a</span>,<span style="color: #715ab1;">b</span> = 0,1
        <span style="color: #3a81c3; font-weight: bold;">while</span> b &lt;n:
            result.append<span style="color: #3a81c3;">(</span>b<span style="color: #3a81c3;">)</span>
            <span style="color: #715ab1;">a</span>,<span style="color: #715ab1;">b</span>= b,a+b
        <span style="color: #3a81c3; font-weight: bold;">return</span> result

    <span style="color: #3a81c3; font-weight: bold;">def</span> <span style="color: #6c3163; font-weight: bold;">hello</span><span style="color: #3a81c3;">()</span>:
        <span style="color: #3a81c3;">print</span><span style="color: #3a81c3;">(</span><span style="color: #2d9574;">"Hello World"</span><span style="color: #3a81c3;">)</span>
        <span style="color: #3a81c3; font-weight: bold;">return</span>

    <span style="color: #3a81c3; font-weight: bold;">if</span> <span style="color: #3a81c3;">__name__</span> == <span style="color: #2d9574;">"__main__"</span>:      <span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">py able to understand if file is used as import or has executable script  </span>
        <span style="color: #3a81c3;">print</span><span style="color: #3a81c3;">(</span>fibo<span style="color: #6c3163;">(</span>100<span style="color: #6c3163;">)</span><span style="color: #3a81c3;">)</span>

<span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">if fib.py is directly run the __name__ is (__main__)</span>

<span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">if fib.py is imported into other py script then value of __name__ is not equal to __main__</span>

<span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">So a module can be used as executalbe script by __name__</span>

</pre>
</div>
</div>
</div>
<div id="outline-container-orgcbf0aa0" class="outline-4">
<h4 id="orgcbf0aa0">Loading Module</h4>
<div class="outline-text-4" id="text-orgcbf0aa0">
<p>
When you import a module, the python interpreter searches for module in following sequences:
</p>
<ul class="org-ul">
<li>Current dir</li>
<li>If <code>module</code> isn't found,python searchs each dir in shell variabel <code>PYTHONPATH</code></li>
<li>If <code>module</code> isn't found, python checks default path (installation dir) <code>(linux : /usr/local/lib/python)</code></li>
<li>module search path is stored in system module(<code>sys</code>) as <code>sys.path varialbe</code> contains all the default path,PYTHONPATH,installation default path
<ul class="org-ul">
<li><code>sys.path</code> variable contains the current dir,PYTHONPATH, and the isntallation dependent default.</li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-orgd5a0baf" class="outline-4">
<h4 id="orgd5a0baf">Reload() a module</h4>
<div class="outline-text-4" id="text-orgd5a0baf">
<p>
When module is improted into a script  (The code is excuted  once sequenc order top-level priority)
</p>
<ul class="org-ul">
<li>To re-execute the top-level code, we use <code>relaod()</code>  function</li>
<li><code>relaod()</code> function imports previously imported module again</li>
</ul>
<div class="org-src-container">
<pre class="src src-python"><span style="color: #3a81c3; font-weight: bold;">import</span> imp
imp.relaod<span style="color: #3a81c3;">(</span>module1<span style="color: #3a81c3;">)</span>
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-org4adfac7" class="outline-2">
<h2 id="org4adfac7">Package</h2>
<div class="outline-text-2" id="text-org4adfac7">
<p>
Package is hierarihical file directory structure that defines a single python application environment that consist of modules and sub packages ,sub sub packages &#x2026;.
each dir or folder  consist of one or more modules, each modules has one or more functions,classes
</p>
</div>
