python.org
** Create a package
To build a package : 
For developers or coders if we create different modules we have to import each and every modules
In order to customize we create a package

In folders we have 2-3 module and each module we have 2-3 functions

write a file called =__init__.py= which iniciallize a package 
In this =__init__.py= we have to specifity which function, classes  are to be only used for developers are iniciallized to a package.

#+BEGIN_SRC python
# ~/mypackage$ ls
sum.py             # contain add(x,y) 
mult.py            # contain mulitply(x,y)
fact.py            # contain factorial (n),sq(n)  
__init__.py
#+END_SRC

To make a pacakage we have to write a =__init__.py= 
So when we init the pacake we can use it function in module 
#+BEGIN_SRC python
#! /usr/bin/python
#Filepath:  ~/mypackage/__init__.py

from .fact  import factorial, sq    # here ' . ' file in current dir
from .sum import add
from .mult import multiply
#+END_SRC

To use the package in other prorgam we have  use =import mypackage= (file name of package) in prg 
#+BEGIN_SRC python
#! /usr/bin/python
# mypackage should be same dir where prg is run
import mypackage
fact=mypackage.factorial(5)
sum=mypackage.add(10,20)
s=mypackage.sq(10)

#+END_SRC

** Import package from parent directory
https://www.geeksforgeeks.org/python-import-from-parent-directory/
*** using sys.path.append method 
#+begin_src python
import sys
 
# setting path
sys.path.append('../parentdirectory')  # relative path 
 
# importing
from parentdirectory.geeks import geek_method
 
# using
geek_method()
#+end_src
*** os.path.abspath method
#+begin_src python
import path
import sys

# directory reach
directory = path.path(__file__).abspath()

# setting path
sys.path.append(directory.parent.parent)

# importing
from parentdirectory.geeks import geek_method

# using
geek_method()

#+end_src


* Exceptions Handling
*** What is Exception
- Exceptions are runtime error 
- Exception is an event that disrupt the normal flow of a program during its execution
- When a python script enconters a situation that it can't cope  with , it rise an exception
- Exception is a python object that represents an error 
- When a python script raises an exception,it must either handle the exception immediately; otherwise it would terminate  the program

*** How to handle Exception ?
- If you have some suspicious code that may rise an exception, you can defend your program by placing the suspicious code in a =try:= block
- In  =try:= block include a except: statements to handle the problem.
**** syntax
#+BEGIN_SRC python
    try:
    #    your operations here
        statements
        statements
        .................
    except:
    # If there is any exception statements execute block
        statements
        statements
    else:
     # If there is no exception statements execute block
        statements
        statements
#+END_SRC

**** Try- except-else statement
-Try-except statement  catches all the exception that occur.
-Using this kind of try-except statement is not considered a good prog practice
-It catches all exceptions but does not make prog'er identify the root cause of problem that may occur

