python.html
<div id="outline-container-org5aaccaa" class="outline-3">
<h3 id="org5aaccaa">Create a package</h3>
<div class="outline-text-3" id="text-org5aaccaa">
<p>
To build a package : 
For developers or coders if we create different modules we have to import each and every modules
In order to customize we create a package
</p>

<p>
In folders we have 2-3 module and each module we have 2-3 functions
</p>

<p>
write a file called <code>__init__.py</code> which iniciallize a package 
In this <code>__init__.py</code> we have to specifity which function, classes  are to be only used for developers are iniciallized to a package.
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">~/mypackage$ ls</span>
<span style="color: #3a81c3;">sum</span>.py             <span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">contain add(x,y) </span>
mult.py            <span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">contain mulitply(x,y)</span>
fact.py            <span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">contain factorial (n),sq(n)  </span>
__init__.py
</pre>
</div>

<p>
To make a pacakage we have to write a <code>__init__.py</code> 
So when we init the pacake we can use it function in module 
</p>
<div class="org-src-container">
<pre class="src src-python"><span style="color: #2aa1ae; background-color: #ecf3ec;">#</span><span style="color: #2aa1ae; background-color: #ecf3ec;">! /usr/bin/python</span>
<span style="color: #2aa1ae; background-color: #ecf3ec;">#</span><span style="color: #2aa1ae; background-color: #ecf3ec;">Filepath:  ~/mypackage/__init__.py</span>

<span style="color: #3a81c3; font-weight: bold;">from</span> .fact  <span style="color: #3a81c3; font-weight: bold;">import</span> factorial, sq    <span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">here ' . ' file in current dir</span>
<span style="color: #3a81c3; font-weight: bold;">from</span> .<span style="color: #3a81c3;">sum</span> <span style="color: #3a81c3; font-weight: bold;">import</span> add
<span style="color: #3a81c3; font-weight: bold;">from</span> .mult <span style="color: #3a81c3; font-weight: bold;">import</span> multiply
</pre>
</div>

<p>
To use the package in other prorgam we have  use <code>import mypackage</code> (file name of package) in prg 
</p>
<div class="org-src-container">
<pre class="src src-python"><span style="color: #2aa1ae; background-color: #ecf3ec;">#</span><span style="color: #2aa1ae; background-color: #ecf3ec;">! /usr/bin/python</span>
<span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">mypackage should be same dir where prg is run</span>
<span style="color: #3a81c3; font-weight: bold;">import</span> mypackage
<span style="color: #715ab1;">fact</span>=mypackage.factorial<span style="color: #3a81c3;">(</span>5<span style="color: #3a81c3;">)</span>
<span style="color: #3a81c3;">sum</span>=mypackage.add<span style="color: #3a81c3;">(</span>10,20<span style="color: #3a81c3;">)</span>
<span style="color: #715ab1;">s</span>=mypackage.sq<span style="color: #3a81c3;">(</span>10<span style="color: #3a81c3;">)</span>

</pre>
</div>
</div>
</div>
<div id="outline-container-org9cf7da8" class="outline-3">
<h3 id="org9cf7da8">Import package from parent directory</h3>
<div class="outline-text-3" id="text-org9cf7da8">
<p>
<a href="https://www.geeksforgeeks.org/python-import-from-parent-directory/">https://www.geeksforgeeks.org/python-import-from-parent-directory/</a>
</p>
</div>
<div id="outline-container-orgd585a3d" class="outline-4">
<h4 id="orgd585a3d">using sys.path.append method</h4>
<div class="outline-text-4" id="text-orgd585a3d">
<div class="org-src-container">
<pre class="src src-python"><span style="color: #3a81c3; font-weight: bold;">import</span> sys

<span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">setting path</span>
sys.path.append<span style="color: #3a81c3;">(</span><span style="color: #2d9574;">'../parentdirectory'</span><span style="color: #3a81c3;">)</span>  <span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">relative path </span>

<span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">importing</span>
<span style="color: #3a81c3; font-weight: bold;">from</span> parentdirectory.geeks <span style="color: #3a81c3; font-weight: bold;">import</span> geek_method

<span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">using</span>
geek_method<span style="color: #3a81c3;">()</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org5412e98" class="outline-4">
<h4 id="org5412e98">os.path.abspath method</h4>
<div class="outline-text-4" id="text-org5412e98">
<div class="org-src-container">
<pre class="src src-python"><span style="color: #3a81c3; font-weight: bold;">import</span> path
<span style="color: #3a81c3; font-weight: bold;">import</span> sys

<span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">directory reach</span>
<span style="color: #715ab1;">directory</span> = path.path<span style="color: #3a81c3;">(</span>__file__<span style="color: #3a81c3;">)</span>.abspath<span style="color: #3a81c3;">()</span>

<span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">setting path</span>
sys.path.append<span style="color: #3a81c3;">(</span>directory.parent.parent<span style="color: #3a81c3;">)</span>

<span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">importing</span>
<span style="color: #3a81c3; font-weight: bold;">from</span> parentdirectory.geeks <span style="color: #3a81c3; font-weight: bold;">import</span> geek_method

<span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">using</span>
geek_method<span style="color: #3a81c3;">()</span>

</pre>
</div>
</div>
</div>
</div>
</div>
<div id="outline-container-orga8be175" class="outline-2">
<h2 id="orga8be175">Exceptions Handling</h2>
<div class="outline-text-2" id="text-orga8be175">
</div>
<div id="outline-container-org3a5dfb4" class="outline-4">
<h4 id="org3a5dfb4">What is Exception</h4>
<div class="outline-text-4" id="text-org3a5dfb4">
<ul class="org-ul">
<li>Exceptions are runtime error</li>
<li>Exception is an event that disrupt the normal flow of a program during its execution</li>
<li>When a python script enconters a situation that it can't cope  with , it rise an exception</li>
<li>Exception is a python object that represents an error</li>
<li>When a python script raises an exception,it must either handle the exception immediately; otherwise it would terminate  the program</li>
</ul>
</div>
</div>
<div id="outline-container-org8a4818e" class="outline-4">
<h4 id="org8a4818e">How to handle Exception ?</h4>
<div class="outline-text-4" id="text-org8a4818e">
<ul class="org-ul">
<li>If you have some suspicious code that may rise an exception, you can defend your program by placing the suspicious code in a <code>try:</code> block</li>
<li>In  <code>try:</code> block include a except: statements to handle the problem.</li>
</ul>
</div>
<ul class="org-ul">
<li><a id="org8d7f445"></a>syntax<br />
<div class="outline-text-5" id="text-org8d7f445">
<div class="org-src-container">
<pre class="src src-python"><span style="color: #3a81c3; font-weight: bold;">try</span>:
<span style="color: #2aa1ae; background-color: #ecf3ec;">#    </span><span style="color: #2aa1ae; background-color: #ecf3ec;">your operations here</span>
    statements
    statements
    .................
<span style="color: #3a81c3; font-weight: bold;">except</span>:
<span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">If there is any exception statements execute block</span>
    statements
    statements
<span style="color: #3a81c3; font-weight: bold;">else</span>:
 <span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">If there is no exception statements execute block</span>
    statements
    statements
</pre>
</div>
</div>
</li>
<li><a id="org23d4d49"></a>Try- except-else statement<br />
<div class="outline-text-5" id="text-org23d4d49">
<p>
-Try-except statement  catches all the exception that occur.
-Using this kind of try-except statement is not considered a good prog practice
-It catches all exceptions but does not make prog'er identify the root cause of problem that may occur
</p>
</div>
</li>
