python.org
**** Exampels
#+BEGIN_SRC python
try:
    fh = open("testfile","r")
    fh.write("This is my test file!")
except IOError:
# error in Input/Output
    print("Error : can't find file or read data")
else:
    print("Written content in the file successfully")

#+END_SRC

#+begin_src python
try : 
    f = open('notfound.txt')
    if f.name == 'notfound.txt':
        raise MyNotFoundException # Rise Exception Manually 
except FileNoteFoundError as e : 
    print(e)

except MyNoteFoundException as nf:
    print('Error')

else: 
    print(f.read())
    f.close()

finally:
    print("Executine FInally ...")
#+end_src

#+begin_src python
import sqlite3
conn = sqlite3.connect('systeminfo.db')
cur = conn.cursor()

genre = 'test'
try:
    cur.execute('''INSERT OR IGNORE INTO Genre (name) VALUES ( ? )''', ( genre, ) )
    cur.execute('SELECT id FROM Artist WHERE name = ? ', (genre, ))
    genre_id = cur.fetchone()
    if genre_id is None:
        print('Select did not find any artist for {} genre'.format(genre))
    else:
        print('Select resulted in Artist ID {}'.format(genre_id[0]))
except Exception as e:
    # print(e)
    print('Exception: {}'.format(e))
    raise Exception(e)

conn.commit()
conn.close()
#+end_src

*** Try -except with multiple expressions
#+BEGIN_SRC python
  try:
      # You do your operations here
      statements
      statements
      statements
  except ( Exception1, Exception2,.......Exception3  ):
      # if code has any exceptions from given list (Exception1,........N) execute this block
      statements
      statements
  else:
      # if there is no exception execute this block
      statements
      statements
#+END_SRC

Example:
#+BEGIN_SRC python
  try:
      x = int(input ("enter number"))
      y = int(int("enter another number"))
      z = x/y
      print(z)
  except ( ValueError, ZeroDivisionError, KeyboardInterrupt):
      #  ValueError : input is n't numeric , y =0, interrupt by C-c
      print ("Error occured")
#+END_SRC

*** Finally
finally vs except 
finally block is execute in any case if exception occure or not it will execute the block
Note : If you use finally you can't use except and else in try block 
#+BEGIN_SRC python
  try:
  #    your operations here
      statements
      statements
      .................
  finally:
  # Execute this block 
      statements
      statements
#+END_SRC

*** Example for Using Finial inside Exception
Example :
#+BEGIN_SRC python
  try:
      fh = open("testfile", "w")
      try:
          fh.write("This is my test")
      finally:
          print("Going to close the file")
          fh.close()
  except IOError:
      print ("Error: can't fint file or read data")
#+END_SRC

