python.html
<li><a id="org92361b0"></a>Exampels<br />
<div class="outline-text-5" id="text-org92361b0">
<div class="org-src-container">
<pre class="src src-python"><span style="color: #3a81c3; font-weight: bold;">try</span>:
    <span style="color: #715ab1;">fh</span> = <span style="color: #3a81c3;">open</span><span style="color: #3a81c3;">(</span><span style="color: #2d9574;">"testfile"</span>,<span style="color: #2d9574;">"r"</span><span style="color: #3a81c3;">)</span>
    fh.write<span style="color: #3a81c3;">(</span><span style="color: #2d9574;">"This is my test file!"</span><span style="color: #3a81c3;">)</span>
<span style="color: #3a81c3; font-weight: bold;">except</span> <span style="color: #ba2f59; font-weight: bold;">IOError</span>:
<span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">error in Input/Output</span>
    <span style="color: #3a81c3;">print</span><span style="color: #3a81c3;">(</span><span style="color: #2d9574;">"Error : can't find file or read data"</span><span style="color: #3a81c3;">)</span>
<span style="color: #3a81c3; font-weight: bold;">else</span>:
    <span style="color: #3a81c3;">print</span><span style="color: #3a81c3;">(</span><span style="color: #2d9574;">"Written content in the file successfully"</span><span style="color: #3a81c3;">)</span>

</pre>
</div>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #3a81c3; font-weight: bold;">try</span> : 
    <span style="color: #715ab1;">f</span> = <span style="color: #3a81c3;">open</span><span style="color: #3a81c3;">(</span><span style="color: #2d9574;">'notfound.txt'</span><span style="color: #3a81c3;">)</span>
    <span style="color: #3a81c3; font-weight: bold;">if</span> f.name == <span style="color: #2d9574;">'notfound.txt'</span>:
        <span style="color: #3a81c3; font-weight: bold;">raise</span> MyNotFoundException <span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">Rise Exception Manually </span>
<span style="color: #3a81c3; font-weight: bold;">except</span> FileNoteFoundError <span style="color: #3a81c3; font-weight: bold;">as</span> e : 
    <span style="color: #3a81c3;">print</span><span style="color: #3a81c3;">(</span>e<span style="color: #3a81c3;">)</span>

<span style="color: #3a81c3; font-weight: bold;">except</span> MyNoteFoundException <span style="color: #3a81c3; font-weight: bold;">as</span> nf:
    <span style="color: #3a81c3;">print</span><span style="color: #3a81c3;">(</span><span style="color: #2d9574;">'Error'</span><span style="color: #3a81c3;">)</span>

<span style="color: #3a81c3; font-weight: bold;">else</span>: 
    <span style="color: #3a81c3;">print</span><span style="color: #3a81c3;">(</span>f.read<span style="color: #6c3163;">()</span><span style="color: #3a81c3;">)</span>
    f.close<span style="color: #3a81c3;">()</span>

<span style="color: #3a81c3; font-weight: bold;">finally</span>:
    <span style="color: #3a81c3;">print</span><span style="color: #3a81c3;">(</span><span style="color: #2d9574;">"Executine FInally ..."</span><span style="color: #3a81c3;">)</span>
</pre>
</div>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #3a81c3; font-weight: bold;">import</span> sqlite3
<span style="color: #715ab1;">conn</span> = sqlite3.connect<span style="color: #3a81c3;">(</span><span style="color: #2d9574;">'systeminfo.db'</span><span style="color: #3a81c3;">)</span>
<span style="color: #715ab1;">cur</span> = conn.cursor<span style="color: #3a81c3;">()</span>

<span style="color: #715ab1;">genre</span> = <span style="color: #2d9574;">'test'</span>
<span style="color: #3a81c3; font-weight: bold;">try</span>:
    cur.execute<span style="color: #3a81c3;">(</span><span style="color: #2d9574;">'''INSERT OR IGNORE INTO Genre (name) VALUES ( ? )'''</span>, <span style="color: #6c3163;">(</span> genre, <span style="color: #6c3163;">)</span> <span style="color: #3a81c3;">)</span>
    cur.execute<span style="color: #3a81c3;">(</span><span style="color: #2d9574;">'SELECT id FROM Artist WHERE name = ? '</span>, <span style="color: #6c3163;">(</span>genre, <span style="color: #6c3163;">)</span><span style="color: #3a81c3;">)</span>
    <span style="color: #715ab1;">genre_id</span> = cur.fetchone<span style="color: #3a81c3;">()</span>
    <span style="color: #3a81c3; font-weight: bold;">if</span> genre_id <span style="color: #3a81c3; font-weight: bold;">is</span> <span style="color: #4e3163;">None</span>:
        <span style="color: #3a81c3;">print</span><span style="color: #3a81c3;">(</span><span style="color: #2d9574;">'Select did not find any artist for {} genre'</span>.<span style="color: #3a81c3;">format</span><span style="color: #6c3163;">(</span>genre<span style="color: #6c3163;">)</span><span style="color: #3a81c3;">)</span>
    <span style="color: #3a81c3; font-weight: bold;">else</span>:
        <span style="color: #3a81c3;">print</span><span style="color: #3a81c3;">(</span><span style="color: #2d9574;">'Select resulted in Artist ID {}'</span>.<span style="color: #3a81c3;">format</span><span style="color: #6c3163;">(</span>genre_id<span style="color: #2d9574;">[</span>0<span style="color: #2d9574;">]</span><span style="color: #6c3163;">)</span><span style="color: #3a81c3;">)</span>
<span style="color: #3a81c3; font-weight: bold;">except</span> <span style="color: #ba2f59; font-weight: bold;">Exception</span> <span style="color: #3a81c3; font-weight: bold;">as</span> e:
    <span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">print(e)</span>
    <span style="color: #3a81c3;">print</span><span style="color: #3a81c3;">(</span><span style="color: #2d9574;">'Exception: {}'</span>.<span style="color: #3a81c3;">format</span><span style="color: #6c3163;">(</span>e<span style="color: #6c3163;">)</span><span style="color: #3a81c3;">)</span>
    <span style="color: #3a81c3; font-weight: bold;">raise</span> <span style="color: #ba2f59; font-weight: bold;">Exception</span><span style="color: #3a81c3;">(</span>e<span style="color: #3a81c3;">)</span>

conn.commit<span style="color: #3a81c3;">()</span>
conn.close<span style="color: #3a81c3;">()</span>
</pre>
</div>
</div>
</li>
</ul>
</div>
<div id="outline-container-org504b6d6" class="outline-4">
<h4 id="org504b6d6">Try -except with multiple expressions</h4>
<div class="outline-text-4" id="text-org504b6d6">
<div class="org-src-container">
<pre class="src src-python"><span style="color: #3a81c3; font-weight: bold;">try</span>:
    <span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">You do your operations here</span>
    statements
    statements
    statements
<span style="color: #3a81c3; font-weight: bold;">except</span> <span style="color: #3a81c3;">(</span> Exception1, Exception2,.......Exception3  <span style="color: #3a81c3;">)</span>:
    <span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">if code has any exceptions from given list (Exception1,........N) execute this block</span>
    statements
    statements
<span style="color: #3a81c3; font-weight: bold;">else</span>:
    <span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">if there is no exception execute this block</span>
    statements
    statements
</pre>
</div>

<p>
Example:
</p>
<div class="org-src-container">
<pre class="src src-python"><span style="color: #3a81c3; font-weight: bold;">try</span>:
    <span style="color: #715ab1;">x</span> = <span style="color: #3a81c3;">int</span><span style="color: #3a81c3;">(</span><span style="color: #3a81c3;">input</span> <span style="color: #6c3163;">(</span><span style="color: #2d9574;">"enter number"</span><span style="color: #6c3163;">)</span><span style="color: #3a81c3;">)</span>
    <span style="color: #715ab1;">y</span> = <span style="color: #3a81c3;">int</span><span style="color: #3a81c3;">(</span><span style="color: #3a81c3;">int</span><span style="color: #6c3163;">(</span><span style="color: #2d9574;">"enter another number"</span><span style="color: #6c3163;">)</span><span style="color: #3a81c3;">)</span>
    <span style="color: #715ab1;">z</span> = x/y
    <span style="color: #3a81c3;">print</span><span style="color: #3a81c3;">(</span>z<span style="color: #3a81c3;">)</span>
<span style="color: #3a81c3; font-weight: bold;">except</span> <span style="color: #3a81c3;">(</span> <span style="color: #ba2f59; font-weight: bold;">ValueError</span>, <span style="color: #ba2f59; font-weight: bold;">ZeroDivisionError</span>, <span style="color: #ba2f59; font-weight: bold;">KeyboardInterrupt</span><span style="color: #3a81c3;">)</span>:
    <span style="color: #2aa1ae; background-color: #ecf3ec;">#  </span><span style="color: #2aa1ae; background-color: #ecf3ec;">ValueError : input is n't numeric , y =0, interrupt by C-c</span>
    <span style="color: #3a81c3;">print</span> <span style="color: #3a81c3;">(</span><span style="color: #2d9574;">"Error occured"</span><span style="color: #3a81c3;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org5a27f0b" class="outline-4">
<h4 id="org5a27f0b">Finally</h4>
<div class="outline-text-4" id="text-org5a27f0b">
<p>
finally vs except 
finally block is execute in any case if exception occure or not it will execute the block
Note : If you use finally you can't use except and else in try block 
</p>
<div class="org-src-container">
<pre class="src src-python"><span style="color: #3a81c3; font-weight: bold;">try</span>:
<span style="color: #2aa1ae; background-color: #ecf3ec;">#    </span><span style="color: #2aa1ae; background-color: #ecf3ec;">your operations here</span>
    statements
    statements
    .................
<span style="color: #3a81c3; font-weight: bold;">finally</span>:
<span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">Execute this block </span>
    statements
    statements
</pre>
</div>
</div>
</div>
<div id="outline-container-org3146445" class="outline-4">
<h4 id="org3146445">Example for Using Finial inside Exception</h4>
<div class="outline-text-4" id="text-org3146445">
<p>
Example :
</p>
<div class="org-src-container">
<pre class="src src-python"><span style="color: #3a81c3; font-weight: bold;">try</span>:
    <span style="color: #715ab1;">fh</span> = <span style="color: #3a81c3;">open</span><span style="color: #3a81c3;">(</span><span style="color: #2d9574;">"testfile"</span>, <span style="color: #2d9574;">"w"</span><span style="color: #3a81c3;">)</span>
    <span style="color: #3a81c3; font-weight: bold;">try</span>:
        fh.write<span style="color: #3a81c3;">(</span><span style="color: #2d9574;">"This is my test"</span><span style="color: #3a81c3;">)</span>
    <span style="color: #3a81c3; font-weight: bold;">finally</span>:
        <span style="color: #3a81c3;">print</span><span style="color: #3a81c3;">(</span><span style="color: #2d9574;">"Going to close the file"</span><span style="color: #3a81c3;">)</span>
        fh.close<span style="color: #3a81c3;">()</span>
<span style="color: #3a81c3; font-weight: bold;">except</span> <span style="color: #ba2f59; font-weight: bold;">IOError</span>:
    <span style="color: #3a81c3;">print</span> <span style="color: #3a81c3;">(</span><span style="color: #2d9574;">"Error: can't fint file or read data"</span><span style="color: #3a81c3;">)</span>
</pre>
</div>
</div>
</div>
