python.org
*** Argument of Exception
- An exception can have an argument, which is value  that give additional information about the problem
- The content of an argument vary by exception
- You can capture an exception's argument by supplying a variable in except clause
- To handle a single exception, you can have a variable follow the name of the exception in the except statement
- To trap mulitple exception, you can have a variable follow the tuple of the exception

#+BEGIN_SRC python
  try:
      # You do your operations here
      statments
      statments
  except EXCEPTION_TYPE as ARGUMENT:
      # you can print value of ARGUMENT here
#+END_SRC

Here EXCEPTION_TYPE and ARGUMENT varies from code

#+BEGIN_SRC python
  def square(var):
      try:
          print(int(var)**2)
          return
      except ValueError as Argument:
          print("The argument does not contain numbers \n")

  square("10")
  square("abc")
#+END_SRC

*** Raising an Exception
You can raise exception in serveral ways by using the raise statement.
#+BEGIN_SRC python
  raise [ExceptionType  [, args [, traceback] ]  ]
#+END_SRC

ExceptionType : type of exception
Args          : value for exception arg. optional arg
Trackback     : trackes back to object that has exception

In General:
-Exception can be a string, a class, an object
-Most of exception that python core raises are classes with arg that is isntance of the class

 #+BEGIN_SRC python
    try:
        marks = int(input ("input marks"))
        if marks<0 or marks >100 :
            raise Exception(marks)
        print("marks within value range ",e)
    except Exception as e:
        print("error Invalid marks input",e)
 #+END_SRC

#+begin_src python
    try:
        cur.execute("""SELECT * FROM EQ_index WHERE symbol=?""",(symbol,))
        token = cur.fetchall()
#         print(token)
        if (len(token) ==0) or (len(token) >1)  :
            raise Exception
        else :
#             print(token[0][0])
            return token[0][0]
    except Exception as e :
        print(f'TradingSymbol = ** {symbol} ** is not present in Zerodha Instrument NSE Equity List') 
    dbase.commit()    
    dbase.close()

#+end_src 
*** Standard Exception
| Exception Name     | Description                                                                 |
|--------------------+-----------------------------------------------------------------------------|
| Exception          | Base class for for all exceptions                                           |
| Stopiteration      | raised when next() of iter does not point a obj                             |
| SystemExit         | raised by sys.exit() function                                               |
| StandardError      | Base calss for all built-in exception except stop iteration and system exit |
| ArithmeticError    | Base class for all error that occur for numeric calculation                 |
| OverflowError      | raised when a calculation exceed man limit for a numeric type               |
| FloatingPointError | Raised when a floationg point cal fails                                     |
| ZeroDivisionError  | Raised when divis or modulo by zero                                         |
| AssertionError     | Raised in case of failure of assert statement                               |
| AttributeError     | Raised in case of failure of attribute ref or assignment                    |
| ImportError        | Raised when an import statement fails                                       |
|                    |                                                                             |
*** User Defined Exception
Python allows to create user-defined exceptions by derving classes from the standard built-in-exceptions.
**** syntax 
#+BEGIN_SRC python
  class NetworkError(RuntimeError):
      def __init__ (selft,arg):
          self.arg = arg
#+END_SRC

Here a class is sub classed from Runtime Error
It is useful when you need to display more specific information when an exception is caught.

**** Raise Exception
#+BEGIN_SRC python
  try:
      raise NetworkError("Bad hostname")
  except NetworkError,e:
      print e.args
#+END_SRC
