python.html
<div id="outline-container-org4e3b899" class="outline-4">
<h4 id="org4e3b899">Argument of Exception</h4>
<div class="outline-text-4" id="text-org4e3b899">
<ul class="org-ul">
<li>An exception can have an argument, which is value  that give additional information about the problem</li>
<li>The content of an argument vary by exception</li>
<li>You can capture an exception's argument by supplying a variable in except clause</li>
<li>To handle a single exception, you can have a variable follow the name of the exception in the except statement</li>
<li>To trap mulitple exception, you can have a variable follow the tuple of the exception</li>
</ul>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #3a81c3; font-weight: bold;">try</span>:
    <span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">You do your operations here</span>
    statments
    statments
<span style="color: #3a81c3; font-weight: bold;">except</span> EXCEPTION_TYPE <span style="color: #3a81c3; font-weight: bold;">as</span> ARGUMENT:
    <span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">you can print value of ARGUMENT here</span>
</pre>
</div>

<p>
Here EXCEPTION_TYPE and ARGUMENT varies from code
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #3a81c3; font-weight: bold;">def</span> <span style="color: #6c3163; font-weight: bold;">square</span><span style="color: #3a81c3;">(</span>var<span style="color: #3a81c3;">)</span>:
    <span style="color: #3a81c3; font-weight: bold;">try</span>:
        <span style="color: #3a81c3;">print</span><span style="color: #3a81c3;">(</span><span style="color: #3a81c3;">int</span><span style="color: #6c3163;">(</span>var<span style="color: #6c3163;">)</span>**2<span style="color: #3a81c3;">)</span>
        <span style="color: #3a81c3; font-weight: bold;">return</span>
    <span style="color: #3a81c3; font-weight: bold;">except</span> <span style="color: #ba2f59; font-weight: bold;">ValueError</span> <span style="color: #3a81c3; font-weight: bold;">as</span> Argument:
        <span style="color: #3a81c3;">print</span><span style="color: #3a81c3;">(</span><span style="color: #2d9574;">"The argument does not contain numbers </span><span style="color: #4e3163;">\n</span><span style="color: #2d9574;">"</span><span style="color: #3a81c3;">)</span>

square<span style="color: #3a81c3;">(</span><span style="color: #2d9574;">"10"</span><span style="color: #3a81c3;">)</span>
square<span style="color: #3a81c3;">(</span><span style="color: #2d9574;">"abc"</span><span style="color: #3a81c3;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org467c4be" class="outline-4">
<h4 id="org467c4be">Raising an Exception</h4>
<div class="outline-text-4" id="text-org467c4be">
<p>
You can raise exception in serveral ways by using the raise statement.
</p>
<div class="org-src-container">
<pre class="src src-python"><span style="color: #3a81c3; font-weight: bold;">raise</span> <span style="color: #3a81c3;">[</span>ExceptionType  <span style="color: #6c3163;">[</span>, args <span style="color: #2d9574;">[</span>, traceback<span style="color: #2d9574;">]</span> <span style="color: #6c3163;">]</span>  <span style="color: #3a81c3;">]</span>
</pre>
</div>

<p>
ExceptionType : type of exception
Args          : value for exception arg. optional arg
Trackback     : trackes back to object that has exception
</p>

<p>
In General:
-Exception can be a string, a class, an object
-Most of exception that python core raises are classes with arg that is isntance of the class
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #3a81c3; font-weight: bold;">try</span>:
    <span style="color: #715ab1;">marks</span> = <span style="color: #3a81c3;">int</span><span style="color: #3a81c3;">(</span><span style="color: #3a81c3;">input</span> <span style="color: #6c3163;">(</span><span style="color: #2d9574;">"input marks"</span><span style="color: #6c3163;">)</span><span style="color: #3a81c3;">)</span>
    <span style="color: #3a81c3; font-weight: bold;">if</span> marks&lt;0 <span style="color: #3a81c3; font-weight: bold;">or</span> marks &gt;100 :
        <span style="color: #3a81c3; font-weight: bold;">raise</span> <span style="color: #ba2f59; font-weight: bold;">Exception</span><span style="color: #3a81c3;">(</span>marks<span style="color: #3a81c3;">)</span>
    <span style="color: #3a81c3;">print</span><span style="color: #3a81c3;">(</span><span style="color: #2d9574;">"marks within value range "</span>,e<span style="color: #3a81c3;">)</span>
<span style="color: #3a81c3; font-weight: bold;">except</span> <span style="color: #ba2f59; font-weight: bold;">Exception</span> <span style="color: #3a81c3; font-weight: bold;">as</span> e:
    <span style="color: #3a81c3;">print</span><span style="color: #3a81c3;">(</span><span style="color: #2d9574;">"error Invalid marks input"</span>,e<span style="color: #3a81c3;">)</span>
</pre>
</div>

<div class="org-src-container">
<pre class="src src-python">    <span style="color: #3a81c3; font-weight: bold;">try</span>:
        cur.execute<span style="color: #3a81c3;">(</span><span style="color: #2d9574;">"""SELECT * FROM EQ_index WHERE symbol=?"""</span>,<span style="color: #6c3163;">(</span>symbol,<span style="color: #6c3163;">)</span><span style="color: #3a81c3;">)</span>
        <span style="color: #715ab1;">token</span> = cur.fetchall<span style="color: #3a81c3;">()</span>
<span style="color: #2aa1ae; background-color: #ecf3ec;">#         </span><span style="color: #2aa1ae; background-color: #ecf3ec;">print(token)</span>
        <span style="color: #3a81c3; font-weight: bold;">if</span> <span style="color: #3a81c3;">(</span><span style="color: #3a81c3;">len</span><span style="color: #6c3163;">(</span>token<span style="color: #6c3163;">)</span> ==0<span style="color: #3a81c3;">)</span> <span style="color: #3a81c3; font-weight: bold;">or</span> <span style="color: #3a81c3;">(</span><span style="color: #3a81c3;">len</span><span style="color: #6c3163;">(</span>token<span style="color: #6c3163;">)</span> &gt;1<span style="color: #3a81c3;">)</span>  :
            <span style="color: #3a81c3; font-weight: bold;">raise</span> <span style="color: #ba2f59; font-weight: bold;">Exception</span>
        <span style="color: #3a81c3; font-weight: bold;">else</span> :
<span style="color: #2aa1ae; background-color: #ecf3ec;">#             </span><span style="color: #2aa1ae; background-color: #ecf3ec;">print(token[0][0])</span>
            <span style="color: #3a81c3; font-weight: bold;">return</span> token<span style="color: #3a81c3;">[</span>0<span style="color: #3a81c3;">][</span>0<span style="color: #3a81c3;">]</span>
    <span style="color: #3a81c3; font-weight: bold;">except</span> <span style="color: #ba2f59; font-weight: bold;">Exception</span> <span style="color: #3a81c3; font-weight: bold;">as</span> e :
        <span style="color: #3a81c3;">print</span><span style="color: #3a81c3;">(</span>f<span style="color: #2d9574;">'TradingSymbol = ** </span>{symbol}<span style="color: #2d9574;"> ** is not present in Zerodha Instrument NSE Equity List'</span><span style="color: #3a81c3;">)</span> 
    dbase.commit<span style="color: #3a81c3;">()</span>    
    dbase.close<span style="color: #3a81c3;">()</span>

</pre>
</div>
</div>
</div>
<div id="outline-container-orgec853a4" class="outline-4">
<h4 id="orgec853a4">Standard Exception</h4>
<div class="outline-text-4" id="text-orgec853a4">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Exception Name</th>
<th scope="col" class="org-left">Description</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">Exception</td>
<td class="org-left">Base class for for all exceptions</td>
</tr>

<tr>
<td class="org-left">Stopiteration</td>
<td class="org-left">raised when next() of iter does not point a obj</td>
</tr>

<tr>
<td class="org-left">SystemExit</td>
<td class="org-left">raised by sys.exit() function</td>
</tr>

<tr>
<td class="org-left">StandardError</td>
<td class="org-left">Base calss for all built-in exception except stop iteration and system exit</td>
</tr>

<tr>
<td class="org-left">ArithmeticError</td>
<td class="org-left">Base class for all error that occur for numeric calculation</td>
</tr>

<tr>
<td class="org-left">OverflowError</td>
<td class="org-left">raised when a calculation exceed man limit for a numeric type</td>
</tr>

<tr>
<td class="org-left">FloatingPointError</td>
<td class="org-left">Raised when a floationg point cal fails</td>
</tr>

<tr>
<td class="org-left">ZeroDivisionError</td>
<td class="org-left">Raised when divis or modulo by zero</td>
</tr>

<tr>
<td class="org-left">AssertionError</td>
<td class="org-left">Raised in case of failure of assert statement</td>
</tr>

<tr>
<td class="org-left">AttributeError</td>
<td class="org-left">Raised in case of failure of attribute ref or assignment</td>
</tr>

<tr>
<td class="org-left">ImportError</td>
<td class="org-left">Raised when an import statement fails</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-orgafa81d1" class="outline-4">
<h4 id="orgafa81d1">User Defined Exception</h4>
<div class="outline-text-4" id="text-orgafa81d1">
<p>
Python allows to create user-defined exceptions by derving classes from the standard built-in-exceptions.
</p>
</div>
<ul class="org-ul">
<li><a id="org6ad8d13"></a>syntax<br />
<div class="outline-text-5" id="text-org6ad8d13">
<div class="org-src-container">
<pre class="src src-python"><span style="color: #3a81c3; font-weight: bold;">class</span> <span style="color: #ba2f59; font-weight: bold;">NetworkError</span><span style="color: #3a81c3;">(</span><span style="color: #ba2f59; font-weight: bold;">RuntimeError</span><span style="color: #3a81c3;">)</span>:
    <span style="color: #3a81c3; font-weight: bold;">def</span> <span style="color: #6c3163; font-weight: bold;">__init__</span> <span style="color: #3a81c3;">(</span>selft,arg<span style="color: #3a81c3;">)</span>:
        <span style="color: #3a81c3; font-weight: bold;">self</span>.<span style="color: #715ab1;">arg</span> = arg
</pre>
</div>

<p>
Here a class is sub classed from Runtime Error
It is useful when you need to display more specific information when an exception is caught.
</p>
</div>
</li>
<li><a id="org0ae6ce9"></a>Raise Exception<br />
<div class="outline-text-5" id="text-org0ae6ce9">
<div class="org-src-container">
<pre class="src src-python"><span style="color: #3a81c3; font-weight: bold;">try</span>:
    <span style="color: #3a81c3; font-weight: bold;">raise</span> NetworkError<span style="color: #3a81c3;">(</span><span style="color: #2d9574;">"Bad hostname"</span><span style="color: #3a81c3;">)</span>
<span style="color: #3a81c3; font-weight: bold;">except</span> NetworkError,e:
    <span style="color: #3a81c3;">print</span> e.args
</pre>
</div>
</div>
</li>
</ul>
</div>
