python.org
*** Assertion Error

Assertion is used to test the prog or to  check that can turn on or off  when you are done with your testing of program
An assertion is similar to a =raise-if= statement
Assertion is carried by assert statment (conditon)
Assertion at starting of a function to check for valid input, and
After a function call to check for valid output.
**** syntax
#+BEGIN_SRC python
  assert expression(condition)[,  Arguments ]
#+END_SRC
If the expression is false, python raises an assertionError exception.

Example:
#+BEGIN_SRC python
  def kelvin2Farhrenheit ( temp ):
      try:
          assert(temp>=0),temp # if false then assression error will be raised
          return (temp-273)*1.8+32
      except Assertion Error : # arg is temp
          print("Temperatur is less the Absolute Zero", temp)


  print(kelvin2Farhrenheit(273),"deg far")
  print(int(kelvin2Farhrenheit(505.78)),"deg far")
  print(kelvin2Farhrenheit(-5),"deg far") # error is temp> 10 
#+END_SRC

*** Print Exception

#+begin_src python
    def create_entry(self, **kwargs):
        query = get_insert_query(self.table_name,**kwargs)
        self.db_cursor = self.db_connect.cursor()
        # print(query)
        try :
            self.db_cursor.execute(query)        
            self.db_connect.commit()
        except sqlite3.IntegrityError as e:
            print('Exception: {}'.format(e))   # >>>  Exception: UNIQUE constraint failed: SongIndex.song_short_name
            print(e.args)                      # >>> ('UNIQUE constraint failed: SongIndex.song_short_name',)
            # print('Exception: %s' % (' '.join(e.args)))   # >>> UNIQUE constraint failed: SongIndex.song_short_name
            print("Exception class is: ", e.__class__)  # >>> Exception class is:  <class 'sqlite3.IntegrityError'>
                 # >>> 
            # print('SQLite traceback: ')
            exc_type, exc_value, exc_tb = sys.exc_info()
            print(sys.exc_info())
                # >>> (<class 'sqlite3.IntegrityError'>, IntegrityError('UNIQUE constraint failed: SongIndex.song_short_name'), <traceback object at 0x7fce51c32b80>)
            print(f"{type(e).__name__} at line {e.__traceback__.tb_lineno} of {__file__}: {e}")
                 # >>> IntegrityError at line 154 of /media/karthik/myVolume/workspace/workspae_vedabase/slokabase/SqliteModel.py: UNIQUE constraint failed: SongIndex.song_short_name
        finally:
            self.db_cursor.close()      
#+end_src
