python.html
<div id="outline-container-orgea5969c" class="outline-4">
<h4 id="orgea5969c">Assertion Error</h4>
<div class="outline-text-4" id="text-orgea5969c">
<p>
Assertion is used to test the prog or to  check that can turn on or off  when you are done with your testing of program
An assertion is similar to a <code>raise-if</code> statement
Assertion is carried by assert statment (conditon)
Assertion at starting of a function to check for valid input, and
After a function call to check for valid output.
</p>
</div>
<ul class="org-ul">
<li><a id="org40eac10"></a>syntax<br />
<div class="outline-text-5" id="text-org40eac10">
<div class="org-src-container">
<pre class="src src-python"><span style="color: #3a81c3; font-weight: bold;">assert</span> expression<span style="color: #3a81c3;">(</span>condition<span style="color: #3a81c3;">)[</span>,  Arguments <span style="color: #3a81c3;">]</span>
</pre>
</div>
<p>
If the expression is false, python raises an assertionError exception.
</p>

<p>
Example:
</p>
<div class="org-src-container">
<pre class="src src-python"><span style="color: #3a81c3; font-weight: bold;">def</span> <span style="color: #6c3163; font-weight: bold;">kelvin2Farhrenheit</span> <span style="color: #3a81c3;">(</span> temp <span style="color: #3a81c3;">)</span>:
    <span style="color: #3a81c3; font-weight: bold;">try</span>:
        <span style="color: #3a81c3; font-weight: bold;">assert</span><span style="color: #3a81c3;">(</span>temp&gt;=0<span style="color: #3a81c3;">)</span>,temp <span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">if false then assression error will be raised</span>
        <span style="color: #3a81c3; font-weight: bold;">return</span> <span style="color: #3a81c3;">(</span>temp-273<span style="color: #3a81c3;">)</span>*1.8+32
    <span style="color: #3a81c3; font-weight: bold;">except</span> Assertion Error : <span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">arg is temp</span>
        <span style="color: #3a81c3;">print</span><span style="color: #3a81c3;">(</span><span style="color: #2d9574;">"Temperatur is less the Absolute Zero"</span>, temp<span style="color: #3a81c3;">)</span>


<span style="color: #3a81c3;">print</span><span style="color: #3a81c3;">(</span>kelvin2Farhrenheit<span style="color: #6c3163;">(</span>273<span style="color: #6c3163;">)</span>,<span style="color: #2d9574;">"deg far"</span><span style="color: #3a81c3;">)</span>
<span style="color: #3a81c3;">print</span><span style="color: #3a81c3;">(</span><span style="color: #3a81c3;">int</span><span style="color: #6c3163;">(</span>kelvin2Farhrenheit<span style="color: #2d9574;">(</span>505.78<span style="color: #2d9574;">)</span><span style="color: #6c3163;">)</span>,<span style="color: #2d9574;">"deg far"</span><span style="color: #3a81c3;">)</span>
<span style="color: #3a81c3;">print</span><span style="color: #3a81c3;">(</span>kelvin2Farhrenheit<span style="color: #6c3163;">(</span>-5<span style="color: #6c3163;">)</span>,<span style="color: #2d9574;">"deg far"</span><span style="color: #3a81c3;">)</span> <span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">error is temp&gt; 10 </span>
</pre>
</div>
</div>
</li>
</ul>
</div>
<div id="outline-container-org46f9213" class="outline-4">
<h4 id="org46f9213">Print Exception</h4>
<div class="outline-text-4" id="text-org46f9213">
<div class="org-src-container">
<pre class="src src-python"><span style="color: #3a81c3; font-weight: bold;">def</span> <span style="color: #6c3163; font-weight: bold;">create_entry</span><span style="color: #3a81c3;">(</span><span style="color: #3a81c3; font-weight: bold;">self</span>, **kwargs<span style="color: #3a81c3;">)</span>:
    <span style="color: #715ab1;">query</span> = get_insert_query<span style="color: #3a81c3;">(</span><span style="color: #3a81c3; font-weight: bold;">self</span>.table_name,**kwargs<span style="color: #3a81c3;">)</span>
    <span style="color: #3a81c3; font-weight: bold;">self</span>.<span style="color: #715ab1;">db_cursor</span> = <span style="color: #3a81c3; font-weight: bold;">self</span>.db_connect.cursor<span style="color: #3a81c3;">()</span>
    <span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">print(query)</span>
    <span style="color: #3a81c3; font-weight: bold;">try</span> :
        <span style="color: #3a81c3; font-weight: bold;">self</span>.db_cursor.execute<span style="color: #3a81c3;">(</span>query<span style="color: #3a81c3;">)</span>        
        <span style="color: #3a81c3; font-weight: bold;">self</span>.db_connect.commit<span style="color: #3a81c3;">()</span>
    <span style="color: #3a81c3; font-weight: bold;">except</span> sqlite3.IntegrityError <span style="color: #3a81c3; font-weight: bold;">as</span> e:
        <span style="color: #3a81c3;">print</span><span style="color: #3a81c3;">(</span><span style="color: #2d9574;">'Exception: {}'</span>.<span style="color: #3a81c3;">format</span><span style="color: #6c3163;">(</span>e<span style="color: #6c3163;">)</span><span style="color: #3a81c3;">)</span>   <span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">&gt;&gt;&gt;  Exception: UNIQUE constraint failed: SongIndex.song_short_name</span>
        <span style="color: #3a81c3;">print</span><span style="color: #3a81c3;">(</span>e.args<span style="color: #3a81c3;">)</span>                      <span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">&gt;&gt;&gt; ('UNIQUE constraint failed: SongIndex.song_short_name',)</span>
        <span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">print('Exception: %s' % (' '.join(e.args)))   # &gt;&gt;&gt; UNIQUE constraint failed: SongIndex.song_short_name</span>
        <span style="color: #3a81c3;">print</span><span style="color: #3a81c3;">(</span><span style="color: #2d9574;">"Exception class is: "</span>, e.__class__<span style="color: #3a81c3;">)</span>  <span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">&gt;&gt;&gt; Exception class is:  &lt;class 'sqlite3.IntegrityError'&gt;</span>
             <span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">&gt;&gt;&gt; </span>
        <span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">print('SQLite traceback: ')</span>
        <span style="color: #715ab1;">exc_type</span>, <span style="color: #715ab1;">exc_value</span>, <span style="color: #715ab1;">exc_tb</span> = sys.exc_info<span style="color: #3a81c3;">()</span>
        <span style="color: #3a81c3;">print</span><span style="color: #3a81c3;">(</span>sys.exc_info<span style="color: #6c3163;">()</span><span style="color: #3a81c3;">)</span>
            <span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">&gt;&gt;&gt; (&lt;class 'sqlite3.IntegrityError'&gt;, IntegrityError('UNIQUE constraint failed: SongIndex.song_short_name'), &lt;traceback object at 0x7fce51c32b80&gt;)</span>
        <span style="color: #3a81c3;">print</span><span style="color: #3a81c3;">(</span>f<span style="color: #2d9574;">"</span>{<span style="color: #3a81c3;">type</span>(e).<span style="color: #3a81c3;">__name__</span>}<span style="color: #2d9574;"> at line </span>{e.__traceback__.tb_lineno}<span style="color: #2d9574;"> of </span>{__file__}<span style="color: #2d9574;">: </span>{e}<span style="color: #2d9574;">"</span><span style="color: #3a81c3;">)</span>
             <span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">&gt;&gt;&gt; IntegrityError at line 154 of /media/karthik/myVolume/workspace/workspae_vedabase/slokabase/SqliteModel.py: UNIQUE constraint failed: SongIndex.song_short_name</span>
    <span style="color: #3a81c3; font-weight: bold;">finally</span>:
        <span style="color: #3a81c3; font-weight: bold;">self</span>.db_cursor.close<span style="color: #3a81c3;">()</span>      
</pre>
</div>
</div>
</div>
</div>
