python.org
* DuckTyping
#+begin_src python
class Duck:
   def quack(self):
     print('Quack, quack')
   def fly(self):
     print('Flap , flap')

#def quack_and_fly(thing):
#   # Not Duck-Typed(Non-pythonic)
#   if isinstance(thing, Duck):
#      thing.quack()
#      thing.fly()
#   else:
#      print('This has to be a Duck!')
#   print()

def quack_and_fly(thing)
  thing.quack()
  thing.quack()
################################################
  #LBYL :Look Before You Leave(Non-Pythonic)
# We are asking permisson and run code
  if hasattr(thing, 'quack'):
     if callable(thing.quac):
        thing.quack()
  if hasattr(thing, 'fly'):
     if callable(thing.fly):
        thing.fly()
###########################################
# EAFP : it Eassier to Ask Forgiveness and Ask Permission
  try:
    thing.quack()
    thing.quack()
    thing.bark()
  except AttributeError as e:
    print()
 
d = Duck()
quack_and_fly(d)

p = Person()
quack_and_fly(p)

#+end_src

** Example2
#+begin_src python
person = {'name':'Jess' , 'age': 23}
person = {'name':'Jess' , 'age': 23, 'job':'Programmer'}
###################################################################33
# LBYL
if 'name' in person and 'age' in person 'job' in person:
  print("I'm {name}, I'm {age} year old and I am a {job}".format(**person))
else :
   print('Missing some keys)
############################################################################
# EAFP (Pythonic)
try:
   print("I'm {name}. I'm {age} years old and I am a {job}".format(**person)
except KeyError as e:
   print("Missing {} key".format(e))


##
# Example
#####

my_list = [1,2,3,4,5,6]

# Non-Pythonic
if len(my_list) >6:
  pritn(my_list[5])
else:
  print('That index does not exist')

# Pythonic
try:
  print(my_list[5])
except IndexError:
  print('That index does not exist')
#+end_src

** Why we use EAFP
Example :
EAFP : is good for race condition

#+begin_src python
import os

my_file = '/tmp/test.txt'

# Race Conditon
if os.access(my_file,os.R_OK):
  with open(my_file) as f: # if file is deleted after condition
     print(f.read())
else:
   print('File can not be accessed')

# No Race-Conditon
try:
  f = open(my_file)
except IOError as e:
  print('File can not be accessed')
else:
  with f:
    print(f.read())

#+end_src
* Nametuple
#+begin_src python
from collections import namedtuple

color = (55,155,255)
Color = namedtuple ('Color', ['red','green','blue'])

gray = Color(127,127,127)
gold = Color(255,215,0)
orange =Color(255,165,0)
tomato = Color(255,99,71)

print gray[0]
print gray.red
print gold.red




#+end_src
