python.html
<div id="outline-container-org6ee8e29" class="outline-2">
<h2 id="org6ee8e29">DuckTyping</h2>
<div class="outline-text-2" id="text-org6ee8e29">
<div class="org-src-container">
<pre class="src src-python"><span style="color: #3a81c3; font-weight: bold;">class</span> <span style="color: #ba2f59; font-weight: bold;">Duck</span>:
   <span style="color: #3a81c3; font-weight: bold;">def</span> <span style="color: #6c3163; font-weight: bold;">quack</span><span style="color: #3a81c3;">(</span><span style="color: #3a81c3; font-weight: bold;">self</span><span style="color: #3a81c3;">)</span>:
     <span style="color: #3a81c3;">print</span><span style="color: #3a81c3;">(</span><span style="color: #2d9574;">'Quack, quack'</span><span style="color: #3a81c3;">)</span>
   <span style="color: #3a81c3; font-weight: bold;">def</span> <span style="color: #6c3163; font-weight: bold;">fly</span><span style="color: #3a81c3;">(</span><span style="color: #3a81c3; font-weight: bold;">self</span><span style="color: #3a81c3;">)</span>:
     <span style="color: #3a81c3;">print</span><span style="color: #3a81c3;">(</span><span style="color: #2d9574;">'Flap , flap'</span><span style="color: #3a81c3;">)</span>

<span style="color: #2aa1ae; background-color: #ecf3ec;">#</span><span style="color: #2aa1ae; background-color: #ecf3ec;">def quack_and_fly(thing):</span>
<span style="color: #2aa1ae; background-color: #ecf3ec;">#   </span><span style="color: #2aa1ae; background-color: #ecf3ec;"># Not Duck-Typed(Non-pythonic)</span>
<span style="color: #2aa1ae; background-color: #ecf3ec;">#   </span><span style="color: #2aa1ae; background-color: #ecf3ec;">if isinstance(thing, Duck):</span>
<span style="color: #2aa1ae; background-color: #ecf3ec;">#      </span><span style="color: #2aa1ae; background-color: #ecf3ec;">thing.quack()</span>
<span style="color: #2aa1ae; background-color: #ecf3ec;">#      </span><span style="color: #2aa1ae; background-color: #ecf3ec;">thing.fly()</span>
<span style="color: #2aa1ae; background-color: #ecf3ec;">#   </span><span style="color: #2aa1ae; background-color: #ecf3ec;">else:</span>
<span style="color: #2aa1ae; background-color: #ecf3ec;">#      </span><span style="color: #2aa1ae; background-color: #ecf3ec;">print('This has to be a Duck!')</span>
<span style="color: #2aa1ae; background-color: #ecf3ec;">#   </span><span style="color: #2aa1ae; background-color: #ecf3ec;">print()</span>

<span style="color: #3a81c3; font-weight: bold;">def</span> <span style="color: #6c3163; font-weight: bold;">quack_and_fly</span><span style="color: #3a81c3;">(</span>thing<span style="color: #3a81c3;">)</span>
  thing.quack<span style="color: #3a81c3;">()</span>
  thing.quack<span style="color: #3a81c3;">()</span>
<span style="color: #2aa1ae; background-color: #ecf3ec;">################################################</span>
  <span style="color: #2aa1ae; background-color: #ecf3ec;">#</span><span style="color: #2aa1ae; background-color: #ecf3ec;">LBYL :Look Before You Leave(Non-Pythonic)</span>
<span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">We are asking permisson and run code</span>
  <span style="color: #3a81c3; font-weight: bold;">if</span> <span style="color: #3a81c3;">hasattr</span><span style="color: #3a81c3;">(</span>thing, <span style="color: #2d9574;">'quack'</span><span style="color: #3a81c3;">)</span>:
     <span style="color: #3a81c3; font-weight: bold;">if</span> <span style="color: #3a81c3;">callable</span><span style="color: #3a81c3;">(</span>thing.quac<span style="color: #3a81c3;">)</span>:
        thing.quack<span style="color: #3a81c3;">()</span>
  <span style="color: #3a81c3; font-weight: bold;">if</span> <span style="color: #3a81c3;">hasattr</span><span style="color: #3a81c3;">(</span>thing, <span style="color: #2d9574;">'fly'</span><span style="color: #3a81c3;">)</span>:
     <span style="color: #3a81c3; font-weight: bold;">if</span> <span style="color: #3a81c3;">callable</span><span style="color: #3a81c3;">(</span>thing.fly<span style="color: #3a81c3;">)</span>:
        thing.fly<span style="color: #3a81c3;">()</span>
<span style="color: #2aa1ae; background-color: #ecf3ec;">###########################################</span>
<span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">EAFP : it Eassier to Ask Forgiveness and Ask Permission</span>
  <span style="color: #3a81c3; font-weight: bold;">try</span>:
    thing.quack<span style="color: #3a81c3;">()</span>
    thing.quack<span style="color: #3a81c3;">()</span>
    thing.bark<span style="color: #3a81c3;">()</span>
  <span style="color: #3a81c3; font-weight: bold;">except</span> <span style="color: #ba2f59; font-weight: bold;">AttributeError</span> <span style="color: #3a81c3; font-weight: bold;">as</span> e:
    <span style="color: #3a81c3;">print</span><span style="color: #3a81c3;">()</span>

<span style="color: #715ab1;">d</span> = Duck<span style="color: #3a81c3;">()</span>
quack_and_fly<span style="color: #3a81c3;">(</span>d<span style="color: #3a81c3;">)</span>

<span style="color: #715ab1;">p</span> = Person<span style="color: #3a81c3;">()</span>
quack_and_fly<span style="color: #3a81c3;">(</span>p<span style="color: #3a81c3;">)</span>

</pre>
</div>
</div>
<div id="outline-container-org3d07a5d" class="outline-3">
<h3 id="org3d07a5d">Example2</h3>
<div class="outline-text-3" id="text-org3d07a5d">
<div class="org-src-container">
<pre class="src src-python"><span style="color: #715ab1;">person</span> = <span style="color: #3a81c3;">{</span><span style="color: #2d9574;">'name'</span>:<span style="color: #2d9574;">'Jess'</span> , <span style="color: #2d9574;">'age'</span>: 23<span style="color: #3a81c3;">}</span>
<span style="color: #715ab1;">person</span> = <span style="color: #3a81c3;">{</span><span style="color: #2d9574;">'name'</span>:<span style="color: #2d9574;">'Jess'</span> , <span style="color: #2d9574;">'age'</span>: 23, <span style="color: #2d9574;">'job'</span>:<span style="color: #2d9574;">'Programmer'</span><span style="color: #3a81c3;">}</span>
<span style="color: #2aa1ae; background-color: #ecf3ec;">###################################################################</span><span style="color: #2aa1ae; background-color: #ecf3ec;">33</span>
<span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">LBYL</span>
<span style="color: #3a81c3; font-weight: bold;">if</span> <span style="color: #2d9574;">'name'</span> <span style="color: #3a81c3; font-weight: bold;">in</span> person <span style="color: #3a81c3; font-weight: bold;">and</span> <span style="color: #2d9574;">'age'</span> <span style="color: #3a81c3; font-weight: bold;">in</span> person <span style="color: #2d9574;">'job'</span> <span style="color: #3a81c3; font-weight: bold;">in</span> person:
  <span style="color: #3a81c3;">print</span><span style="color: #3a81c3;">(</span><span style="color: #2d9574;">"I'm {name}, I'm {age} year old and I am a {job}"</span>.<span style="color: #3a81c3;">format</span><span style="color: #6c3163;">(</span>**person<span style="color: #6c3163;">)</span><span style="color: #3a81c3;">)</span>
<span style="color: #3a81c3; font-weight: bold;">else</span> :
   <span style="color: #3a81c3;">print</span><span style="color: #3a81c3;">(</span><span style="color: #2d9574;">'Missing some keys)</span>
<span style="color: #2d9574;">############################################################################</span>
<span style="color: #2d9574;"># EAFP (Pythonic)</span>
<span style="color: #2d9574;">try:</span>
<span style="color: #2d9574;">   print("I'</span>m <span style="color: #6c3163;">{</span>name<span style="color: #6c3163;">}</span>. I<span style="color: #2d9574;">'m {age} years old and I am a {job}".format(**person)</span>
<span style="color: #2d9574;">except KeyError as e:</span>
<span style="color: #2d9574;">   print("Missing {} key".format(e))</span>


<span style="color: #2d9574;">##</span>
<span style="color: #2d9574;"># Example</span>
<span style="color: #2d9574;">#####</span>

<span style="color: #2d9574;">my_list = [1,2,3,4,5,6]</span>

<span style="color: #2d9574;"># Non-Pythonic</span>
<span style="color: #2d9574;">if len(my_list) &gt;6:</span>
<span style="color: #2d9574;">  pritn(my_list[5])</span>
<span style="color: #2d9574;">else:</span>
<span style="color: #2d9574;">  print('</span>That index does <span style="color: #3a81c3; font-weight: bold;">not</span> exist<span style="color: #2d9574;">')</span>

<span style="color: #2d9574;"># Pythonic</span>
<span style="color: #2d9574;">try:</span>
<span style="color: #2d9574;">  print(my_list[5])</span>
<span style="color: #2d9574;">except IndexError:</span>
<span style="color: #2d9574;">  print('</span>That index does <span style="color: #3a81c3; font-weight: bold;">not</span> exist<span style="color: #2d9574;">')</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org3b13b53" class="outline-3">
<h3 id="org3b13b53">Why we use EAFP</h3>
<div class="outline-text-3" id="text-org3b13b53">
<p>
Example :
EAFP : is good for race condition
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #3a81c3; font-weight: bold;">import</span> os

<span style="color: #715ab1;">my_file</span> = <span style="color: #2d9574;">'/tmp/test.txt'</span>

<span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">Race Conditon</span>
<span style="color: #3a81c3; font-weight: bold;">if</span> os.access<span style="color: #3a81c3;">(</span>my_file,os.R_OK<span style="color: #3a81c3;">)</span>:
  <span style="color: #3a81c3; font-weight: bold;">with</span> <span style="color: #3a81c3;">open</span><span style="color: #3a81c3;">(</span>my_file<span style="color: #3a81c3;">)</span> <span style="color: #3a81c3; font-weight: bold;">as</span> f: <span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">if file is deleted after condition</span>
     <span style="color: #3a81c3;">print</span><span style="color: #3a81c3;">(</span>f.read<span style="color: #6c3163;">()</span><span style="color: #3a81c3;">)</span>
<span style="color: #3a81c3; font-weight: bold;">else</span>:
   <span style="color: #3a81c3;">print</span><span style="color: #3a81c3;">(</span><span style="color: #2d9574;">'File can not be accessed'</span><span style="color: #3a81c3;">)</span>

<span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">No Race-Conditon</span>
<span style="color: #3a81c3; font-weight: bold;">try</span>:
  <span style="color: #715ab1;">f</span> = <span style="color: #3a81c3;">open</span><span style="color: #3a81c3;">(</span>my_file<span style="color: #3a81c3;">)</span>
<span style="color: #3a81c3; font-weight: bold;">except</span> <span style="color: #ba2f59; font-weight: bold;">IOError</span> <span style="color: #3a81c3; font-weight: bold;">as</span> e:
  <span style="color: #3a81c3;">print</span><span style="color: #3a81c3;">(</span><span style="color: #2d9574;">'File can not be accessed'</span><span style="color: #3a81c3;">)</span>
<span style="color: #3a81c3; font-weight: bold;">else</span>:
  <span style="color: #3a81c3; font-weight: bold;">with</span> f:
    <span style="color: #3a81c3;">print</span><span style="color: #3a81c3;">(</span>f.read<span style="color: #6c3163;">()</span><span style="color: #3a81c3;">)</span>

</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-org572ca28" class="outline-2">
<h2 id="org572ca28">Nametuple</h2>
<div class="outline-text-2" id="text-org572ca28">
<div class="org-src-container">
<pre class="src src-python"><span style="color: #3a81c3; font-weight: bold;">from</span> collections <span style="color: #3a81c3; font-weight: bold;">import</span> namedtuple

<span style="color: #715ab1;">color</span> = <span style="color: #3a81c3;">(</span>55,155,255<span style="color: #3a81c3;">)</span>
<span style="color: #715ab1;">Color</span> = namedtuple <span style="color: #3a81c3;">(</span><span style="color: #2d9574;">'Color'</span>, <span style="color: #6c3163;">[</span><span style="color: #2d9574;">'red'</span>,<span style="color: #2d9574;">'green'</span>,<span style="color: #2d9574;">'blue'</span><span style="color: #6c3163;">]</span><span style="color: #3a81c3;">)</span>

<span style="color: #715ab1;">gray</span> = Color<span style="color: #3a81c3;">(</span>127,127,127<span style="color: #3a81c3;">)</span>
<span style="color: #715ab1;">gold</span> = Color<span style="color: #3a81c3;">(</span>255,215,0<span style="color: #3a81c3;">)</span>
<span style="color: #715ab1;">orange</span> =Color<span style="color: #3a81c3;">(</span>255,165,0<span style="color: #3a81c3;">)</span>
<span style="color: #715ab1;">tomato</span> = Color<span style="color: #3a81c3;">(</span>255,99,71<span style="color: #3a81c3;">)</span>

<span style="color: #3a81c3;">print</span> gray<span style="color: #3a81c3;">[</span>0<span style="color: #3a81c3;">]</span>
<span style="color: #3a81c3;">print</span> gray.red
<span style="color: #3a81c3;">print</span> gold.red




</pre>
</div>
</div>
</div>
