python.org
* TODO Map, Filter & Reduce
Youtube : Map, Filter & Reduce | Python Tutorials For Absolute Beginners In Hindi #48
https://www.youtube.com/watch?v=zimHDlOpGXo
* OOP [Objective Oriented Programming]
*** Introductions

*Class*:  A user-defined prototpye that defines a set of attributes that characterise any obj of a class \\
*Object* : A unique instance of a data structure that's defined by its class .\\
*Class varialbe*   : A variable that is shared by all instances of a class \\
*Data member*      : holds data associated with a class and its objects \\
*Instance Variable*: defined inside a method and belongs to current instance of class. \\
*Instance*            : An individual object of a certain class \\
*Method*              : A special kind of function that is defined in a class definition. \\
*Function overlaoding*: assignment of more than one behavior to a particular function. \\

Overlaoding(Function/operator): \\	
- *Inheritance* : The transfer of the characterisics of a class to other classes that are derivied from it.\\
- *Operation overlaoding*: The assignment of more than one function to a particualr operator.

*** Creating Class
=class= keyword is used to create a new class  \\
The sysntax =class= follwed by =Name of class(ClassName)= and =:= \\
The syntax is given below
**** syntax
#+BEGIN_SRC python
  class ClassName:
      """ Class documentation string optional """
      class_suite            # contain definition of data attributes, functions, methods
#+END_SRC
Class has a documentation string, which is used to accessed via =ClassName.__doc__= \\
=class_suite= conisist of all the compoent statements like class members, data attributes, and functions. \\
=__init__( )= method is class acts as constructor

*** Creating Object 
To create a instance of class, call the class using the class name and pass in whatever arguments in =__init__= method accepts
#+BEGIN_SRC python
  obj_name = ClassName(arg1, arg2....)
#+END_SRC

*** Example:

#+BEGIN_SRC python
  class Employee:
      'Common base class for all employees'
      empCount = 0  # class varialbe

      def __init__(self, name, salary):
          self.name = name
          self.salary = salary
          Employee.empcount += 2

      def displayCount(): # methods
          print("Total number of Employees %d" % Employee.empCount)

      def displayEmployee(self):
          print("Name : ", self.name, ", Salary : ", self.salary)

  emp1 = Employee("Zara", 2000)
  emp2 = Employee("Manni", 5000)
  emp1.displayEmployee()     # acessing the attributes
  emp1.displayEmployee()    
  print("Total Employee %d" % Employee.emCount)
  Employee.dispalyCount()
#+END_SRC

- Here =Employee= class is defined
- __init__ is constructor in py and desine to accept two arg =name, salary= and every constructor should have arg =slef=
- =class variable= is also defined =empCount= 
- =class varialbe= is variable that are shared my all objects
- =class method= are also defined like =displayCount=, =dispalyEmployee=

- =emp1,emp2= object are created by Employee class

*** Accessing Attributes
Class contain data members, class varialbes, methods so class has different attributes \\
This attributes are available to its objects \\
But access to attributes are indepentend or individual \\

To access the obj attributes  we use =dot= operator with object.
#+BEGIN_SRC python
  # To accessing attributes are done by "." or dot operator
  emp1.displayEmployee()
  emp1.displayEmployee()
  # There are some class method which are common(share) to all obj eg : count  
  print("Total Employee %d" % Employee.emCount)
  Employee.dispalyCount()
#+END_SRC

*** Build-in-Function for operating of class memb(attribute)

=getattr(obj,name[,default])= : to access the attribute of obj \\
=hasattr(obj,name[,default])= : to check if an attribute or not \\
=setattr(obj,name[,default])= : to set an attribute would be create if does not exist \\
=delattr(obj,name[,default])= : to del an attribute for given obj \\

*** Build-in-Class Attributes:(attri for class as whole than indivudual obj)

| Build-in-attributes |                                                                            |
|---------------------+----------------------------------------------------------------------------|
| __dict__            | Dict contaiong the namespace of the class                                  |
| __doc__             | Documentation str or None if n't defined                                   |
| __name__            | Name of Class class                                                        |
| __module__          | module name in which class is defined (attri __main__) is interactive mode |
| __bases__           | if has inheritance it can be used  a base case class or                    |
|                     |                                                                            |
