python.html
<div id="outline-container-org7222158" class="outline-2">
<h2 id="org7222158"><span class="todo TODO">TODO</span> Map, Filter &amp; Reduce</h2>
<div class="outline-text-2" id="text-org7222158">
<p>
Youtube : Map, Filter &amp; Reduce | Python Tutorials For Absolute Beginners In Hindi #48
<a href="https://www.youtube.com/watch?v=zimHDlOpGXo">https://www.youtube.com/watch?v=zimHDlOpGXo</a>
</p>
</div>
</div>
<div id="outline-container-orgb6e83c1" class="outline-2">
<h2 id="orgb6e83c1">OOP [Objective Oriented Programming]</h2>
<div class="outline-text-2" id="text-orgb6e83c1">
</div>
<div id="outline-container-org2bab79f" class="outline-4">
<h4 id="org2bab79f">Introductions</h4>
<div class="outline-text-4" id="text-org2bab79f">
<p>
<b>Class</b>:  A user-defined prototpye that defines a set of attributes that characterise any obj of a class <br />
<b>Object</b> : A unique instance of a data structure that's defined by its class .<br />
<b>Class varialbe</b>   : A variable that is shared by all instances of a class <br />
<b>Data member</b>      : holds data associated with a class and its objects <br />
<b>Instance Variable</b>: defined inside a method and belongs to current instance of class. <br />
<b>Instance</b>            : An individual object of a certain class <br />
<b>Method</b>              : A special kind of function that is defined in a class definition. <br />
<b>Function overlaoding</b>: assignment of more than one behavior to a particular function. <br />
</p>

<p>
Overlaoding(Function/operator): <br />
</p>
<ul class="org-ul">
<li><b>Inheritance</b> : The transfer of the characterisics of a class to other classes that are derivied from it.<br /></li>
<li><b>Operation overlaoding</b>: The assignment of more than one function to a particualr operator.</li>
</ul>
</div>
</div>
<div id="outline-container-org70b1133" class="outline-4">
<h4 id="org70b1133">Creating Class</h4>
<div class="outline-text-4" id="text-org70b1133">
<p>
<code>class</code> keyword is used to create a new class  <br />
The sysntax <code>class</code> follwed by <code>Name of class(ClassName)</code> and <code>:</code> <br />
The syntax is given below
</p>
</div>
<ul class="org-ul">
<li><a id="org2cee991"></a>syntax<br />
<div class="outline-text-5" id="text-org2cee991">
<div class="org-src-container">
<pre class="src src-python"><span style="color: #3a81c3; font-weight: bold;">class</span> <span style="color: #ba2f59; font-weight: bold;">ClassName</span>:
    <span style="color: #da8b55;">""" Class documentation string optional """</span>
    class_suite            <span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">contain definition of data attributes, functions, methods</span>
</pre>
</div>
<p>
Class has a documentation string, which is used to accessed via <code>ClassName.__doc__</code> <br />
<code>class_suite</code> conisist of all the compoent statements like class members, data attributes, and functions. <br />
<code>__init__( )</code> method is class acts as constructor
</p>
</div>
</li>
</ul>
</div>
<div id="outline-container-org27a2156" class="outline-4">
<h4 id="org27a2156">Creating Object</h4>
<div class="outline-text-4" id="text-org27a2156">
<p>
To create a instance of class, call the class using the class name and pass in whatever arguments in <code>__init__</code> method accepts
</p>
<div class="org-src-container">
<pre class="src src-python"><span style="color: #715ab1;">obj_name</span> = ClassName<span style="color: #3a81c3;">(</span>arg1, arg2....<span style="color: #3a81c3;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-orgc0fa4ad" class="outline-4">
<h4 id="orgc0fa4ad">Example:</h4>
<div class="outline-text-4" id="text-orgc0fa4ad">
<div class="org-src-container">
<pre class="src src-python"><span style="color: #3a81c3; font-weight: bold;">class</span> <span style="color: #ba2f59; font-weight: bold;">Employee</span>:
    <span style="color: #da8b55;">'Common base class for all employees'</span>
    <span style="color: #715ab1;">empCount</span> = 0  <span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">class varialbe</span>

    <span style="color: #3a81c3; font-weight: bold;">def</span> <span style="color: #6c3163; font-weight: bold;">__init__</span><span style="color: #3a81c3;">(</span><span style="color: #3a81c3; font-weight: bold;">self</span>, name, salary<span style="color: #3a81c3;">)</span>:
        <span style="color: #3a81c3; font-weight: bold;">self</span>.<span style="color: #715ab1;">name</span> = name
        <span style="color: #3a81c3; font-weight: bold;">self</span>.<span style="color: #715ab1;">salary</span> = salary
        Employee.<span style="color: #715ab1;">empcount</span> += 2

    <span style="color: #3a81c3; font-weight: bold;">def</span> <span style="color: #6c3163; font-weight: bold;">displayCount</span><span style="color: #3a81c3;">()</span>: <span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">methods</span>
        <span style="color: #3a81c3;">print</span><span style="color: #3a81c3;">(</span><span style="color: #2d9574;">"Total number of Employees %d"</span> % Employee.empCount<span style="color: #3a81c3;">)</span>

    <span style="color: #3a81c3; font-weight: bold;">def</span> <span style="color: #6c3163; font-weight: bold;">displayEmployee</span><span style="color: #3a81c3;">(</span><span style="color: #3a81c3; font-weight: bold;">self</span><span style="color: #3a81c3;">)</span>:
        <span style="color: #3a81c3;">print</span><span style="color: #3a81c3;">(</span><span style="color: #2d9574;">"Name : "</span>, <span style="color: #3a81c3; font-weight: bold;">self</span>.name, <span style="color: #2d9574;">", Salary : "</span>, <span style="color: #3a81c3; font-weight: bold;">self</span>.salary<span style="color: #3a81c3;">)</span>

<span style="color: #715ab1;">emp1</span> = Employee<span style="color: #3a81c3;">(</span><span style="color: #2d9574;">"Zara"</span>, 2000<span style="color: #3a81c3;">)</span>
<span style="color: #715ab1;">emp2</span> = Employee<span style="color: #3a81c3;">(</span><span style="color: #2d9574;">"Manni"</span>, 5000<span style="color: #3a81c3;">)</span>
emp1.displayEmployee<span style="color: #3a81c3;">()</span>     <span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">acessing the attributes</span>
emp1.displayEmployee<span style="color: #3a81c3;">()</span>    
<span style="color: #3a81c3;">print</span><span style="color: #3a81c3;">(</span><span style="color: #2d9574;">"Total Employee %d"</span> % Employee.emCount<span style="color: #3a81c3;">)</span>
Employee.dispalyCount<span style="color: #3a81c3;">()</span>
</pre>
</div>

<ul class="org-ul">
<li>Here <code>Employee</code> class is defined</li>
<li><span class="underline"><span class="underline">init</span></span> is constructor in py and desine to accept two arg <code>name, salary</code> and every constructor should have arg <code>slef</code></li>
<li><code>class variable</code> is also defined <code>empCount</code></li>
<li><code>class varialbe</code> is variable that are shared my all objects</li>
<li><code>class method</code> are also defined like <code>displayCount</code>, <code>dispalyEmployee</code></li>

<li><code>emp1,emp2</code> object are created by Employee class</li>
</ul>
</div>
</div>
<div id="outline-container-org371e209" class="outline-4">
<h4 id="org371e209">Accessing Attributes</h4>
<div class="outline-text-4" id="text-org371e209">
<p>
Class contain data members, class varialbes, methods so class has different attributes <br />
This attributes are available to its objects <br />
But access to attributes are indepentend or individual <br />
</p>

<p>
To access the obj attributes  we use <code>dot</code> operator with object.
</p>
<div class="org-src-container">
<pre class="src src-python"><span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">To accessing attributes are done by "." or dot operator</span>
emp1.displayEmployee<span style="color: #3a81c3;">()</span>
emp1.displayEmployee<span style="color: #3a81c3;">()</span>
<span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">There are some class method which are common(share) to all obj eg : count  </span>
<span style="color: #3a81c3;">print</span><span style="color: #3a81c3;">(</span><span style="color: #2d9574;">"Total Employee %d"</span> % Employee.emCount<span style="color: #3a81c3;">)</span>
Employee.dispalyCount<span style="color: #3a81c3;">()</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org4e143ef" class="outline-4">
<h4 id="org4e143ef">Build-in-Function for operating of class memb(attribute)</h4>
<div class="outline-text-4" id="text-org4e143ef">
<p>
<code>getattr(obj,name[,default])</code> : to access the attribute of obj <br />
<code>hasattr(obj,name[,default])</code> : to check if an attribute or not <br />
<code>setattr(obj,name[,default])</code> : to set an attribute would be create if does not exist <br />
<code>delattr(obj,name[,default])</code> : to del an attribute for given obj <br />
</p>
</div>
</div>
<div id="outline-container-org5ec72da" class="outline-4">
<h4 id="org5ec72da">Build-in-Class Attributes:(attri for class as whole than indivudual obj)</h4>
<div class="outline-text-4" id="text-org5ec72da">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Build-in-attributes</th>
<th scope="col" class="org-left">&#xa0;</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left"><span class="underline"><span class="underline">dict</span></span></td>
<td class="org-left">Dict contaiong the namespace of the class</td>
</tr>

<tr>
<td class="org-left"><span class="underline"><span class="underline">doc</span></span></td>
<td class="org-left">Documentation str or None if n't defined</td>
</tr>

<tr>
<td class="org-left"><span class="underline"><span class="underline">name</span></span></td>
<td class="org-left">Name of Class class</td>
</tr>

<tr>
<td class="org-left"><span class="underline"><span class="underline">module</span></span></td>
<td class="org-left">module name in which class is defined (attri <span class="underline"><span class="underline">main</span></span>) is interactive mode</td>
</tr>

<tr>
<td class="org-left"><span class="underline"><span class="underline">bases</span></span></td>
<td class="org-left">if has inheritance it can be used  a base case class or</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
</table>
</div>
</div>
