python.org
*** Example:
#+BEGIN_SRC python
  class Employee:
      'Common base class for all employees'
      empCount = 0  # class varialbe

      def __init__(self, name, salary):
          self.name = name
          self.salary = salary
          Employee.empcount += 2

      def displayCount(): # methods
          print("Total number of Employees %d" % Employee.empCount)

      def displayEmployee(self):
          print("Name : ", self.name, ", Salary : ", self.salary)

  emp1 = Employee("Zara", 2000)
  emp2 = Employee("Manni", 5000)

  print("Employee.__doc__ :",    Employee.__doc__)
  print("Employee.__name__ :",   Employee.__name__ )
  print("Employee.__module__ :", Employee.__module__)
  print("Employee.__base__ :",   Employee.__base__ )
  print("Employee.__dict__ :",   Employee.__dict__ )
#+END_SRC

* TODO Dunder Methods
- diff rep and str:


  #+begin_src 
__rep__ : Representation : it is primarily used by developers to debugging, end desired output  eval() of __rep__ should give the output
__str__ : Provide a "readable" or "informal" string representation of an object, primarily for end-users.
__file__: special built-in attribute that holds the path to the Python file (module)
__dict__ : scope of class, used for debugg, inspect, 
__dir__ :



__add__
__sub__
...etc    
  #+end_src


For dic visit : https://realpython.com/python-dict-attribute/ 
#+begin_src python
class PersonAge:
    age = 42
    def __init__(self, age):
        self.age = age




person_obj = PersonAge( 30)  
print(person_obj.__dict__)
# >>>  {'age': 30}


print(PersonAge.__dict__)
#{'__module__': '__main__', 
#    'age': 42, 
#    '__init__': <function PersonAge.__init__ at 0x7f2210ea8860>, 
#    'isEligible': <function PersonAge.isEligible at 0x7fa8651b9580>,
#    '__dict__': <attribute '__dict__' of 'PersonAge' objects>, 
#    '__weakref__': <attribute '__weakref__' of 'PersonAge' objects>, 
#    '__doc__': None
#}
print(dict(PersonAge))  # both are some 
#+end_src


property , getter, and setter


* Inheritance 
Create a class by deriving it from an existing class by listing the parent class in parantheses after the new class name \\
Child class inherits the attributes of its parents class, and you can use those attributes as if they were defined in child class \\
Child class can override data members and methods from parents \\
Derived classes are declareld much like their parent class \\

#+BEGIN_SRC python
  class SubClassName (ParentClass1[, ParentClass2....]):
      "This is subclass document string"
      pass
      # class_suite
#+END_SRC

| issubclass(sub, sup)   | boolean function return true if given sub is subclass of sup class |
| isinstance(obj, class) | boolean function return true if obj is an instance of calss     |

