python.html
<div id="outline-container-orge8fb9f7" class="outline-4">
<h4 id="orge8fb9f7">Example:</h4>
<div class="outline-text-4" id="text-orge8fb9f7">
<div class="org-src-container">
<pre class="src src-python"><span style="color: #3a81c3; font-weight: bold;">class</span> <span style="color: #ba2f59; font-weight: bold;">Employee</span>:
    <span style="color: #da8b55;">'Common base class for all employees'</span>
    <span style="color: #715ab1;">empCount</span> = 0  <span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">class varialbe</span>

    <span style="color: #3a81c3; font-weight: bold;">def</span> <span style="color: #6c3163; font-weight: bold;">__init__</span><span style="color: #3a81c3;">(</span><span style="color: #3a81c3; font-weight: bold;">self</span>, name, salary<span style="color: #3a81c3;">)</span>:
        <span style="color: #3a81c3; font-weight: bold;">self</span>.<span style="color: #715ab1;">name</span> = name
        <span style="color: #3a81c3; font-weight: bold;">self</span>.<span style="color: #715ab1;">salary</span> = salary
        Employee.<span style="color: #715ab1;">empcount</span> += 2

    <span style="color: #3a81c3; font-weight: bold;">def</span> <span style="color: #6c3163; font-weight: bold;">displayCount</span><span style="color: #3a81c3;">()</span>: <span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">methods</span>
        <span style="color: #3a81c3;">print</span><span style="color: #3a81c3;">(</span><span style="color: #2d9574;">"Total number of Employees %d"</span> % Employee.empCount<span style="color: #3a81c3;">)</span>

    <span style="color: #3a81c3; font-weight: bold;">def</span> <span style="color: #6c3163; font-weight: bold;">displayEmployee</span><span style="color: #3a81c3;">(</span><span style="color: #3a81c3; font-weight: bold;">self</span><span style="color: #3a81c3;">)</span>:
        <span style="color: #3a81c3;">print</span><span style="color: #3a81c3;">(</span><span style="color: #2d9574;">"Name : "</span>, <span style="color: #3a81c3; font-weight: bold;">self</span>.name, <span style="color: #2d9574;">", Salary : "</span>, <span style="color: #3a81c3; font-weight: bold;">self</span>.salary<span style="color: #3a81c3;">)</span>

<span style="color: #715ab1;">emp1</span> = Employee<span style="color: #3a81c3;">(</span><span style="color: #2d9574;">"Zara"</span>, 2000<span style="color: #3a81c3;">)</span>
<span style="color: #715ab1;">emp2</span> = Employee<span style="color: #3a81c3;">(</span><span style="color: #2d9574;">"Manni"</span>, 5000<span style="color: #3a81c3;">)</span>

<span style="color: #3a81c3;">print</span><span style="color: #3a81c3;">(</span><span style="color: #2d9574;">"Employee.__doc__ :"</span>,    Employee.<span style="color: #3a81c3;">__doc__</span><span style="color: #3a81c3;">)</span>
<span style="color: #3a81c3;">print</span><span style="color: #3a81c3;">(</span><span style="color: #2d9574;">"Employee.__name__ :"</span>,   Employee.<span style="color: #3a81c3;">__name__</span> <span style="color: #3a81c3;">)</span>
<span style="color: #3a81c3;">print</span><span style="color: #3a81c3;">(</span><span style="color: #2d9574;">"Employee.__module__ :"</span>, Employee.<span style="color: #3a81c3;">__module__</span><span style="color: #3a81c3;">)</span>
<span style="color: #3a81c3;">print</span><span style="color: #3a81c3;">(</span><span style="color: #2d9574;">"Employee.__base__ :"</span>,   Employee.__base__ <span style="color: #3a81c3;">)</span>
<span style="color: #3a81c3;">print</span><span style="color: #3a81c3;">(</span><span style="color: #2d9574;">"Employee.__dict__ :"</span>,   Employee.<span style="color: #3a81c3;">__dict__</span> <span style="color: #3a81c3;">)</span>
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-org70173f0" class="outline-2">
<h2 id="org70173f0"><span class="todo TODO">TODO</span> Dunder Methods</h2>
<div class="outline-text-2" id="text-org70173f0">
<ul class="org-ul">
<li>diff rep and str:</li>
</ul>


<div class="org-src-container">
<pre class="src src-nil">__rep__ : Representation : it is primarily used by developers to debugging, end desired output  eval() of __rep__ should give the output
__str__ : Provide a "readable" or "informal" string representation of an object, primarily for end-users.
__file__: special built-in attribute that holds the path to the Python file (module)
__dict__ : scope of class, used for debugg, inspect, 
__dir__ :



__add__
__sub__
...etc    
</pre>
</div>


<p>
For dic visit : <a href="https://realpython.com/python-dict-attribute/">https://realpython.com/python-dict-attribute/</a> 
</p>
<div class="org-src-container">
<pre class="src src-python"><span style="color: #3a81c3; font-weight: bold;">class</span> <span style="color: #ba2f59; font-weight: bold;">PersonAge</span>:
    <span style="color: #715ab1;">age</span> = 42
    <span style="color: #3a81c3; font-weight: bold;">def</span> <span style="color: #6c3163; font-weight: bold;">__init__</span><span style="color: #3a81c3;">(</span><span style="color: #3a81c3; font-weight: bold;">self</span>, age<span style="color: #3a81c3;">)</span>:
        <span style="color: #3a81c3; font-weight: bold;">self</span>.<span style="color: #715ab1;">age</span> = age




<span style="color: #715ab1;">person_obj</span> = PersonAge<span style="color: #3a81c3;">(</span> 30<span style="color: #3a81c3;">)</span>  
<span style="color: #3a81c3;">print</span><span style="color: #3a81c3;">(</span>person_obj.<span style="color: #3a81c3;">__dict__</span><span style="color: #3a81c3;">)</span>
<span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">&gt;&gt;&gt;  {'age': 30}</span>


<span style="color: #3a81c3;">print</span><span style="color: #3a81c3;">(</span>PersonAge.<span style="color: #3a81c3;">__dict__</span><span style="color: #3a81c3;">)</span>
<span style="color: #2aa1ae; background-color: #ecf3ec;">#</span><span style="color: #2aa1ae; background-color: #ecf3ec;">{'__module__': '__main__', </span>
<span style="color: #2aa1ae; background-color: #ecf3ec;">#    </span><span style="color: #2aa1ae; background-color: #ecf3ec;">'age': 42, </span>
<span style="color: #2aa1ae; background-color: #ecf3ec;">#    </span><span style="color: #2aa1ae; background-color: #ecf3ec;">'__init__': &lt;function PersonAge.__init__ at 0x7f2210ea8860&gt;, </span>
<span style="color: #2aa1ae; background-color: #ecf3ec;">#    </span><span style="color: #2aa1ae; background-color: #ecf3ec;">'isEligible': &lt;function PersonAge.isEligible at 0x7fa8651b9580&gt;,</span>
<span style="color: #2aa1ae; background-color: #ecf3ec;">#    </span><span style="color: #2aa1ae; background-color: #ecf3ec;">'__dict__': &lt;attribute '__dict__' of 'PersonAge' objects&gt;, </span>
<span style="color: #2aa1ae; background-color: #ecf3ec;">#    </span><span style="color: #2aa1ae; background-color: #ecf3ec;">'__weakref__': &lt;attribute '__weakref__' of 'PersonAge' objects&gt;, </span>
<span style="color: #2aa1ae; background-color: #ecf3ec;">#    </span><span style="color: #2aa1ae; background-color: #ecf3ec;">'__doc__': None</span>
<span style="color: #2aa1ae; background-color: #ecf3ec;">#</span><span style="color: #2aa1ae; background-color: #ecf3ec;">}</span>
<span style="color: #3a81c3;">print</span><span style="color: #3a81c3;">(</span><span style="color: #3a81c3;">dict</span><span style="color: #6c3163;">(</span>PersonAge<span style="color: #6c3163;">)</span><span style="color: #3a81c3;">)</span>  <span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">both are some </span>
</pre>
</div>


<p>
property , getter, and setter
</p>
</div>
</div>
<div id="outline-container-orgfe44e1e" class="outline-2">
<h2 id="orgfe44e1e">Inheritance</h2>
<div class="outline-text-2" id="text-orgfe44e1e">
<p>
Create a class by deriving it from an existing class by listing the parent class in parantheses after the new class name <br />
Child class inherits the attributes of its parents class, and you can use those attributes as if they were defined in child class <br />
Child class can override data members and methods from parents <br />
Derived classes are declareld much like their parent class <br />
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #3a81c3; font-weight: bold;">class</span> <span style="color: #ba2f59; font-weight: bold;">SubClassName</span> <span style="color: #3a81c3;">(</span>ParentClass1<span style="color: #6c3163;">[</span>, ParentClass2....<span style="color: #6c3163;">]</span><span style="color: #3a81c3;">)</span>:
    <span style="color: #da8b55;">"This is subclass document string"</span>
    <span style="color: #3a81c3; font-weight: bold;">pass</span>
    <span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">class_suite</span>
</pre>
</div>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">issubclass(sub, sup)</td>
<td class="org-left">boolean function return true if given sub is subclass of sup class</td>
</tr>

<tr>
<td class="org-left">isinstance(obj, class)</td>
<td class="org-left">boolean function return true if obj is an instance of calss</td>
</tr>
</tbody>
</table>
</div>
