python.org
** Example
#+BEGIN_SRC python
  class Parent:
      parentAttr = 100
      def __init__(self):
          print("Call parent constructor")
      def setAttr(self, attr):
          Parent.parentAttr = atrr
      def getAttr(self):
          print("Parent attribute : ", Parent.parentAttr)

  class child(Parent):
      def __init__(self):
          super().__init__()
          print("Calling child method")
      def childMethod(self):
          print("Call child method")
      def parentMethod(self):
          print("overriden parent method")

  c = Child()             # call __init__ of parent then child
                          # call parent constructor then child constructor

  c.childMethod()         # call child method
  c.parentMethod()        # call overriden parent method
  c.setAttr(200)
  c.gerAttr()
#+END_SRC

* Overloading Vs Overriding
Overloading : When functions has multipule defination in a same class, each defination provide diff functoins \\
Overriding: You always override you parent class methods in case you may wants a special or different functionality in your subclass \\

*** Base Overiding methods

| __init__(self[, agrs ]) | Constructor                       |
| __del__(self)           | Destructor,del an obj             |
| __repr__(self)          | Evaluatable string representation |
| __str__(self)           | Print str representation          |
| __cmp__(self,x)         | Obj comparison                    |
|                         |                                   |

** Operator Overloding 
| Operator | magic method                         |
|----------+--------------------------------------|
| +        | object.__add__(self,other)           |
| -        | object.__sub__(self,other)           |
| *        | object.__mul__(self,other)           |
| //       | object.__floordiv__(slef,other)      |
| /        | object.__div__(self,other)           |
| %        | object.__mod__(self,other)           |
| **       | object.__pow__(self,other[, modulo]) |
| <        | object.__lt__(self,other)            |
| <=       | object.__le__(self,other)            |
| ==       | object.__eq__(self,other)            |
| !=       | object.__ne__(self,other)            |
| >=       | object.__ge__(slef,other)            |
|          |                                      |
|          |                                      |
  
*** Example
#+BEGIN_SRC python
  class Length:
      def __init__(self,c,m):
          self.c = c
          self.m = m

      def __str__(self):
          return('Length (%d cm, %d mm)' %(self.c, self.m))

      def __add__(self, other):
          return (Length(self.c + other.c, self.m + other.m))

  l1 = Length(2,6)
  l2 = Length(5,3)
  print(l1+l2)

#+END_SRC

* Data Hiding (Data Encapulatoin)
CPP,JAVA has (visibility mode or acess specifiers private(data in-visible),protected, public, public

Python does not have private,protected,public but simillar functions can be used 

Attribute with '__' prefix : Not directly visible to outside
Python protect those members by changing to : obj._ClassName__attrName

