python.html
<div id="outline-container-orgc886290" class="outline-3">
<h3 id="orgc886290">Example</h3>
<div class="outline-text-3" id="text-orgc886290">
<div class="org-src-container">
<pre class="src src-python"><span style="color: #3a81c3; font-weight: bold;">class</span> <span style="color: #ba2f59; font-weight: bold;">Parent</span>:
    <span style="color: #715ab1;">parentAttr</span> = 100
    <span style="color: #3a81c3; font-weight: bold;">def</span> <span style="color: #6c3163; font-weight: bold;">__init__</span><span style="color: #3a81c3;">(</span><span style="color: #3a81c3; font-weight: bold;">self</span><span style="color: #3a81c3;">)</span>:
        <span style="color: #3a81c3;">print</span><span style="color: #3a81c3;">(</span><span style="color: #2d9574;">"Call parent constructor"</span><span style="color: #3a81c3;">)</span>
    <span style="color: #3a81c3; font-weight: bold;">def</span> <span style="color: #6c3163; font-weight: bold;">setAttr</span><span style="color: #3a81c3;">(</span><span style="color: #3a81c3; font-weight: bold;">self</span>, attr<span style="color: #3a81c3;">)</span>:
        Parent.<span style="color: #715ab1;">parentAttr</span> = atrr
    <span style="color: #3a81c3; font-weight: bold;">def</span> <span style="color: #6c3163; font-weight: bold;">getAttr</span><span style="color: #3a81c3;">(</span><span style="color: #3a81c3; font-weight: bold;">self</span><span style="color: #3a81c3;">)</span>:
        <span style="color: #3a81c3;">print</span><span style="color: #3a81c3;">(</span><span style="color: #2d9574;">"Parent attribute : "</span>, Parent.parentAttr<span style="color: #3a81c3;">)</span>

<span style="color: #3a81c3; font-weight: bold;">class</span> <span style="color: #ba2f59; font-weight: bold;">child</span><span style="color: #3a81c3;">(</span>Parent<span style="color: #3a81c3;">)</span>:
    <span style="color: #3a81c3; font-weight: bold;">def</span> <span style="color: #6c3163; font-weight: bold;">__init__</span><span style="color: #3a81c3;">(</span><span style="color: #3a81c3; font-weight: bold;">self</span><span style="color: #3a81c3;">)</span>:
        <span style="color: #3a81c3;">super</span><span style="color: #3a81c3;">()</span>.__init__<span style="color: #3a81c3;">()</span>
        <span style="color: #3a81c3;">print</span><span style="color: #3a81c3;">(</span><span style="color: #2d9574;">"Calling child method"</span><span style="color: #3a81c3;">)</span>
    <span style="color: #3a81c3; font-weight: bold;">def</span> <span style="color: #6c3163; font-weight: bold;">childMethod</span><span style="color: #3a81c3;">(</span><span style="color: #3a81c3; font-weight: bold;">self</span><span style="color: #3a81c3;">)</span>:
        <span style="color: #3a81c3;">print</span><span style="color: #3a81c3;">(</span><span style="color: #2d9574;">"Call child method"</span><span style="color: #3a81c3;">)</span>
    <span style="color: #3a81c3; font-weight: bold;">def</span> <span style="color: #6c3163; font-weight: bold;">parentMethod</span><span style="color: #3a81c3;">(</span><span style="color: #3a81c3; font-weight: bold;">self</span><span style="color: #3a81c3;">)</span>:
        <span style="color: #3a81c3;">print</span><span style="color: #3a81c3;">(</span><span style="color: #2d9574;">"overriden parent method"</span><span style="color: #3a81c3;">)</span>

<span style="color: #715ab1;">c</span> = Child<span style="color: #3a81c3;">()</span>             <span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">call __init__ of parent then child</span>
                        <span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">call parent constructor then child constructor</span>

c.childMethod<span style="color: #3a81c3;">()</span>         <span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">call child method</span>
c.parentMethod<span style="color: #3a81c3;">()</span>        <span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">call overriden parent method</span>
c.setAttr<span style="color: #3a81c3;">(</span>200<span style="color: #3a81c3;">)</span>
c.gerAttr<span style="color: #3a81c3;">()</span>
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-orgc9f63ae" class="outline-2">
<h2 id="orgc9f63ae">Overloading Vs Overriding</h2>
<div class="outline-text-2" id="text-orgc9f63ae">
<p>
Overloading : When functions has multipule defination in a same class, each defination provide diff functoins <br />
Overriding: You always override you parent class methods in case you may wants a special or different functionality in your subclass <br />
</p>
</div>
<div id="outline-container-org1f0c2bd" class="outline-4">
<h4 id="org1f0c2bd">Base Overiding methods</h4>
<div class="outline-text-4" id="text-org1f0c2bd">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">__init__(self[, agrs ])</td>
<td class="org-left">Constructor</td>
</tr>

<tr>
<td class="org-left">__del__(self)</td>
<td class="org-left">Destructor,del an obj</td>
</tr>

<tr>
<td class="org-left">__repr__(self)</td>
<td class="org-left">Evaluatable string representation</td>
</tr>

<tr>
<td class="org-left">__str__(self)</td>
<td class="org-left">Print str representation</td>
</tr>

<tr>
<td class="org-left">__cmp__(self,x)</td>
<td class="org-left">Obj comparison</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-orga602cef" class="outline-3">
<h3 id="orga602cef">Operator Overloding</h3>
<div class="outline-text-3" id="text-orga602cef">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Operator</th>
<th scope="col" class="org-left">magic method</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">+</td>
<td class="org-left">object.__add__(self,other)</td>
</tr>

<tr>
<td class="org-left">-</td>
<td class="org-left">object.__sub__(self,other)</td>
</tr>

<tr>
<td class="org-left">*</td>
<td class="org-left">object.__mul__(self,other)</td>
</tr>

<tr>
<td class="org-left">//</td>
<td class="org-left">object.__floordiv__(slef,other)</td>
</tr>

<tr>
<td class="org-left">%</td>
<td class="org-left">object.__mod__(self,other)</td>
</tr>

<tr>
<td class="org-left">**</td>
<td class="org-left">object.__pow__(self,other[, modulo])</td>
</tr>

<tr>
<td class="org-left">&lt;</td>
<td class="org-left">object.__lt__(self,other)</td>
</tr>

<tr>
<td class="org-left">&lt;=</td>
<td class="org-left">object.__le__(self,other)</td>
</tr>

<tr>
<td class="org-left">==</td>
<td class="org-left">object.__eq__(self,other)</td>
</tr>

<tr>
<td class="org-left">!=</td>
<td class="org-left">object.__ne__(self,other)</td>
</tr>

<tr>
<td class="org-left">&gt;=</td>
<td class="org-left">object.__ge__(slef,other)</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
</table>
</div>
<div id="outline-container-org0eea90d" class="outline-4">
<h4 id="org0eea90d">Example</h4>
<div class="outline-text-4" id="text-org0eea90d">
<div class="org-src-container">
<pre class="src src-python"><span style="color: #3a81c3; font-weight: bold;">class</span> <span style="color: #ba2f59; font-weight: bold;">Length</span>:
    <span style="color: #3a81c3; font-weight: bold;">def</span> <span style="color: #6c3163; font-weight: bold;">__init__</span><span style="color: #3a81c3;">(</span><span style="color: #3a81c3; font-weight: bold;">self</span>,c,m<span style="color: #3a81c3;">)</span>:
        <span style="color: #3a81c3; font-weight: bold;">self</span>.<span style="color: #715ab1;">c</span> = c
        <span style="color: #3a81c3; font-weight: bold;">self</span>.<span style="color: #715ab1;">m</span> = m

    <span style="color: #3a81c3; font-weight: bold;">def</span> <span style="color: #6c3163; font-weight: bold;">__str__</span><span style="color: #3a81c3;">(</span><span style="color: #3a81c3; font-weight: bold;">self</span><span style="color: #3a81c3;">)</span>:
        <span style="color: #3a81c3; font-weight: bold;">return</span><span style="color: #3a81c3;">(</span><span style="color: #2d9574;">'Length (%d cm, %d mm)'</span> %<span style="color: #6c3163;">(</span><span style="color: #3a81c3; font-weight: bold;">self</span>.c, <span style="color: #3a81c3; font-weight: bold;">self</span>.m<span style="color: #6c3163;">)</span><span style="color: #3a81c3;">)</span>

    <span style="color: #3a81c3; font-weight: bold;">def</span> <span style="color: #6c3163; font-weight: bold;">__add__</span><span style="color: #3a81c3;">(</span><span style="color: #3a81c3; font-weight: bold;">self</span>, other<span style="color: #3a81c3;">)</span>:
        <span style="color: #3a81c3; font-weight: bold;">return</span> <span style="color: #3a81c3;">(</span>Length<span style="color: #6c3163;">(</span><span style="color: #3a81c3; font-weight: bold;">self</span>.c + other.c, <span style="color: #3a81c3; font-weight: bold;">self</span>.m + other.m<span style="color: #6c3163;">)</span><span style="color: #3a81c3;">)</span>

<span style="color: #715ab1;">l1</span> = Length<span style="color: #3a81c3;">(</span>2,6<span style="color: #3a81c3;">)</span>
<span style="color: #715ab1;">l2</span> = Length<span style="color: #3a81c3;">(</span>5,3<span style="color: #3a81c3;">)</span>
<span style="color: #3a81c3;">print</span><span style="color: #3a81c3;">(</span>l1+l2<span style="color: #3a81c3;">)</span>

</pre>
</div>
</div>
</div>
</div>
</div>
<div id="outline-container-orge57385b" class="outline-2">
<h2 id="orge57385b">Data Hiding (Data Encapulatoin)</h2>
<div class="outline-text-2" id="text-orge57385b">
<p>
CPP,JAVA has (visibility mode or acess specifiers private(data in-visible),protected, public, public
</p>

<p>
Python does not have private,protected,public but simillar functions can be used 
</p>

<p>
Attribute with '__' prefix : Not directly visible to outside
Python protect those members by changing to : obj._ClassName__attrName
</p>
</div>
