python.org
** Example:
#+BEGIN_SRC python
  class Counter:
      def __init__(self,x):
          self._c=x       # _ prefix this mem should not be used direclty
          self.__cc=10    # __ prefix this mem can't access direclty

  c1 = Counter (5)
  print(c1._c)
  #pritn(c1.__c)                          #  direclty can't access
  print(c1._Counter__cc)                  #  can access by "_CLASSNAmE__private variable"
#+END_SRC

* TODO Decorateors [034,035_Decorators: Dynamics]
1st class fuction :
closers:

** 1st class Functions 
#+begin_src python
def outer_function ():
   message = 'Hi'
   def inner_function():
       print(message)
#   return inner_function()
   return inner_function()


# outer_fuction()
my_func = outer_function()

my_func()
my_func()
my_func()


def outer_function (msg):
   message = msg
   def inner_function():
       print(message)
   return inner_function()

hi_func = outer_function('Hi')
bye_func = outer_function('Bye')


hi_func()
bye_func()
#+end_src
** Decoreators
#+begin_src python

# Decoreator

def decorator_function(original_func):
   def wrapper_function():
       return original_func()
   return wrapper_function


def dispaly():
  print('display function ran')

decorated_display = decorator_function(dispaly)

decoreated_display()

#+end_src
