python.html
<div id="outline-container-org91c84dd" class="outline-3">
<h3 id="org91c84dd">Example:</h3>
<div class="outline-text-3" id="text-org91c84dd">
<div class="org-src-container">
<pre class="src src-python"><span style="color: #3a81c3; font-weight: bold;">class</span> <span style="color: #ba2f59; font-weight: bold;">Counter</span>:
    <span style="color: #3a81c3; font-weight: bold;">def</span> <span style="color: #6c3163; font-weight: bold;">__init__</span><span style="color: #3a81c3;">(</span><span style="color: #3a81c3; font-weight: bold;">self</span>,x<span style="color: #3a81c3;">)</span>:
        <span style="color: #3a81c3; font-weight: bold;">self</span>.<span style="color: #715ab1;">_c</span>=x       <span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">_ prefix this mem should not be used direclty</span>
        <span style="color: #3a81c3; font-weight: bold;">self</span>.<span style="color: #715ab1;">__cc</span>=10    <span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">__ prefix this mem can't access direclty</span>

<span style="color: #715ab1;">c1</span> = Counter <span style="color: #3a81c3;">(</span>5<span style="color: #3a81c3;">)</span>
<span style="color: #3a81c3;">print</span><span style="color: #3a81c3;">(</span>c1._c<span style="color: #3a81c3;">)</span>
<span style="color: #2aa1ae; background-color: #ecf3ec;">#</span><span style="color: #2aa1ae; background-color: #ecf3ec;">pritn(c1.__c)                          #  direclty can't access</span>
<span style="color: #3a81c3;">print</span><span style="color: #3a81c3;">(</span>c1._Counter__cc<span style="color: #3a81c3;">)</span>                  <span style="color: #2aa1ae; background-color: #ecf3ec;">#  </span><span style="color: #2aa1ae; background-color: #ecf3ec;">can access by "_CLASSNAmE__private variable"</span>
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-org59b5f16" class="outline-2">
<h2 id="org59b5f16"><span class="todo TODO">TODO</span> Decorateors [034,035_Decorators: Dynamics]</h2>
<div class="outline-text-2" id="text-org59b5f16">
<p>
1st class fuction :
closers:
</p>
</div>
<div id="outline-container-org5c64492" class="outline-3">
<h3 id="org5c64492">1st class Functions</h3>
<div class="outline-text-3" id="text-org5c64492">
<div class="org-src-container">
<pre class="src src-python"><span style="color: #3a81c3; font-weight: bold;">def</span> <span style="color: #6c3163; font-weight: bold;">outer_function</span> <span style="color: #3a81c3;">()</span>:
   <span style="color: #715ab1;">message</span> = <span style="color: #2d9574;">'Hi'</span>
   <span style="color: #3a81c3; font-weight: bold;">def</span> <span style="color: #6c3163; font-weight: bold;">inner_function</span><span style="color: #3a81c3;">()</span>:
       <span style="color: #3a81c3;">print</span><span style="color: #3a81c3;">(</span>message<span style="color: #3a81c3;">)</span>
<span style="color: #2aa1ae; background-color: #ecf3ec;">#   </span><span style="color: #2aa1ae; background-color: #ecf3ec;">return inner_function()</span>
   <span style="color: #3a81c3; font-weight: bold;">return</span> inner_function<span style="color: #3a81c3;">()</span>


<span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">outer_fuction()</span>
<span style="color: #715ab1;">my_func</span> = outer_function<span style="color: #3a81c3;">()</span>

my_func<span style="color: #3a81c3;">()</span>
my_func<span style="color: #3a81c3;">()</span>
my_func<span style="color: #3a81c3;">()</span>


<span style="color: #3a81c3; font-weight: bold;">def</span> <span style="color: #6c3163; font-weight: bold;">outer_function</span> <span style="color: #3a81c3;">(</span>msg<span style="color: #3a81c3;">)</span>:
   <span style="color: #715ab1;">message</span> = msg
   <span style="color: #3a81c3; font-weight: bold;">def</span> <span style="color: #6c3163; font-weight: bold;">inner_function</span><span style="color: #3a81c3;">()</span>:
       <span style="color: #3a81c3;">print</span><span style="color: #3a81c3;">(</span>message<span style="color: #3a81c3;">)</span>
   <span style="color: #3a81c3; font-weight: bold;">return</span> inner_function<span style="color: #3a81c3;">()</span>

<span style="color: #715ab1;">hi_func</span> = outer_function<span style="color: #3a81c3;">(</span><span style="color: #2d9574;">'Hi'</span><span style="color: #3a81c3;">)</span>
<span style="color: #715ab1;">bye_func</span> = outer_function<span style="color: #3a81c3;">(</span><span style="color: #2d9574;">'Bye'</span><span style="color: #3a81c3;">)</span>


hi_func<span style="color: #3a81c3;">()</span>
bye_func<span style="color: #3a81c3;">()</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org9b9f8d3" class="outline-3">
<h3 id="org9b9f8d3">Decoreators</h3>
<div class="outline-text-3" id="text-org9b9f8d3">
<div class="org-src-container">
<pre class="src src-python">
<span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">Decoreator</span>

<span style="color: #3a81c3; font-weight: bold;">def</span> <span style="color: #6c3163; font-weight: bold;">decorator_function</span><span style="color: #3a81c3;">(</span>original_func<span style="color: #3a81c3;">)</span>:
   <span style="color: #3a81c3; font-weight: bold;">def</span> <span style="color: #6c3163; font-weight: bold;">wrapper_function</span><span style="color: #3a81c3;">()</span>:
       <span style="color: #3a81c3; font-weight: bold;">return</span> original_func<span style="color: #3a81c3;">()</span>
   <span style="color: #3a81c3; font-weight: bold;">return</span> wrapper_function


<span style="color: #3a81c3; font-weight: bold;">def</span> <span style="color: #6c3163; font-weight: bold;">dispaly</span><span style="color: #3a81c3;">()</span>:
  <span style="color: #3a81c3;">print</span><span style="color: #3a81c3;">(</span><span style="color: #2d9574;">'display function ran'</span><span style="color: #3a81c3;">)</span>

<span style="color: #715ab1;">decorated_display</span> = decorator_function<span style="color: #3a81c3;">(</span>dispaly<span style="color: #3a81c3;">)</span>

decoreated_display<span style="color: #3a81c3;">()</span>

</pre>
</div>
</div>
</div>
</div>
