python.org
* In Class Property Decorator
=@property= is a built-in decorator that allows =class.methods= within a class to be accessed and managed like =class.attributes=. 
#+begin_src python
class Employee:
    def __init__(self,first,last):
        self.first = first
        self.last = last
        self.email = first + '.' + last + '@email.com'

    def fullname(self):
        return '{} {}'.format(self.first,self.last)
    
emp_1  = Employee("John", "Smith")
print(emp_1.first)
print(emp_1.email)
print(emp_1.fullname())      
#+end_src
Here =fullname()= is a method which we want to access a attribute to
- read the fullname as attribute  achived by =@property=
- set the fullname  as attribute achived by =@setter=
- deleting fullname(should del first and last attributes) achived by =@deleter=

#+begin_src python
class Employee:
    def __init__(self,first,last):
        self.first = first
        self.last = last
        self.email = first + '.' + last + '@email.com'
    @property
    def fullname(self):
        return '{} {}'.format(self.first,self.last)
        # READ: insted of using emp1.fullname()  we will use emp1.fullname
    
    @fullname.setter
    def fullname(self, name):
        first, last  = name.split(" ")
        self.first = first
        self.last = last
        # UPDATE: instead of (emp1.first = "Joe",emp1.last="Musk") we will used emp1.fullname = "Joe Musk"

    @fullname.deleter
    def fullname(self):
        print(f"Delete {self.fullname}")
        self.first = None
        self.last = None
     
    
emp_1  = Employee("John", "Smith")
print(emp_1.first)
print(emp_1.email)

print(emp_1.fullname)      # @property  print(emp_1.fullname())     

emp_1.fullname = "Joe Musk"  # @method.setter 
print(emp_1.first,emp_1, emp_1.fullname)  
# >>> Joe , Musk , Joe Musk

del emp_1.fullname
print(emp_1.first,emp_1, emp_1.fullname)  
# >>> None, None, None
#+end_src  

