python.html
<div id="outline-container-orga3eec31" class="outline-2">
<h2 id="orga3eec31">In Class Property Decorator</h2>
<div class="outline-text-2" id="text-orga3eec31">
<p>
<code>@property</code> is a built-in decorator that allows <code>class.methods</code> within a class to be accessed and managed like <code>class.attributes</code>. 
</p>
<div class="org-src-container">
<pre class="src src-python"><span style="color: #3a81c3; font-weight: bold;">class</span> <span style="color: #ba2f59; font-weight: bold;">Employee</span>:
    <span style="color: #3a81c3; font-weight: bold;">def</span> <span style="color: #6c3163; font-weight: bold;">__init__</span><span style="color: #3a81c3;">(</span><span style="color: #3a81c3; font-weight: bold;">self</span>,first,last<span style="color: #3a81c3;">)</span>:
        <span style="color: #3a81c3; font-weight: bold;">self</span>.<span style="color: #715ab1;">first</span> = first
        <span style="color: #3a81c3; font-weight: bold;">self</span>.<span style="color: #715ab1;">last</span> = last
        <span style="color: #3a81c3; font-weight: bold;">self</span>.<span style="color: #715ab1;">email</span> = first + <span style="color: #2d9574;">'.'</span> + last + <span style="color: #2d9574;">'@email.com'</span>

    <span style="color: #3a81c3; font-weight: bold;">def</span> <span style="color: #6c3163; font-weight: bold;">fullname</span><span style="color: #3a81c3;">(</span><span style="color: #3a81c3; font-weight: bold;">self</span><span style="color: #3a81c3;">)</span>:
        <span style="color: #3a81c3; font-weight: bold;">return</span> <span style="color: #2d9574;">'{} {}'</span>.<span style="color: #3a81c3;">format</span><span style="color: #3a81c3;">(</span><span style="color: #3a81c3; font-weight: bold;">self</span>.first,<span style="color: #3a81c3; font-weight: bold;">self</span>.last<span style="color: #3a81c3;">)</span>

<span style="color: #715ab1;">emp_1</span>  = Employee<span style="color: #3a81c3;">(</span><span style="color: #2d9574;">"John"</span>, <span style="color: #2d9574;">"Smith"</span><span style="color: #3a81c3;">)</span>
<span style="color: #3a81c3;">print</span><span style="color: #3a81c3;">(</span>emp_1.first<span style="color: #3a81c3;">)</span>
<span style="color: #3a81c3;">print</span><span style="color: #3a81c3;">(</span>emp_1.email<span style="color: #3a81c3;">)</span>
<span style="color: #3a81c3;">print</span><span style="color: #3a81c3;">(</span>emp_1.fullname<span style="color: #6c3163;">()</span><span style="color: #3a81c3;">)</span>      
</pre>
</div>
<p>
Here <code>fullname()</code> is a method which we want to access a attribute to
</p>
<ul class="org-ul">
<li>read the fullname as attribute  achived by <code>@property</code></li>
<li>set the fullname  as attribute achived by <code>@setter</code></li>
<li>deleting fullname(should del first and last attributes) achived by <code>@deleter</code></li>
</ul>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #3a81c3; font-weight: bold;">class</span> <span style="color: #ba2f59; font-weight: bold;">Employee</span>:
    <span style="color: #3a81c3; font-weight: bold;">def</span> <span style="color: #6c3163; font-weight: bold;">__init__</span><span style="color: #3a81c3;">(</span><span style="color: #3a81c3; font-weight: bold;">self</span>,first,last<span style="color: #3a81c3;">)</span>:
        <span style="color: #3a81c3; font-weight: bold;">self</span>.<span style="color: #715ab1;">first</span> = first
        <span style="color: #3a81c3; font-weight: bold;">self</span>.<span style="color: #715ab1;">last</span> = last
        <span style="color: #3a81c3; font-weight: bold;">self</span>.<span style="color: #715ab1;">email</span> = first + <span style="color: #2d9574;">'.'</span> + last + <span style="color: #2d9574;">'@email.com'</span>
    @<span style="color: #3a81c3;">property</span>
    <span style="color: #3a81c3; font-weight: bold;">def</span> <span style="color: #6c3163; font-weight: bold;">fullname</span><span style="color: #3a81c3;">(</span><span style="color: #3a81c3; font-weight: bold;">self</span><span style="color: #3a81c3;">)</span>:
        <span style="color: #3a81c3; font-weight: bold;">return</span> <span style="color: #2d9574;">'{} {}'</span>.<span style="color: #3a81c3;">format</span><span style="color: #3a81c3;">(</span><span style="color: #3a81c3; font-weight: bold;">self</span>.first,<span style="color: #3a81c3; font-weight: bold;">self</span>.last<span style="color: #3a81c3;">)</span>
        <span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">READ: insted of using emp1.fullname()  we will use emp1.fullname</span>

    <span style="color: #ba2f59; font-weight: bold;">@fullname.setter</span>
    <span style="color: #3a81c3; font-weight: bold;">def</span> <span style="color: #6c3163; font-weight: bold;">fullname</span><span style="color: #3a81c3;">(</span><span style="color: #3a81c3; font-weight: bold;">self</span>, name<span style="color: #3a81c3;">)</span>:
        <span style="color: #715ab1;">first</span>, <span style="color: #715ab1;">last</span>  = name.split<span style="color: #3a81c3;">(</span><span style="color: #2d9574;">" "</span><span style="color: #3a81c3;">)</span>
        <span style="color: #3a81c3; font-weight: bold;">self</span>.<span style="color: #715ab1;">first</span> = first
        <span style="color: #3a81c3; font-weight: bold;">self</span>.<span style="color: #715ab1;">last</span> = last
        <span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">UPDATE: instead of (emp1.first = "Joe",emp1.last="Musk") we will used emp1.fullname = "Joe Musk"</span>

    <span style="color: #ba2f59; font-weight: bold;">@fullname.deleter</span>
    <span style="color: #3a81c3; font-weight: bold;">def</span> <span style="color: #6c3163; font-weight: bold;">fullname</span><span style="color: #3a81c3;">(</span><span style="color: #3a81c3; font-weight: bold;">self</span><span style="color: #3a81c3;">)</span>:
        <span style="color: #3a81c3;">print</span><span style="color: #3a81c3;">(</span>f<span style="color: #2d9574;">"Delete </span>{<span style="color: #3a81c3; font-weight: bold;">self</span>.fullname}<span style="color: #2d9574;">"</span><span style="color: #3a81c3;">)</span>
        <span style="color: #3a81c3; font-weight: bold;">self</span>.<span style="color: #715ab1;">first</span> = <span style="color: #4e3163;">None</span>
        <span style="color: #3a81c3; font-weight: bold;">self</span>.<span style="color: #715ab1;">last</span> = <span style="color: #4e3163;">None</span>


<span style="color: #715ab1;">emp_1</span>  = Employee<span style="color: #3a81c3;">(</span><span style="color: #2d9574;">"John"</span>, <span style="color: #2d9574;">"Smith"</span><span style="color: #3a81c3;">)</span>
<span style="color: #3a81c3;">print</span><span style="color: #3a81c3;">(</span>emp_1.first<span style="color: #3a81c3;">)</span>
<span style="color: #3a81c3;">print</span><span style="color: #3a81c3;">(</span>emp_1.email<span style="color: #3a81c3;">)</span>

<span style="color: #3a81c3;">print</span><span style="color: #3a81c3;">(</span>emp_1.fullname<span style="color: #3a81c3;">)</span>      <span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">@property  print(emp_1.fullname())     </span>

emp_1.<span style="color: #715ab1;">fullname</span> = <span style="color: #2d9574;">"Joe Musk"</span>  <span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">@method.setter </span>
<span style="color: #3a81c3;">print</span><span style="color: #3a81c3;">(</span>emp_1.first,emp_1, emp_1.fullname<span style="color: #3a81c3;">)</span>  
<span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">&gt;&gt;&gt; Joe , Musk , Joe Musk</span>

<span style="color: #3a81c3; font-weight: bold;">del</span> emp_1.fullname
<span style="color: #3a81c3;">print</span><span style="color: #3a81c3;">(</span>emp_1.first,emp_1, emp_1.fullname<span style="color: #3a81c3;">)</span>  
<span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">&gt;&gt;&gt; None, None, None</span>
</pre>
</div>
</div>
</div>
