python.org
* Logging
https://www.youtube.com/c/Coreyms/search?query=log

#+begin_src python
import logging 

# Logging Types 

# - DEBUG : Detailed information, typically of intrest only when dignosing problems
# - INFO : Confirmation that things are working as expected.

# # # # # # # 
# NOTE : below warning , error and critical will print the msg in console 
# # # # # # # 

# - WARNING: An indication that something unexpected happened, or indicative of some problem in the near future (eg. 'disk space low'). The software is still working as expected.

# - ERRRO : Due to a more serious problem, the software has not been able to perform some function. 

# - CRITICAL : A serious error, indication that the program itself may be unable to continue running.
 


# # # 
# Logging to a file  `test.log`
# # #
# logging.basicConfig(filename='test.log', level=logging.DEBUG)

# with format 
 logging.basicConfig(filename='test.log', level=logging.DEBUG, format = '%(asctime)s:%(levelname)s:%(message)s')


def divide(x,y):
    
def add(x,y)

def multiply(x,y)

x = 20,
y = 10

add_result = add(num_1, num_2)
logging.debug('Add: {} + {} = {}'.format(num_1, num_2, add_result))

sub_reult = sub(num_1, num_2)
logging.debug('Sub:{} -{} = {}'.fomat(num_1, num_2, sub_result))

mul_result = multiply (num_1, num_2)
logging.debug('Mul:{}*{} = {}'.fomat(num_1, num_2)
#+end_src

** TODO Advance Logging
* TODO iterators and Generators [033_Generator: Coreymschafer]
* Garbage Collector
Python del unnessary obj automatically to free memory space called Garbage Collector

Python garbage collector runs during program execution and is triggered when an obj ref difference count reach zero

obj refrence count increase when it is assigned a new name or palced in a container(list,tuble,dictionary)

obj refrence count decreses when it's delete with del , its reference reassigned or it refrene goes out if scope


* Python API Development - Comprehensive Course for Beginners
https://www.youtube.com/watch?v=0sOvCWFmrtA

* ------------- other sources----------
* Developer
#+begin_src python
pip --help
pip help install
pip search Pympler
pip install Pympler
pip list
pip list -o # give package which are outdate
pip freeze > requirements.txt

# install package using requirements
pip install -r requirements.txt  # r: requirment file

pip list --outdated
# how to isntall 
pip freeze --local | grep -v '^\-e' | cut -d = -f 1 | xargs -n1 pip install -U



#+end_src
* Python interviews
** begininners
write code on whiteboard or paper
basic control flow: for, while, ifelse
discuss how to use python 
web scrapping
own py projects
solve common interview problems : buzz, fibonacius,python interview questions
data types: string,list.tubles, dict,set,
list comprehension:
dict
for key,val in my_dic.iteritems

set
know how to use generators: functions  
** TODO yield
xrange

basics of oop 
* GENERAL interview
github
database
command-line (terminal)
unit testing (continous intergration / delivery )

Continous intergration  :
Jenkins
Travis CI
Learning muliple programming langagure
python,c ,java,c++,c#,r,js,php,go,swift


quote

ones you understand a programming (code)  the languages are just syntax

and you can pickup syntax lot faster than concepts

Learning how to solve problems(concept) will take years to learn



* Online Learning Resoures:
Udacity          : Cources by google, facebook, mongobd, clouder, at&t
mitOpenCourseware:

You can search ur faourte university courses

Stanford:
Google Developers:

Derek Banas: Sofware design patterns, 
Computerphile:

Eli ComputerGuy    : main  system adim, networking
LearnCode.academy  : web dev
LEvelUp Tuts       : web dev
DevTips            : web design
realcsstricks      : real word progple
php academy        : 
sentdex : python


Confernec : PyCon2015,

Khanaacademy: 

###  math skill's 

Nodeschool.io : terminal app + terminal cmd

codeacademy   : web dev skill ( online  writring code)
              : # API TUTORIALS 
treehouse     : payed
lynda         : payed

twitter: follow (guido  van Rossum, Raymondh, david Beazley)

Codepen       :

redit         :
hacker News   :

Free Books:
github: vhf/free-prgramming-books 


    





 


* Question
** assigment in python 
'=' is python : refrence of obj on RHS to LHS
#+BEGIN_SRC python
lhs_obj = rhs_obj 
# lsh_obj  is now name for reference to object on rhs_obj
#+END_SRC


