python.html
<div id="outline-container-org59a243a" class="outline-2">
<h2 id="org59a243a">Logging</h2>
<div class="outline-text-2" id="text-org59a243a">
<p>
<a href="https://www.youtube.com/c/Coreyms/search?query=log">https://www.youtube.com/c/Coreyms/search?query=log</a>
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #3a81c3; font-weight: bold;">import</span> logging 

<span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">Logging Types </span>

<span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">- DEBUG : Detailed information, typically of intrest only when dignosing problems</span>
<span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">- INFO : Confirmation that things are working as expected.</span>

<span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;"># # # # # # </span>
<span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">NOTE : below warning , error and critical will print the msg in console </span>
<span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;"># # # # # # </span>

<span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">- WARNING: An indication that something unexpected happened, or indicative of some problem in the near future (eg. 'disk space low'). The software is still working as expected.</span>

<span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">- ERRRO : Due to a more serious problem, the software has not been able to perform some function. </span>

<span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">- CRITICAL : A serious error, indication that the program itself may be unable to continue running.</span>



<span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;"># # </span>
<span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">Logging to a file  `test.log`</span>
<span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;"># #</span>
<span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">logging.basicConfig(filename='test.log', level=logging.DEBUG)</span>

<span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">with format </span>
 logging.basicConfig<span style="color: #3a81c3;">(</span>filename=<span style="color: #2d9574;">'test.log'</span>, level=logging.DEBUG, <span style="color: #3a81c3;">format</span> = <span style="color: #2d9574;">'%(asctime)s:%(levelname)s:%(message)s'</span><span style="color: #3a81c3;">)</span>


<span style="color: #3a81c3; font-weight: bold;">def</span> <span style="color: #6c3163; font-weight: bold;">divide</span><span style="color: #3a81c3;">(</span>x,y<span style="color: #3a81c3;">)</span>:

<span style="color: #3a81c3; font-weight: bold;">def</span> <span style="color: #6c3163; font-weight: bold;">add</span><span style="color: #3a81c3;">(</span>x,y<span style="color: #3a81c3;">)</span>

<span style="color: #3a81c3; font-weight: bold;">def</span> <span style="color: #6c3163; font-weight: bold;">multiply</span><span style="color: #3a81c3;">(</span>x,y<span style="color: #3a81c3;">)</span>

<span style="color: #715ab1;">x</span> = 20,
<span style="color: #715ab1;">y</span> = 10

<span style="color: #715ab1;">add_result</span> = add<span style="color: #3a81c3;">(</span>num_1, num_2<span style="color: #3a81c3;">)</span>
logging.debug<span style="color: #3a81c3;">(</span><span style="color: #2d9574;">'Add: {} + {} = {}'</span>.<span style="color: #3a81c3;">format</span><span style="color: #6c3163;">(</span>num_1, num_2, add_result<span style="color: #6c3163;">)</span><span style="color: #3a81c3;">)</span>

<span style="color: #715ab1;">sub_reult</span> = sub<span style="color: #3a81c3;">(</span>num_1, num_2<span style="color: #3a81c3;">)</span>
logging.debug<span style="color: #3a81c3;">(</span><span style="color: #2d9574;">'Sub:{} -{} = {}'</span>.fomat<span style="color: #6c3163;">(</span>num_1, num_2, sub_result<span style="color: #6c3163;">)</span><span style="color: #3a81c3;">)</span>

<span style="color: #715ab1;">mul_result</span> = multiply <span style="color: #3a81c3;">(</span>num_1, num_2<span style="color: #3a81c3;">)</span>
logging.debug<span style="color: #3a81c3;">(</span><span style="color: #2d9574;">'Mul:{}*{} = {}'</span>.fomat<span style="color: #6c3163;">(</span>num_1, num_2<span style="color: #6c3163;">)</span>
</pre>
</div>
</div>
<div id="outline-container-org6dab778" class="outline-3">
<h3 id="org6dab778"><span class="todo TODO">TODO</span> Advance Logging</h3>
</div>
</div>
<div id="outline-container-org289a2a7" class="outline-2">
<h2 id="org289a2a7"><span class="todo TODO">TODO</span> iterators and Generators [033_Generator: Coreymschafer]</h2>
</div>
<div id="outline-container-org6b18dce" class="outline-2">
<h2 id="org6b18dce">Garbage Collector</h2>
<div class="outline-text-2" id="text-org6b18dce">
<p>
Python del unnessary obj automatically to free memory space called Garbage Collector
</p>

<p>
Python garbage collector runs during program execution and is triggered when an obj ref difference count reach zero
</p>

<p>
obj refrence count increase when it is assigned a new name or palced in a container(list,tuble,dictionary)
</p>

<p>
obj refrence count decreses when it's delete with del , its reference reassigned or it refrene goes out if scope
</p>
</div>
</div>
<div id="outline-container-org85ea46d" class="outline-2">
<h2 id="org85ea46d">Python API Development - Comprehensive Course for Beginners</h2>
<div class="outline-text-2" id="text-org85ea46d">
<p>
<a href="https://www.youtube.com/watch?v=0sOvCWFmrtA">https://www.youtube.com/watch?v=0sOvCWFmrtA</a>
</p>
</div>
</div>
<div id="outline-container-orgd769531" class="outline-2">
<h2 id="orgd769531">--------&#x2013;&#x2014; other sources----------</h2>
</div>
<div id="outline-container-orgf66d81e" class="outline-2">
<h2 id="orgf66d81e">Developer</h2>
<div class="outline-text-2" id="text-orgf66d81e">
<div class="org-src-container">
<pre class="src src-python">pip --<span style="color: #3a81c3;">help</span>
pip <span style="color: #3a81c3;">help</span> install
pip search Pympler
pip install Pympler
pip <span style="color: #3a81c3;">list</span>
pip <span style="color: #3a81c3;">list</span> -o <span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">give package which are outdate</span>
pip freeze &gt; requirements.txt

<span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">install package using requirements</span>
pip install -r requirements.txt  <span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">r: requirment file</span>

pip <span style="color: #3a81c3;">list</span> --outdated
<span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">how to isntall </span>
pip freeze --local | grep -v <span style="color: #2d9574;">'^\-e'</span> | cut -<span style="color: #715ab1;">d</span> = -f 1 | xargs -n1 pip install -U



</pre>
</div>
</div>
</div>
<div id="outline-container-orgdc375d3" class="outline-2">
<h2 id="orgdc375d3">Python interviews</h2>
<div class="outline-text-2" id="text-orgdc375d3">
</div>
<div id="outline-container-orgb7233a1" class="outline-3">
<h3 id="orgb7233a1">begininners</h3>
<div class="outline-text-3" id="text-orgb7233a1">
<p>
write code on whiteboard or paper
basic control flow: for, while, ifelse
discuss how to use python 
web scrapping
own py projects
solve common interview problems : buzz, fibonacius,python interview questions
data types: string,list.tubles, dict,set,
list comprehension:
dict
for key,val in my_dic.iteritems
</p>

<p>
set
know how to use generators: functions  
</p>
</div>
</div>
<div id="outline-container-org789f926" class="outline-3">
<h3 id="org789f926"><span class="todo TODO">TODO</span> yield</h3>
<div class="outline-text-3" id="text-org789f926">
<p>
xrange
</p>

<p>
basics of oop 
</p>
</div>
</div>
</div>
<div id="outline-container-org2d12cc6" class="outline-2">
<h2 id="org2d12cc6">GENERAL interview</h2>
<div class="outline-text-2" id="text-org2d12cc6">
<p>
github
database
command-line (terminal)
unit testing (continous intergration / delivery )
</p>

<p>
Continous intergration  :
Jenkins
Travis CI
Learning muliple programming langagure
python,c ,java,c++,c#,r,js,php,go,swift
</p>


<p>
quote
</p>

<p>
ones you understand a programming (code)  the languages are just syntax
</p>

<p>
and you can pickup syntax lot faster than concepts
</p>

<p>
Learning how to solve problems(concept) will take years to learn
</p>
</div>
</div>
<div id="outline-container-orgfd87c27" class="outline-2">
<h2 id="orgfd87c27">Online Learning Resoures:</h2>
<div class="outline-text-2" id="text-orgfd87c27">
<p>
Udacity          : Cources by google, facebook, mongobd, clouder, at&amp;t
mitOpenCourseware:
</p>

<p>
You can search ur faourte university courses
</p>

<p>
Stanford:
Google Developers:
</p>

<p>
Derek Banas: Sofware design patterns, 
Computerphile:
</p>

<p>
Eli ComputerGuy    : main  system adim, networking
LearnCode.academy  : web dev
LEvelUp Tuts       : web dev
DevTips            : web design
realcsstricks      : real word progple
php academy        : 
sentdex : python
</p>


<p>
Confernec : PyCon2015,
</p>

<p>
Khanaacademy: 
</p>

<p>
###  math skill's 
</p>

<p>
Nodeschool.io : terminal app + terminal cmd
</p>

<p>
codeacademy   : web dev skill ( online  writring code)
</p>
<pre class="example">
# API TUTORIALS 
</pre>

<p>
treehouse     : payed
lynda         : payed
</p>

<p>
twitter: follow (guido  van Rossum, Raymondh, david Beazley)
</p>

<p>
Codepen       :
</p>

<p>
redit         :
hacker News   :
</p>

<p>
Free Books:
github: vhf/free-prgramming-books 
</p>
</div>
</div>
<div id="outline-container-orge5042ed" class="outline-2">
<h2 id="orge5042ed">Question</h2>
<div class="outline-text-2" id="text-orge5042ed">
</div>
<div id="outline-container-orged2471f" class="outline-3">
<h3 id="orged2471f">assigment in python</h3>
<div class="outline-text-3" id="text-orged2471f">
<p>
'=' is python : refrence of obj on RHS to LHS
</p>
<div class="org-src-container">
<pre class="src src-python"><span style="color: #715ab1;">lhs_obj</span> = rhs_obj 
<span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">lsh_obj  is now name for reference to object on rhs_obj</span>
</pre>
</div>
</div>
</div>
